#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_MountedTurret

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct AnimBP_MountedTurret.AnimBP_MountedTurret_C.AnimBlueprintGeneratedConstantData
// 0x0177 (0x0178 - 0x0001)
struct AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_131;                            // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_132;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_133;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_134;                                  // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_135;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_136;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_137;                                // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_138;                                  // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_139;                                // 0x0038(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_140;                                // 0x0039(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_141;                               // 0x0040(0x0010)(BlueprintVisible, EditFixedSize)
	class UAnimSequenceBase*                      __AnimSequenceBase_142;                            // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_143;                                // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_144;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_145;                                // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_146;                                 // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_147;                              // 0x0068(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_148;                               // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_149;                            // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_150;                                // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_151;                                 // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_152;                                // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_153;                               // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESequenceEvalReinit                           __ByteProperty_154;                                // 0x00B0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_155;                                // 0x00B1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_156;                            // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_157;                                // 0x00C0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_158;                                // 0x00C1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_159;                                // 0x00C2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_160;                                // 0x00C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_161;                              // 0x00C8(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00E0(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0160(0x0018)()
};
static_assert(alignof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData) == 0x000178, "Wrong size on AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_131) == 0x000008, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_131' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __NameProperty_132) == 0x000010, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__NameProperty_132' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __IntProperty_133) == 0x000014, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__IntProperty_133' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __BlendSpace_134) == 0x000018, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__BlendSpace_134' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __NameProperty_135) == 0x000020, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__NameProperty_135' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __IntProperty_136) == 0x000024, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__IntProperty_136' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __BlendProfile_137) == 0x000028, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__BlendProfile_137' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __CurveFloat_138) == 0x000030, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__CurveFloat_138' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __EnumProperty_139) == 0x000038, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__EnumProperty_139' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __EnumProperty_140) == 0x000039, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__EnumProperty_140' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __ArrayProperty_141) == 0x000040, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__ArrayProperty_141' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_142) == 0x000050, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_142' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __EnumProperty_143) == 0x000058, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__EnumProperty_143' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __NameProperty_144) == 0x00005C, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__NameProperty_144' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __NameProperty_145) == 0x000060, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__NameProperty_145' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __IntProperty_146) == 0x000064, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__IntProperty_146' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __StructProperty_147) == 0x000068, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__StructProperty_147' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __FloatProperty_148) == 0x000094, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__FloatProperty_148' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_149) == 0x000098, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_149' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __NameProperty_150) == 0x0000A0, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__NameProperty_150' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __IntProperty_151) == 0x0000A4, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__IntProperty_151' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __NameProperty_152) == 0x0000A8, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__NameProperty_152' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __FloatProperty_153) == 0x0000AC, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__FloatProperty_153' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __ByteProperty_154) == 0x0000B0, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__ByteProperty_154' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __BoolProperty_155) == 0x0000B1, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__BoolProperty_155' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_156) == 0x0000B8, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_156' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __BoolProperty_157) == 0x0000C0, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__BoolProperty_157' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __EnumProperty_158) == 0x0000C1, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__EnumProperty_158' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __ByteProperty_159) == 0x0000C2, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__ByteProperty_159' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __NameProperty_160) == 0x0000C4, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__NameProperty_160' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, __StructProperty_161) == 0x0000C8, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::__StructProperty_161' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000E0, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000160, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct AnimBP_MountedTurret.AnimBP_MountedTurret_C.AnimBlueprintGeneratedMutableData
// 0x000B (0x000C - 0x0001)
struct AnimBP_MountedTurret::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_MountedTurret::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on AnimBP_MountedTurret::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AnimBP_MountedTurret::FAnimBlueprintGeneratedMutableData) == 0x00000C, "Wrong size on AnimBP_MountedTurret::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000008, "Member 'AnimBP_MountedTurret::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");

}

