#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_MountedTurret

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_MountedTurret.AnimBP_MountedTurret_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AnimBP_MountedTurret_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(AnimBP_MountedTurret_C_AnimGraph) == 0x000008, "Wrong alignment on AnimBP_MountedTurret_C_AnimGraph");
static_assert(sizeof(AnimBP_MountedTurret_C_AnimGraph) == 0x000010, "Wrong size on AnimBP_MountedTurret_C_AnimGraph");
static_assert(offsetof(AnimBP_MountedTurret_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'AnimBP_MountedTurret_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function AnimBP_MountedTurret.AnimBP_MountedTurret_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_MountedTurret_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_MountedTurret_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on AnimBP_MountedTurret_C_BlueprintUpdateAnimation");
static_assert(sizeof(AnimBP_MountedTurret_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on AnimBP_MountedTurret_C_BlueprintUpdateAnimation");
static_assert(offsetof(AnimBP_MountedTurret_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'AnimBP_MountedTurret_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function AnimBP_MountedTurret.AnimBP_MountedTurret_C.ExecuteUbergraph_AnimBP_MountedTurret
// 0x0068 (0x0068 - 0x0000)
struct AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_NormalizeAxis_ReturnValue;                // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeAxis_ReturnValue_1;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeAxis_ReturnValue_2;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeAxis_ReturnValue_3;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeAxis_ReturnValue_4;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret) == 0x000008, "Wrong alignment on AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret");
static_assert(sizeof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret) == 0x000068, "Wrong size on AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, EntryPoint) == 0x000000, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::EntryPoint' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, Temp_float_Variable) == 0x000004, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, Temp_bool_Variable) == 0x000008, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_NormalizeAxis_ReturnValue) == 0x00000C, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_NormalizeAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_NormalizeAxis_ReturnValue_1) == 0x000010, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_NormalizeAxis_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_MakeRotator_ReturnValue) == 0x000018, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, K2Node_Event_DeltaTimeX) == 0x000030, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_NormalizeAxis_ReturnValue_2) == 0x000034, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_NormalizeAxis_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000038, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00003C, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_FMax_ReturnValue) == 0x000040, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_NormalizeAxis_ReturnValue_3) == 0x000044, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_NormalizeAxis_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000048, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_NormalizeAxis_ReturnValue_4) == 0x00004C, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_NormalizeAxis_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, K2Node_Select_Default) == 0x000050, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000058, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'AnimBP_MountedTurret_C_ExecuteUbergraph_AnimBP_MountedTurret::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

