#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Mounted_Cannon

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct AnimBP_Mounted_Cannon.AnimBP_Mounted_Cannon_C.AnimBlueprintGeneratedConstantData
// 0x0117 (0x0118 - 0x0001)
struct AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_62;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_63;                                   // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_64;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_65;                                  // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_66;                                 // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_67;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_68;                               // 0x0020(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_69;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_70;                             // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_71;                                 // 0x0058(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_72;                                 // 0x0059(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_73;                                 // 0x005A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_74;                                 // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_75;                                 // 0x0060(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_76;                                  // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_77;                               // 0x0068(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0080(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0100(0x0018)()
};
static_assert(alignof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData) == 0x000118, "Wrong size on AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData, __NameProperty_62) == 0x000004, "Member 'AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData::__NameProperty_62' has a wrong offset!");
static_assert(offsetof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData, __BlendSpace_63) == 0x000008, "Member 'AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData::__BlendSpace_63' has a wrong offset!");
static_assert(offsetof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData, __NameProperty_64) == 0x000010, "Member 'AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData::__NameProperty_64' has a wrong offset!");
static_assert(offsetof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData, __IntProperty_65) == 0x000014, "Member 'AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData::__IntProperty_65' has a wrong offset!");
static_assert(offsetof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData, __BoolProperty_66) == 0x000018, "Member 'AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData::__BoolProperty_66' has a wrong offset!");
static_assert(offsetof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData, __FloatProperty_67) == 0x00001C, "Member 'AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData::__FloatProperty_67' has a wrong offset!");
static_assert(offsetof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData, __StructProperty_68) == 0x000020, "Member 'AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData::__StructProperty_68' has a wrong offset!");
static_assert(offsetof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData, __FloatProperty_69) == 0x00004C, "Member 'AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData::__FloatProperty_69' has a wrong offset!");
static_assert(offsetof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_70) == 0x000050, "Member 'AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_70' has a wrong offset!");
static_assert(offsetof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData, __BoolProperty_71) == 0x000058, "Member 'AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData::__BoolProperty_71' has a wrong offset!");
static_assert(offsetof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData, __EnumProperty_72) == 0x000059, "Member 'AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData::__EnumProperty_72' has a wrong offset!");
static_assert(offsetof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData, __ByteProperty_73) == 0x00005A, "Member 'AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData::__ByteProperty_73' has a wrong offset!");
static_assert(offsetof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData, __NameProperty_74) == 0x00005C, "Member 'AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData::__NameProperty_74' has a wrong offset!");
static_assert(offsetof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData, __NameProperty_75) == 0x000060, "Member 'AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData::__NameProperty_75' has a wrong offset!");
static_assert(offsetof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData, __IntProperty_76) == 0x000064, "Member 'AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData::__IntProperty_76' has a wrong offset!");
static_assert(offsetof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData, __StructProperty_77) == 0x000068, "Member 'AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData::__StructProperty_77' has a wrong offset!");
static_assert(offsetof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000080, "Member 'AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000100, "Member 'AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct AnimBP_Mounted_Cannon.AnimBP_Mounted_Cannon_C.AnimBlueprintGeneratedMutableData
// 0x0007 (0x0008 - 0x0001)
struct AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong size on AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");

}

