#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Mounted_Cannon

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "AnimBP_Mounted_Cannon_structs.hpp"
#include "Engine_structs.hpp"
#include "ResolveCannonRuntime_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Mounted_Cannon.AnimBP_Mounted_Cannon_C
// 0x04D0 (0x0AA0 - 0x05D0)
class UAnimBP_Mounted_Cannon_C final : public UFortVehicleAnimInstance_MountedCannon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct AnimBP_Mounted_Cannon::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x05D8(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x05E0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x05E8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x05F0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0610(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0630(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0758(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0778(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x07C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x07E8(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x0810(0x0110)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0920(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0960(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0980(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x09C0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x09E0(0x00B8)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Mounted_Cannon_AnimGraphNode_ModifyBone_9620BB6945E1C597ABB103BD90A5BF10();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Mounted_Cannon_AnimGraphNode_RotationOffsetBlendSpace_B4DDA68D41FF4C229C198C987977DC45();
	void ExecuteUbergraph_AnimBP_Mounted_Cannon(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_Mounted_Cannon_C">();
	}
	static class UAnimBP_Mounted_Cannon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Mounted_Cannon_C>();
	}
};
static_assert(alignof(UAnimBP_Mounted_Cannon_C) == 0x000010, "Wrong alignment on UAnimBP_Mounted_Cannon_C");
static_assert(sizeof(UAnimBP_Mounted_Cannon_C) == 0x000AA0, "Wrong size on UAnimBP_Mounted_Cannon_C");
static_assert(offsetof(UAnimBP_Mounted_Cannon_C, UberGraphFrame) == 0x0005D0, "Member 'UAnimBP_Mounted_Cannon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAnimBP_Mounted_Cannon_C, __AnimBlueprintMutables) == 0x0005D8, "Member 'UAnimBP_Mounted_Cannon_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UAnimBP_Mounted_Cannon_C, AnimBlueprintExtension_PropertyAccess) == 0x0005E0, "Member 'UAnimBP_Mounted_Cannon_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UAnimBP_Mounted_Cannon_C, AnimBlueprintExtension_Base) == 0x0005E8, "Member 'UAnimBP_Mounted_Cannon_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UAnimBP_Mounted_Cannon_C, AnimGraphNode_Root) == 0x0005F0, "Member 'UAnimBP_Mounted_Cannon_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAnimBP_Mounted_Cannon_C, AnimGraphNode_ComponentToLocalSpace) == 0x000610, "Member 'UAnimBP_Mounted_Cannon_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UAnimBP_Mounted_Cannon_C, AnimGraphNode_ModifyBone) == 0x000630, "Member 'UAnimBP_Mounted_Cannon_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UAnimBP_Mounted_Cannon_C, AnimGraphNode_LocalToComponentSpace) == 0x000758, "Member 'UAnimBP_Mounted_Cannon_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UAnimBP_Mounted_Cannon_C, AnimGraphNode_Slot) == 0x000778, "Member 'UAnimBP_Mounted_Cannon_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UAnimBP_Mounted_Cannon_C, AnimGraphNode_TransitionResult_1) == 0x0007C0, "Member 'UAnimBP_Mounted_Cannon_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Mounted_Cannon_C, AnimGraphNode_TransitionResult) == 0x0007E8, "Member 'UAnimBP_Mounted_Cannon_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UAnimBP_Mounted_Cannon_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x000810, "Member 'UAnimBP_Mounted_Cannon_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UAnimBP_Mounted_Cannon_C, AnimGraphNode_SequencePlayer_1) == 0x000920, "Member 'UAnimBP_Mounted_Cannon_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Mounted_Cannon_C, AnimGraphNode_StateResult_1) == 0x000960, "Member 'UAnimBP_Mounted_Cannon_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UAnimBP_Mounted_Cannon_C, AnimGraphNode_SequencePlayer) == 0x000980, "Member 'UAnimBP_Mounted_Cannon_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UAnimBP_Mounted_Cannon_C, AnimGraphNode_StateResult) == 0x0009C0, "Member 'UAnimBP_Mounted_Cannon_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UAnimBP_Mounted_Cannon_C, AnimGraphNode_StateMachine) == 0x0009E0, "Member 'UAnimBP_Mounted_Cannon_C::AnimGraphNode_StateMachine' has a wrong offset!");

}

