#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimNotify_FlapJackSyrupON

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimNotify_FlapJackSyrupON.AnimNotify_FlapJackSyrupON_C.Received_NotifyEnd
// 0x00B8 (0x00B8 - 0x0000)
struct AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEventReference              EventReference;                                    // 0x0010(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Armor_Head_Opaque_MID;                             // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               HeadSyrup;                                         // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Variant;                                   // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue;   // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue_1; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_GetVariantChannelActiveIndexForSlot_Index; // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetVariantChannelActiveIndexForSlot_bIndexIsValid; // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetVariantChannelActiveIndexForSlot_bFoundChannel; // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd) == 0x000008, "Wrong alignment on AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd");
static_assert(sizeof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd) == 0x0000B8, "Wrong size on AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, EventReference) == 0x000010, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::EventReference' has a wrong offset!");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, ReturnValue) == 0x000038, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, Armor_Head_Opaque_MID) == 0x000040, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::Armor_Head_Opaque_MID' has a wrong offset!");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, HeadSyrup) == 0x000048, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::HeadSyrup' has a wrong offset!");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, Current_Variant) == 0x000050, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::Current_Variant' has a wrong offset!");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, CallFunc_GetOwner_ReturnValue) == 0x000058, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, CallFunc_GetOwner_ReturnValue_1) == 0x000060, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000068, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x000078, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, CallFunc_GetSkeletalMeshForPartType_ReturnValue) == 0x000088, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::CallFunc_GetSkeletalMeshForPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000090, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, CallFunc_GetSkeletalMeshForPartType_ReturnValue_1) == 0x000098, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::CallFunc_GetSkeletalMeshForPartType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, K2Node_MakeArray_Array) == 0x0000A0, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, CallFunc_GetVariantChannelActiveIndexForSlot_Index) == 0x0000B0, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::CallFunc_GetVariantChannelActiveIndexForSlot_Index' has a wrong offset!");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, CallFunc_GetVariantChannelActiveIndexForSlot_bIndexIsValid) == 0x0000B4, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::CallFunc_GetVariantChannelActiveIndexForSlot_bIndexIsValid' has a wrong offset!");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, CallFunc_GetVariantChannelActiveIndexForSlot_bFoundChannel) == 0x0000B5, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::CallFunc_GetVariantChannelActiveIndexForSlot_bFoundChannel' has a wrong offset!");
static_assert(offsetof(AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd, K2Node_SwitchInteger_CmpSuccess) == 0x0000B6, "Member 'AnimNotify_FlapJackSyrupON_C_Received_NotifyEnd::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

}

