#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc.B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C.On Pawn Landed
// 0x00E0 (0x00E0 - 0x0000)
struct B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_On_Pawn_Landed final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_On_Pawn_Landed) == 0x000008, "Wrong alignment on B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_On_Pawn_Landed");
static_assert(sizeof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_On_Pawn_Landed) == 0x0000E0, "Wrong size on B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_On_Pawn_Landed");
static_assert(offsetof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_On_Pawn_Landed, Hit) == 0x000000, "Member 'B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_On_Pawn_Landed::Hit' has a wrong offset!");

// Function B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc.B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C.On Character Movement Updated
// 0x0038 (0x0038 - 0x0000)
struct B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_On_Character_Movement_Updated final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OldLocation;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OldVelocity;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_On_Character_Movement_Updated) == 0x000008, "Wrong alignment on B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_On_Character_Movement_Updated");
static_assert(sizeof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_On_Character_Movement_Updated) == 0x000038, "Wrong size on B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_On_Character_Movement_Updated");
static_assert(offsetof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_On_Character_Movement_Updated, DeltaSeconds) == 0x000000, "Member 'B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_On_Character_Movement_Updated::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_On_Character_Movement_Updated, OldLocation) == 0x000008, "Member 'B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_On_Character_Movement_Updated::OldLocation' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_On_Character_Movement_Updated, OldVelocity) == 0x000020, "Member 'B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_On_Character_Movement_Updated::OldVelocity' has a wrong offset!");

// Function B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc.B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C.ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc
// 0x0168 (0x0168 - 0x0000)
struct B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_OldLocation;                          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_OldVelocity;                          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_GetIdleVFXComponent_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0048(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsMovingOnGround_ReturnValue;             // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue; // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECosmeticModifierOutExec                      CallFunc_SpawnSystemAttachedPartModifier_OutExec;  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttachedPartModifier_ReturnValue; // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc) == 0x000008, "Wrong alignment on B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc");
static_assert(sizeof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc) == 0x000168, "Wrong size on B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc");
static_assert(offsetof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc, EntryPoint) == 0x000000, "Member 'B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc, K2Node_Event_OldLocation) == 0x000008, "Member 'B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc::K2Node_Event_OldLocation' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc, K2Node_Event_OldVelocity) == 0x000020, "Member 'B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc::K2Node_Event_OldVelocity' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc, CallFunc_GetAssociatedPlayerPawn_ReturnValue) == 0x000038, "Member 'B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc::CallFunc_GetAssociatedPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc, CallFunc_GetIdleVFXComponent_ReturnValue) == 0x000040, "Member 'B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc::CallFunc_GetIdleVFXComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc, K2Node_Event_Hit) == 0x000048, "Member 'B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc, CallFunc_IsMovingOnGround_ReturnValue) == 0x000128, "Member 'B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc::CallFunc_IsMovingOnGround_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue) == 0x000130, "Member 'B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000138, "Member 'B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc, CallFunc_SpawnSystemAttachedPartModifier_OutExec) == 0x000150, "Member 'B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc::CallFunc_SpawnSystemAttachedPartModifier_OutExec' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc, CallFunc_SpawnSystemAttachedPartModifier_ReturnValue) == 0x000158, "Member 'B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc::CallFunc_SpawnSystemAttachedPartModifier_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc, K2Node_SwitchEnum_CmpSuccess) == 0x000160, "Member 'B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc_C_ExecuteUbergraph_B_Athena_PartModifier_FlapjackWrangler_Dark_FaceAcc::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

