#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_PartModifier_Backpack_OriginPrisoner

#include "Basic.hpp"


namespace SDK::Params
{

// Function B_Athena_PartModifier_Backpack_OriginPrisoner.B_Athena_PartModifier_Backpack_OriginPrisoner_C.ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner
// 0x00B8 (0x00B8 - 0x0000)
struct B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName StatName, int32 StatValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_StatName_1;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_StatValue_1;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_StatName;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_StatValue;                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName StatName, int32 StatValue)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CosmeticAdaptiveStatWatcher* CallFunc_WatchCosmeticStat_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_1;    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CosmeticAdaptiveStatWatcher* CallFunc_WatchCosmeticStat_ReturnValue_1;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_State_Name;                           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Stat_Value;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_GetIdleVFXComponent_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInFrontend_ReturnValue;                 // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_GetIdleVFXComponent_ReturnValue_1;        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_2;    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_GetIdleVFXComponent_ReturnValue_2;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_GetIdleVFXComponent_ReturnValue_3;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_DynamicCast_AsNiagara_Particle_System_Component; // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner) == 0x000008, "Wrong alignment on B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner");
static_assert(sizeof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner) == 0x0000B8, "Wrong size on B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, EntryPoint) == 0x000000, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, K2Node_CustomEvent_StatName_1) == 0x000010, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::K2Node_CustomEvent_StatName_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, K2Node_CustomEvent_StatValue_1) == 0x000014, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::K2Node_CustomEvent_StatValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, Temp_int_Variable) == 0x000018, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, Temp_name_Variable) == 0x00001C, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, K2Node_CustomEvent_StatName) == 0x000020, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::K2Node_CustomEvent_StatName' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, K2Node_CustomEvent_StatValue) == 0x000024, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::K2Node_CustomEvent_StatValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, Temp_int_Variable_1) == 0x000034, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, Temp_name_Variable_1) == 0x000038, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00003C, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, CallFunc_GetAssociatedPlayerPawn_ReturnValue) == 0x000040, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::CallFunc_GetAssociatedPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, CallFunc_WatchCosmeticStat_ReturnValue) == 0x000048, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::CallFunc_WatchCosmeticStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, CallFunc_GetAssociatedPlayerPawn_ReturnValue_1) == 0x000058, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::CallFunc_GetAssociatedPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, CallFunc_WatchCosmeticStat_ReturnValue_1) == 0x000060, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::CallFunc_WatchCosmeticStat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, CallFunc_Greater_IntInt_ReturnValue) == 0x000069, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00006A, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, K2Node_Event_State_Name) == 0x00006C, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::K2Node_Event_State_Name' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, K2Node_Event_Stat_Value) == 0x000070, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::K2Node_Event_Stat_Value' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, CallFunc_GetIdleVFXComponent_ReturnValue) == 0x000078, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::CallFunc_GetIdleVFXComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000080, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, CallFunc_IsInFrontend_ReturnValue) == 0x000081, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::CallFunc_IsInFrontend_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, CallFunc_GetIdleVFXComponent_ReturnValue_1) == 0x000088, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::CallFunc_GetIdleVFXComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, CallFunc_GetAssociatedPlayerPawn_ReturnValue_2) == 0x000090, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::CallFunc_GetAssociatedPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, CallFunc_GetIdleVFXComponent_ReturnValue_2) == 0x000098, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::CallFunc_GetIdleVFXComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, CallFunc_GetIdleVFXComponent_ReturnValue_3) == 0x0000A0, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::CallFunc_GetIdleVFXComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, K2Node_DynamicCast_AsNiagara_Particle_System_Component) == 0x0000A8, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::K2Node_DynamicCast_AsNiagara_Particle_System_Component' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_ExecuteUbergraph_B_Athena_PartModifier_Backpack_OriginPrisoner::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function B_Athena_PartModifier_Backpack_OriginPrisoner.B_Athena_PartModifier_Backpack_OriginPrisoner_C.On Stat Changed
// 0x0008 (0x0008 - 0x0000)
struct B_Athena_PartModifier_Backpack_OriginPrisoner_C_On_Stat_Changed final
{
public:
	class FName                                   State_Name;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stat_Value;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_On_Stat_Changed) == 0x000004, "Wrong alignment on B_Athena_PartModifier_Backpack_OriginPrisoner_C_On_Stat_Changed");
static_assert(sizeof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_On_Stat_Changed) == 0x000008, "Wrong size on B_Athena_PartModifier_Backpack_OriginPrisoner_C_On_Stat_Changed");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_On_Stat_Changed, State_Name) == 0x000000, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_On_Stat_Changed::State_Name' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_On_Stat_Changed, Stat_Value) == 0x000004, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_On_Stat_Changed::Stat_Value' has a wrong offset!");

// Function B_Athena_PartModifier_Backpack_OriginPrisoner.B_Athena_PartModifier_Backpack_OriginPrisoner_C.OnStatChanged_912730A34C104E88848D83A669BF62D3
// 0x0008 (0x0008 - 0x0000)
struct B_Athena_PartModifier_Backpack_OriginPrisoner_C_OnStatChanged_912730A34C104E88848D83A669BF62D3 final
{
public:
	class FName                                   StatName;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StatValue;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_OnStatChanged_912730A34C104E88848D83A669BF62D3) == 0x000004, "Wrong alignment on B_Athena_PartModifier_Backpack_OriginPrisoner_C_OnStatChanged_912730A34C104E88848D83A669BF62D3");
static_assert(sizeof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_OnStatChanged_912730A34C104E88848D83A669BF62D3) == 0x000008, "Wrong size on B_Athena_PartModifier_Backpack_OriginPrisoner_C_OnStatChanged_912730A34C104E88848D83A669BF62D3");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_OnStatChanged_912730A34C104E88848D83A669BF62D3, StatName) == 0x000000, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_OnStatChanged_912730A34C104E88848D83A669BF62D3::StatName' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_OnStatChanged_912730A34C104E88848D83A669BF62D3, StatValue) == 0x000004, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_OnStatChanged_912730A34C104E88848D83A669BF62D3::StatValue' has a wrong offset!");

// Function B_Athena_PartModifier_Backpack_OriginPrisoner.B_Athena_PartModifier_Backpack_OriginPrisoner_C.OnStatChanged_F72B4E884A322CB03020DAA95F839498
// 0x0008 (0x0008 - 0x0000)
struct B_Athena_PartModifier_Backpack_OriginPrisoner_C_OnStatChanged_F72B4E884A322CB03020DAA95F839498 final
{
public:
	class FName                                   StatName;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StatValue;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_OnStatChanged_F72B4E884A322CB03020DAA95F839498) == 0x000004, "Wrong alignment on B_Athena_PartModifier_Backpack_OriginPrisoner_C_OnStatChanged_F72B4E884A322CB03020DAA95F839498");
static_assert(sizeof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_OnStatChanged_F72B4E884A322CB03020DAA95F839498) == 0x000008, "Wrong size on B_Athena_PartModifier_Backpack_OriginPrisoner_C_OnStatChanged_F72B4E884A322CB03020DAA95F839498");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_OnStatChanged_F72B4E884A322CB03020DAA95F839498, StatName) == 0x000000, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_OnStatChanged_F72B4E884A322CB03020DAA95F839498::StatName' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_OnStatChanged_F72B4E884A322CB03020DAA95F839498, StatValue) == 0x000004, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_OnStatChanged_F72B4E884A322CB03020DAA95F839498::StatValue' has a wrong offset!");

// Function B_Athena_PartModifier_Backpack_OriginPrisoner.B_Athena_PartModifier_Backpack_OriginPrisoner_C.SetAndPlaySound
// 0x0010 (0x0010 - 0x0000)
struct B_Athena_PartModifier_Backpack_OriginPrisoner_C_SetAndPlaySound final
{
public:
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_SetAndPlaySound) == 0x000008, "Wrong alignment on B_Athena_PartModifier_Backpack_OriginPrisoner_C_SetAndPlaySound");
static_assert(sizeof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_SetAndPlaySound) == 0x000010, "Wrong size on B_Athena_PartModifier_Backpack_OriginPrisoner_C_SetAndPlaySound");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_SetAndPlaySound, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue) == 0x000000, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_SetAndPlaySound::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Backpack_OriginPrisoner_C_SetAndPlaySound, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000008, "Member 'B_Athena_PartModifier_Backpack_OriginPrisoner_C_SetAndPlaySound::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

}

