#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_PartModifier_Generic

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.Track Players Left
// 0x0004 (0x0004 - 0x0000)
struct B_Athena_PartModifier_Generic_C_Track_Players_Left final
{
public:
	int32                                         NumPlayersLeft;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_Track_Players_Left) == 0x000004, "Wrong alignment on B_Athena_PartModifier_Generic_C_Track_Players_Left");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_Track_Players_Left) == 0x000004, "Wrong size on B_Athena_PartModifier_Generic_C_Track_Players_Left");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Track_Players_Left, NumPlayersLeft) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_Track_Players_Left::NumPlayersLeft' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.OnStatChanged_56336B1A4612C0356DFB75BC1D618B4F
// 0x0008 (0x0008 - 0x0000)
struct B_Athena_PartModifier_Generic_C_OnStatChanged_56336B1A4612C0356DFB75BC1D618B4F final
{
public:
	class FName                                   StatName;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StatValue;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_OnStatChanged_56336B1A4612C0356DFB75BC1D618B4F) == 0x000004, "Wrong alignment on B_Athena_PartModifier_Generic_C_OnStatChanged_56336B1A4612C0356DFB75BC1D618B4F");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_OnStatChanged_56336B1A4612C0356DFB75BC1D618B4F) == 0x000008, "Wrong size on B_Athena_PartModifier_Generic_C_OnStatChanged_56336B1A4612C0356DFB75BC1D618B4F");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_OnStatChanged_56336B1A4612C0356DFB75BC1D618B4F, StatName) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_OnStatChanged_56336B1A4612C0356DFB75BC1D618B4F::StatName' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_OnStatChanged_56336B1A4612C0356DFB75BC1D618B4F, StatValue) == 0x000004, "Member 'B_Athena_PartModifier_Generic_C_OnStatChanged_56336B1A4612C0356DFB75BC1D618B4F::StatValue' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.OnNewPlayerWeaponType
// 0x0002 (0x0002 - 0x0000)
struct B_Athena_PartModifier_Generic_C_OnNewPlayerWeaponType final
{
public:
	EFortItemType                                 NewType;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 OldType;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_OnNewPlayerWeaponType) == 0x000001, "Wrong alignment on B_Athena_PartModifier_Generic_C_OnNewPlayerWeaponType");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_OnNewPlayerWeaponType) == 0x000002, "Wrong size on B_Athena_PartModifier_Generic_C_OnNewPlayerWeaponType");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_OnNewPlayerWeaponType, NewType) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_OnNewPlayerWeaponType::NewType' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_OnNewPlayerWeaponType, OldType) == 0x000001, "Member 'B_Athena_PartModifier_Generic_C_OnNewPlayerWeaponType::OldType' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.OnEnterVehicle
// 0x0010 (0x0010 - 0x0000)
struct B_Athena_PartModifier_Generic_C_OnEnterVehicle final
{
public:
	TScriptInterface<class IFortVehicleInterface> VehicleEntered;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_OnEnterVehicle) == 0x000008, "Wrong alignment on B_Athena_PartModifier_Generic_C_OnEnterVehicle");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_OnEnterVehicle) == 0x000010, "Wrong size on B_Athena_PartModifier_Generic_C_OnEnterVehicle");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_OnEnterVehicle, VehicleEntered) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_OnEnterVehicle::VehicleEntered' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.On Stat Changed
// 0x0008 (0x0008 - 0x0000)
struct B_Athena_PartModifier_Generic_C_On_Stat_Changed final
{
public:
	class FName                                   State_Name;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stat_Value;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_On_Stat_Changed) == 0x000004, "Wrong alignment on B_Athena_PartModifier_Generic_C_On_Stat_Changed");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_On_Stat_Changed) == 0x000008, "Wrong size on B_Athena_PartModifier_Generic_C_On_Stat_Changed");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_On_Stat_Changed, State_Name) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_On_Stat_Changed::State_Name' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_On_Stat_Changed, Stat_Value) == 0x000004, "Member 'B_Athena_PartModifier_Generic_C_On_Stat_Changed::Stat_Value' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.On Players Left Changed
// 0x0004 (0x0004 - 0x0000)
struct B_Athena_PartModifier_Generic_C_On_Players_Left_Changed final
{
public:
	int32                                         Total_Players_Left;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_On_Players_Left_Changed) == 0x000004, "Wrong alignment on B_Athena_PartModifier_Generic_C_On_Players_Left_Changed");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_On_Players_Left_Changed) == 0x000004, "Wrong size on B_Athena_PartModifier_Generic_C_On_Players_Left_Changed");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_On_Players_Left_Changed, Total_Players_Left) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_On_Players_Left_Changed::Total_Players_Left' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.On End Jump
// 0x00E0 (0x00E0 - 0x0000)
struct B_Athena_PartModifier_Generic_C_On_End_Jump final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_On_End_Jump) == 0x000008, "Wrong alignment on B_Athena_PartModifier_Generic_C_On_End_Jump");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_On_End_Jump) == 0x0000E0, "Wrong size on B_Athena_PartModifier_Generic_C_On_End_Jump");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_On_End_Jump, Hit) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_On_End_Jump::Hit' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.On End Emote
// 0x0010 (0x0010 - 0x0000)
struct B_Athena_PartModifier_Generic_C_On_End_Emote final
{
public:
	class UFortItemDefinition*                    MontageItemDef;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              PawnEmoting;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_On_End_Emote) == 0x000008, "Wrong alignment on B_Athena_PartModifier_Generic_C_On_End_Emote");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_On_End_Emote) == 0x000010, "Wrong size on B_Athena_PartModifier_Generic_C_On_End_Emote");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_On_End_Emote, MontageItemDef) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_On_End_Emote::MontageItemDef' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_On_End_Emote, PawnEmoting) == 0x000008, "Member 'B_Athena_PartModifier_Generic_C_On_End_Emote::PawnEmoting' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.On Cosmetic State Activated
// 0x000C (0x000C - 0x0000)
struct B_Athena_PartModifier_Generic_C_On_Cosmetic_State_Activated final
{
public:
	class FName                                   Stat_Name;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stat_Value;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         STAGE_Num_Being_Activated;                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_On_Cosmetic_State_Activated) == 0x000004, "Wrong alignment on B_Athena_PartModifier_Generic_C_On_Cosmetic_State_Activated");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_On_Cosmetic_State_Activated) == 0x00000C, "Wrong size on B_Athena_PartModifier_Generic_C_On_Cosmetic_State_Activated");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_On_Cosmetic_State_Activated, Stat_Name) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_On_Cosmetic_State_Activated::Stat_Name' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_On_Cosmetic_State_Activated, Stat_Value) == 0x000004, "Member 'B_Athena_PartModifier_Generic_C_On_Cosmetic_State_Activated::Stat_Value' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_On_Cosmetic_State_Activated, STAGE_Num_Being_Activated) == 0x000008, "Member 'B_Athena_PartModifier_Generic_C_On_Cosmetic_State_Activated::STAGE_Num_Being_Activated' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.On Character Movement Updated
// 0x0038 (0x0038 - 0x0000)
struct B_Athena_PartModifier_Generic_C_On_Character_Movement_Updated final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OldLocation;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OldVelocity;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_On_Character_Movement_Updated) == 0x000008, "Wrong alignment on B_Athena_PartModifier_Generic_C_On_Character_Movement_Updated");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_On_Character_Movement_Updated) == 0x000038, "Wrong size on B_Athena_PartModifier_Generic_C_On_Character_Movement_Updated");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_On_Character_Movement_Updated, DeltaSeconds) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_On_Character_Movement_Updated::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_On_Character_Movement_Updated, OldLocation) == 0x000008, "Member 'B_Athena_PartModifier_Generic_C_On_Character_Movement_Updated::OldLocation' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_On_Character_Movement_Updated, OldVelocity) == 0x000020, "Member 'B_Athena_PartModifier_Generic_C_On_Character_Movement_Updated::OldVelocity' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.On Begin Jump
// 0x0040 (0x0040 - 0x0000)
struct B_Athena_PartModifier_Generic_C_On_Begin_Jump final
{
public:
	float                                         Delta_Seconds;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Old_Location;                                      // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Old_Velocity;                                      // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_Jump_Providing_Force;                           // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_On_Begin_Jump) == 0x000008, "Wrong alignment on B_Athena_PartModifier_Generic_C_On_Begin_Jump");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_On_Begin_Jump) == 0x000040, "Wrong size on B_Athena_PartModifier_Generic_C_On_Begin_Jump");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_On_Begin_Jump, Delta_Seconds) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_On_Begin_Jump::Delta_Seconds' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_On_Begin_Jump, Old_Location) == 0x000008, "Member 'B_Athena_PartModifier_Generic_C_On_Begin_Jump::Old_Location' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_On_Begin_Jump, Old_Velocity) == 0x000020, "Member 'B_Athena_PartModifier_Generic_C_On_Begin_Jump::Old_Velocity' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_On_Begin_Jump, is_Jump_Providing_Force) == 0x000038, "Member 'B_Athena_PartModifier_Generic_C_On_Begin_Jump::is_Jump_Providing_Force' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.On Begin Emote
// 0x0010 (0x0010 - 0x0000)
struct B_Athena_PartModifier_Generic_C_On_Begin_Emote final
{
public:
	class UFortItemDefinition*                    MontageItemDef;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              PawnEmoting;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_On_Begin_Emote) == 0x000008, "Wrong alignment on B_Athena_PartModifier_Generic_C_On_Begin_Emote");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_On_Begin_Emote) == 0x000010, "Wrong size on B_Athena_PartModifier_Generic_C_On_Begin_Emote");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_On_Begin_Emote, MontageItemDef) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_On_Begin_Emote::MontageItemDef' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_On_Begin_Emote, PawnEmoting) == 0x000008, "Member 'B_Athena_PartModifier_Generic_C_On_Begin_Emote::PawnEmoting' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.IsPartModifierHidden
// 0x0020 (0x0020 - 0x0000)
struct B_Athena_PartModifier_Generic_C_IsPartModifierHidden final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInsideHidingProp_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_IsPartModifierHidden) == 0x000008, "Wrong alignment on B_Athena_PartModifier_Generic_C_IsPartModifierHidden");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_IsPartModifierHidden) == 0x000020, "Wrong size on B_Athena_PartModifier_Generic_C_IsPartModifierHidden");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_IsPartModifierHidden, ReturnValue) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_IsPartModifierHidden::ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_IsPartModifierHidden, CallFunc_GetAssociatedPlayerPawn_ReturnValue) == 0x000008, "Member 'B_Athena_PartModifier_Generic_C_IsPartModifierHidden::CallFunc_GetAssociatedPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_IsPartModifierHidden, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue) == 0x000010, "Member 'B_Athena_PartModifier_Generic_C_IsPartModifierHidden::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_IsPartModifierHidden, CallFunc_IsInsideHidingProp_ReturnValue) == 0x000018, "Member 'B_Athena_PartModifier_Generic_C_IsPartModifierHidden::CallFunc_IsInsideHidingProp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_IsPartModifierHidden, CallFunc_IsVisible_ReturnValue) == 0x000019, "Member 'B_Athena_PartModifier_Generic_C_IsPartModifierHidden::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_IsPartModifierHidden, CallFunc_Not_PreBool_ReturnValue) == 0x00001A, "Member 'B_Athena_PartModifier_Generic_C_IsPartModifierHidden::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_IsPartModifierHidden, CallFunc_BooleanOR_ReturnValue) == 0x00001B, "Member 'B_Athena_PartModifier_Generic_C_IsPartModifierHidden::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.Is Stage Stat Requirements Met
// 0x0018 (0x0018 - 0x0000)
struct B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met final
{
public:
	int32                                         In_Stage_Number_Begin_Tested;                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         In_Stage_Threshold;                                // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         In_Stat_Value;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Active_Stage_Number_0;                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Passed_Requirements;                               // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met) == 0x000004, "Wrong alignment on B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met) == 0x000018, "Wrong size on B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met, In_Stage_Number_Begin_Tested) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met::In_Stage_Number_Begin_Tested' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met, In_Stage_Threshold) == 0x000004, "Member 'B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met::In_Stage_Threshold' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met, In_Stat_Value) == 0x000008, "Member 'B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met::In_Stat_Value' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met, Current_Active_Stage_Number_0) == 0x00000C, "Member 'B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met::Current_Active_Stage_Number_0' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met, Passed_Requirements) == 0x000010, "Member 'B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met::Passed_Requirements' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met, CallFunc_Greater_IntInt_ReturnValue) == 0x000011, "Member 'B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met, CallFunc_Less_IntInt_ReturnValue) == 0x000012, "Member 'B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000013, "Member 'B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met, CallFunc_BooleanAND_ReturnValue_1) == 0x000015, "Member 'B_Athena_PartModifier_Generic_C_Is_Stage_Stat_Requirements_Met::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.Intermediate End Jump
// 0x00E0 (0x00E0 - 0x0000)
struct B_Athena_PartModifier_Generic_C_Intermediate_End_Jump final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_Intermediate_End_Jump) == 0x000008, "Wrong alignment on B_Athena_PartModifier_Generic_C_Intermediate_End_Jump");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_Intermediate_End_Jump) == 0x0000E0, "Wrong size on B_Athena_PartModifier_Generic_C_Intermediate_End_Jump");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Intermediate_End_Jump, Hit) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_Intermediate_End_Jump::Hit' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.Intermediate Cosmetic Stat Changed
// 0x0008 (0x0008 - 0x0000)
struct B_Athena_PartModifier_Generic_C_Intermediate_Cosmetic_Stat_Changed final
{
public:
	class FName                                   Stat_Name;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stat_Value;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_Intermediate_Cosmetic_Stat_Changed) == 0x000004, "Wrong alignment on B_Athena_PartModifier_Generic_C_Intermediate_Cosmetic_Stat_Changed");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_Intermediate_Cosmetic_Stat_Changed) == 0x000008, "Wrong size on B_Athena_PartModifier_Generic_C_Intermediate_Cosmetic_Stat_Changed");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Intermediate_Cosmetic_Stat_Changed, Stat_Name) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_Intermediate_Cosmetic_Stat_Changed::Stat_Name' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Intermediate_Cosmetic_Stat_Changed, Stat_Value) == 0x000004, "Member 'B_Athena_PartModifier_Generic_C_Intermediate_Cosmetic_Stat_Changed::Stat_Value' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.Intermediate Character Movement Event (Jump)
// 0x0038 (0x0038 - 0x0000)
struct B_Athena_PartModifier_Generic_C_Intermediate_Character_Movement_Event__Jump_ final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                OldLocation;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OldVelocity;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_Intermediate_Character_Movement_Event__Jump_) == 0x000008, "Wrong alignment on B_Athena_PartModifier_Generic_C_Intermediate_Character_Movement_Event__Jump_");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_Intermediate_Character_Movement_Event__Jump_) == 0x000038, "Wrong size on B_Athena_PartModifier_Generic_C_Intermediate_Character_Movement_Event__Jump_");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Intermediate_Character_Movement_Event__Jump_, DeltaSeconds) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_Intermediate_Character_Movement_Event__Jump_::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Intermediate_Character_Movement_Event__Jump_, OldLocation) == 0x000008, "Member 'B_Athena_PartModifier_Generic_C_Intermediate_Character_Movement_Event__Jump_::OldLocation' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Intermediate_Character_Movement_Event__Jump_, OldVelocity) == 0x000020, "Member 'B_Athena_PartModifier_Generic_C_Intermediate_Character_Movement_Event__Jump_::OldVelocity' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.Hidden Hand Check
// 0x0070 (0x0070 - 0x0000)
struct B_Athena_PartModifier_Generic_C_Hidden_Hand_Check final
{
public:
	TArray<class UFXSystemComponent*>             FX_Systems_associated_with_Hands;                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	const class AFortWeapon*                      New_Weapon;                                        // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AFortWeapon*                      Old_Weapon;                                        // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Only_Set_Niagara_Bool_Variable;                    // 0x0020(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isHandHidden;                                      // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue; // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_1; // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check) == 0x000008, "Wrong alignment on B_Athena_PartModifier_Generic_C_Hidden_Hand_Check");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check) == 0x000070, "Wrong size on B_Athena_PartModifier_Generic_C_Hidden_Hand_Check");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, FX_Systems_associated_with_Hands) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::FX_Systems_associated_with_Hands' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, New_Weapon) == 0x000010, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::New_Weapon' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, Old_Weapon) == 0x000018, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::Old_Weapon' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, Only_Set_Niagara_Bool_Variable) == 0x000020, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::Only_Set_Niagara_Bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, isHandHidden) == 0x000021, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::isHandHidden' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_IsValid_ReturnValue) == 0x000022, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue) == 0x000023, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_IsValid_ReturnValue_1) == 0x000024, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_1) == 0x000025, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_WeaponDataHasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_Array_Length_ReturnValue_1) == 0x00002C, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_Array_Length_ReturnValue_2) == 0x000030, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_Array_Length_ReturnValue_3) == 0x000034, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000039, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, Temp_int_Array_Index_Variable) == 0x000048, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_Array_Get_Item) == 0x000050, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, Temp_int_Loop_Counter_Variable_1) == 0x000058, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_Less_IntInt_ReturnValue_1) == 0x00005C, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, Temp_int_Array_Index_Variable_1) == 0x000064, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Hidden_Hand_Check, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'B_Athena_PartModifier_Generic_C_Hidden_Hand_Check::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.Handle Potential New Weapon Type
// 0x0028 (0x0028 - 0x0000)
struct B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type final
{
public:
	EFortItemType                                 Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_Map_Find_Value;                           // 0x001C(0x0004)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type) == 0x000008, "Wrong alignment on B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type");
static_assert(sizeof(B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type) == 0x000028, "Wrong size on B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type, Type) == 0x000000, "Member 'B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type::Type' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000018, "Member 'B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type, CallFunc_EqualEqual_GameplayTag_ReturnValue) == 0x000019, "Member 'B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type::CallFunc_EqualEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type, CallFunc_Map_Find_Value) == 0x00001C, "Member 'B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'B_Athena_PartModifier_Generic_C_Handle_Potential_New_Weapon_Type::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function B_Athena_PartModifier_Generic.B_Athena_PartModifier_Generic_C.ExecuteUbergraph_B_Athena_PartModifier_Generic
// 0x0478 (0x0478 - 0x0000)
struct B_Athena_PartModifier_Generic_C_ExecuteUbergraph_B_Athena_PartModifier_Generic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float DeltaSeconds, const struct FVector& OldLocation, const struct FVector& OldVelocity)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_GetIdleVFXComponent_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetIdleFXSocketName_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_DeltaSeconds_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_OldLocation_1;                  // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_OldVelocity_1;                  // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_1;    // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_2;    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_3;    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_DeltaSeconds;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_OldLocation;                    // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_OldVelocity;                    // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1;    // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_Hit_1;                          // 0x00E8(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_CustomEvent_Delta_Seconds;                  // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_Old_Location;                   // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Old_Velocity;                   // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_is_Jump_Providing_Force;        // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_4;    // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJumpProvidingForce_ReturnValue;         // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_GetIdleVFXComponent_ReturnValue_1;        // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_5;    // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena_2;    // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    K2Node_CustomEvent_MontageItemDef_1;               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_CustomEvent_PawnEmoting_1;                  // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    K2Node_CustomEvent_MontageItemDef;                 // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_CustomEvent_PawnEmoting;                    // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 K2Node_Event_NewType;                              // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 K2Node_Event_OldType;                              // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Option_B___If_false__use_Option_A_Variable; // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25B[0x1];                                      // 0x025B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 K2Node_CustomEvent_New_Type;                       // 0x0264(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0265(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0266(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 K2Node_Select_Default;                             // 0x0267(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_6;    // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CosmeticAdaptiveStatWatcher* CallFunc_WatchCosmeticStat_ReturnValue;            // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Stat_Name_1;                    // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Stat_Value_2;                   // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
