#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_CreativeInteractionTool_Base

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "B_CreativeMoveTool_Cosmetics_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "B_CreativeMoveTool_VisualState_structs.hpp"
#include "Enum_CreativeMoveTool_PreviewFX_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_CreativeInteractionTool_Base.B_CreativeInteractionTool_Base_C
// 0x05D0 (0x1CD0 - 0x1700)
class AB_CreativeInteractionTool_Base_C : public AFortCreativeMoveTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1700(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Move_Tool_Highlight_Sound;                         // 0x1708(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Move_Tool_Sound_B;                                 // 0x1710(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Move_Tool_Scale_Down;                              // 0x1718(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Move_Tool_Scale_Up;                                // 0x1720(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        MoveToolLoopingSoundComponent;                     // 0x1728(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Move_Tool_Sound_A;                                 // 0x1730(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  HighlightPostProcess;                              // 0x1738(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sm_CreativeMoveTool_Lightbeam;                     // 0x1740(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         QuickbarPulseTL_Lerp_4E5BB4E84DEC20CDA6A0F9817B18D6D9; // 0x1748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            QuickbarPulseTL__Direction_4E5BB4E84DEC20CDA6A0F9817B18D6D9; // 0x174C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174D[0x3];                                     // 0x174D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     QuickbarPulseTL;                                   // 0x1750(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScreenFlashTL_LERP_A4B06B344C7D9EFE635FF4BD86AED88A; // 0x1758(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ScreenFlashTL__Direction_A4B06B344C7D9EFE635FF4BD86AED88A; // 0x175C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_175D[0x3];                                     // 0x175D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ScreenFlashTL;                                     // 0x1760(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionTL_LERP_16CD3F074B64C6E61AE7BFA8C2DD1144; // 0x1768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            TransitionTL__Direction_16CD3F074B64C6E61AE7BFA8C2DD1144; // 0x176C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_176D[0x3];                                     // 0x176D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TransitionTL;                                      // 0x1770(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnHoverChangedCanInteract;                         // 0x1778(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1779[0x3];                                     // 0x1779(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TransitionLengthIn;                                // 0x177C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransitionLengthOut;                               // 0x1780(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1784[0x4];                                     // 0x1784(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CurrentMeshComponent;                              // 0x1788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Current_Blueprint_Static_Mesh_Component;           // 0x1790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CurrentStaticMeshComponent;                        // 0x1798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PhoneMID;                                          // 0x17A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ScreenSelectedColor;                               // 0x17A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CurrentColor;                                      // 0x17B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DesiredColor;                                      // 0x17C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PreviousColor;                                     // 0x17D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ScreenDeselectedColor;                             // 0x17E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               PreviousTexture;                                   // 0x17F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               DesiredTexture;                                    // 0x1800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               ScreenSelectedIcon;                                // 0x1808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               ScreenDeselectedIcon;                              // 0x1810(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasTransitionTimlinePlaying;                       // 0x1818(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InteractionActive;                                 // 0x1819(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181A[0x6];                                     // 0x181A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AB_CreativeMoveTool_BlueprintPreviewer_C*> Previews;                                          // 0x1820(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, DisableEditOnInstance, RepNotify)
	TMap<class AActor*, class AB_CreativeMoveTool_BlueprintPreviewer_C*> LocalPreviewMap;                                   // 0x1830(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class AActor*                                 SelectedActor;                                     // 0x1880(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1888[0x8];                                     // 0x1888(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             EmptyTransform;                                    // 0x1890(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         LightBeamWidthMultiplier;                          // 0x18F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CustomDepthStencilValue;                           // 0x18F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanPostProcessBeEnabledOnCurrentPlatform;          // 0x18F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18F9[0x7];                                     // 0x18F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               LightBeamMID;                                      // 0x1900(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FB_CreativeMoveTool_Cosmetics          PhoneMaterialState;                                // 0x1908(0x0040)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify, ContainsInstancedReference, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 SelectedMeshComponents;                            // 0x1948(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          BuildingPieceSelected;                             // 0x1958(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1959[0x7];                                     // 0x1959(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               BuildingPieceCenterAndRadius;                      // 0x1960(0x0020)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             BlueprintWorldTransform;                           // 0x1980(0x0060)(Edit, BlueprintVisible, Net, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AFortTimeOfDayManager*                  LevelTODM;                                         // 0x19E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     LevelTODMBasePostProcessMaterial;                  // 0x19E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LightBeamMaxLength;                                // 0x19F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlacementValid;                                  // 0x19F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19F5[0x3];                                     // 0x19F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           BeamColorLow_Valid;                                // 0x19F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BeamColorLow_Invalid;                              // 0x1A08(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BeamColorHigh_Valid;                               // 0x1A18(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BeamColorHigh_Invalid;                             // 0x1A28(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ScreenInvalidColor;                                // 0x1A38(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               ScreenInvalidIcon;                                 // 0x1A48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ScreenDeleteColor;                                 // 0x1A50(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               ScreenDeleteIcon;                                  // 0x1A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EB_CreativeMoveTool_VisualState               PhoneVisualState;                                  // 0x1A68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A69[0x3];                                     // 0x1A69(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           ScreenMultiSelectColor;                            // 0x1A6C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BeamColorLow_Delete;                               // 0x1A7C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BeamColorHigh_Delete;                              // 0x1A8C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9C[0x4];                                     // 0x1A9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PreviousLocation;                                  // 0x1AA0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Handle_Scale_Up_Modifier;                          // 0x1AB8(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          InteractionCanOnlyDelete;                          // 0x1AC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC1[0x7];                                     // 0x1AC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AB_CreativeMoveTool_BlueprintPreviewer_C*> ActiveBlueprintPreviewers;                         // 0x1AC8(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate)
	int32                                         CustomDepthStencilValueHighlighted;                // 0x1AD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CustomDepthStencilValueMultiSelect;                // 0x1ADC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CurrentMeshComponentMID;                           // 0x1AE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CanOnlyDeleteBlueprintColor;                       // 0x1AE8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MultiSelectBlueprintColor;                         // 0x1AF8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CustomDepthStencilValueParticleProp;               // 0x1B08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B0C[0x4];                                     // 0x1B0C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           LightbeamMeshPool;                                 // 0x1B10(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class UMaterialInstanceDynamic*>       LightbeamMIDPool;                                  // 0x1B20(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           DefaultBlueprintColor;                             // 0x1B30(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               ScreenMultiSelectIcon;                             // 0x1B40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AB_CreativeMoveTool_BlueprintPreviewer_C*> PosessedBlueprintPreviewers;                       // 0x1B48(0x0010)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, DisableEditOnInstance)
	class USoundBase*                             CurrentMusic;                                      // 0x1B58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CurrentlyMultiselectedBlueprintColor;              // 0x1B60(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     WeaponMeshMIDSourceMaterial;                       // 0x1B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldRespondToWeaponVisibilityChanged;           // 0x1B78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B79[0x7];                                     // 0x1B79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         PosessedActorsForPlacement;                        // 0x1B80(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<bool>                                  IsPosessedActorPlacementValid;                     // 0x1B90(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         LightBeamMaxWidth;                                 // 0x1BA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BA4[0x4];                                     // 0x1BA4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LightBeamLargestComponentScale;                    // 0x1BA8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         MultiselectValidQueuedActors;                      // 0x1BC0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class UMaterialInstanceDynamic*, struct FLinearColor> CurrentlyAddedToQuickbarMIDs;                      // 0x1BD0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>       CurrentlyAddedToQuickbarKeys;                      // 0x1C20(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           AddedToQuickbarHighlightColor;                     // 0x1C30(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 CurrentlyAddedToQuickbarMeshComponents;            // 0x1C40(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UParticleSystemComponent*               AddedToQuickbarFX;                                 // 0x1C50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ScreenAddedToQuickbarColor;                        // 0x1C58(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               ScreenAddedToQuickbarIcon;                         // 0x1C68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FB_CreativeMoveTool_Cosmetics          PreviousPhoneMaterialState;                        // 0x1C70(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	struct FTimerHandle                           DelayBeforeRevertingScreenStateHandle;             // 0x1CB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         DelayBeforeApplyingHover;                          // 0x1CB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CBC[0x4];                                     // 0x1CBC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 NewHoveredComponents;                              // 0x1CC0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void UserConstructionScript();
	void UpdatePhoneMaterialState(const struct FB_CreativeMoveTool_Cosmetics& Struct);
	void UpdateBuildingPreviewTransform(const struct FTransform& Transform);
	void UpdateBuildingPieceLocationAndRadius(const struct FVector4& Vec4);
	void TransitionTL__UpdateFunc();
	void TransitionTL__FinishedFunc();
	void StopLight();
	void SpawnAddedToQuickbarFX(class UMeshComponent* MeshComponent);
	void SetupPhoneMaterialStates(TArray<class UMeshComponent*>& MeshComponents, bool IsBuildingPiece_0, EB_CreativeMoveTool_VisualState PhoneVisualState_0, int32 NumberOfActivePreviews_0, TArray<class AActor*>& PosessedActorsForPlacement_0, TArray<bool>& PosessedActorPlacementValid);
	void SetRayMIDParams(class UMaterialInstanceDynamic* RayMID);
	void SetPostProcess(bool ForceEnabled);
