#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_CreativePropSelector_Athena

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "B_CreativeInteractionTool_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_CreativePropSelector_Athena.B_CreativePropSelector_Athena_C
// 0x0090 (0x1D60 - 0x1CD0)
class AB_CreativePropSelector_Athena_C final : public AB_CreativeInteractionTool_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_CreativePropSelector_Athena_C;    // 0x1CD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortPossessedPropInputComponent*       FortPossessedPropInput;                            // 0x1CD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCreativeInteraction_PossessProp_C*     CreativeInteraction_PossessProp;                   // 0x1CE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PossessedPropPlacedTag;                            // 0x1CE8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          PossessedPropPlaced;                               // 0x1D08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D09[0x7];                                     // 0x1D09(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  PossessedPropTag;                                  // 0x1D10(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  PossessedPropMakeNoiseTag;                         // 0x1D30(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         PossessedPropHealDrainAmount;                      // 0x1D50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetPropPlaced(bool NewPropPlaced);
	void PushPossessedPropInput(class APlayerController* PlayerController);
	void PushCreativeMoveToolEquippedInputComponent();
	void PopPossessedPropInput(class APlayerController* PlayerController);
	void PopCreativeMoveToolEquippedInputComponent();
	void PlayGameplayAbilityFail();
	void OnWeaponAttached();
	void OnUnholsteredEvent();
	void OnPossessedProp(class AFortPlayerPawn* FortPlayerPawn, class ABuildingGameplayActorPlayerPropAttachment* PossessedProp);
	void OnPlayerStartDBNO();
	void OnHoverChanged(const TArray<class UMeshComponent*>& NewHoveredComponents_0, const TArray<class UMeshComponent*>& UnhoveredComponents, class UObjectInteractionBehavior* ObjectInteraction);
	void OnCopyOrPickupFailed();
	void K2_OnUnEquip();
	void HandleExitReleased();
	void HandleExitPressed();
	void GetPropHuntSettings(class ABP_PropPossessorConfigProp_C** PropHuntSettings, class AMinigame_PlayerCreated_C** Minigame);
	void GetHighlightSound(TSoftObjectPtr<class UObject>* sound);
	void ExecuteUbergraph_B_CreativePropSelector_Athena(int32 EntryPoint);
	void EquipPrimaryItemOnCancelPropPossession(bool* ShouldEquip);
	bool CanUtilizeMoveToolSpawningFunctionality();
	void CancelPropPossession();
	void BndEvt__FortPossessedPropInput_K2Node_ComponentBoundEvent_2_OnCreativeInput__DelegateSignature();
	void BndEvt__FortPossessedPropInput_K2Node_ComponentBoundEvent_1_OnCreativeInput__DelegateSignature();
	void BndEvt__FortPossessedPropInput_K2Node_ComponentBoundEvent_0_OnCreativeInput__DelegateSignature();
	void AllowCancelPropPossession(bool* Allowed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_CreativePropSelector_Athena_C">();
	}
	static class AB_CreativePropSelector_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_CreativePropSelector_Athena_C>();
	}
};
static_assert(alignof(AB_CreativePropSelector_Athena_C) == 0x000010, "Wrong alignment on AB_CreativePropSelector_Athena_C");
static_assert(sizeof(AB_CreativePropSelector_Athena_C) == 0x001D60, "Wrong size on AB_CreativePropSelector_Athena_C");
static_assert(offsetof(AB_CreativePropSelector_Athena_C, UberGraphFrame_B_CreativePropSelector_Athena_C) == 0x001CD0, "Member 'AB_CreativePropSelector_Athena_C::UberGraphFrame_B_CreativePropSelector_Athena_C' has a wrong offset!");
static_assert(offsetof(AB_CreativePropSelector_Athena_C, FortPossessedPropInput) == 0x001CD8, "Member 'AB_CreativePropSelector_Athena_C::FortPossessedPropInput' has a wrong offset!");
static_assert(offsetof(AB_CreativePropSelector_Athena_C, CreativeInteraction_PossessProp) == 0x001CE0, "Member 'AB_CreativePropSelector_Athena_C::CreativeInteraction_PossessProp' has a wrong offset!");
static_assert(offsetof(AB_CreativePropSelector_Athena_C, PossessedPropPlacedTag) == 0x001CE8, "Member 'AB_CreativePropSelector_Athena_C::PossessedPropPlacedTag' has a wrong offset!");
static_assert(offsetof(AB_CreativePropSelector_Athena_C, PossessedPropPlaced) == 0x001D08, "Member 'AB_CreativePropSelector_Athena_C::PossessedPropPlaced' has a wrong offset!");
static_assert(offsetof(AB_CreativePropSelector_Athena_C, PossessedPropTag) == 0x001D10, "Member 'AB_CreativePropSelector_Athena_C::PossessedPropTag' has a wrong offset!");
static_assert(offsetof(AB_CreativePropSelector_Athena_C, PossessedPropMakeNoiseTag) == 0x001D30, "Member 'AB_CreativePropSelector_Athena_C::PossessedPropMakeNoiseTag' has a wrong offset!");
static_assert(offsetof(AB_CreativePropSelector_Athena_C, PossessedPropHealDrainAmount) == 0x001D50, "Member 'AB_CreativePropSelector_Athena_C::PossessedPropHealDrainAmount' has a wrong offset!");

}

