#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_CreativeMoveTool_Athena

#include "Basic.hpp"

#include "B_CreativeMoveTool_Cosmetics_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "B_CreativeMoveTool_VisualState_structs.hpp"


namespace SDK::Params
{

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.UpdateRotationAxis
// 0x0001 (0x0001 - 0x0000)
struct B_CreativeMoveTool_Athena_C_UpdateRotationAxis final
{
public:
	uint8                                         Rotation_Axis;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CreativeMoveTool_Athena_C_UpdateRotationAxis) == 0x000001, "Wrong alignment on B_CreativeMoveTool_Athena_C_UpdateRotationAxis");
static_assert(sizeof(B_CreativeMoveTool_Athena_C_UpdateRotationAxis) == 0x000001, "Wrong size on B_CreativeMoveTool_Athena_C_UpdateRotationAxis");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_UpdateRotationAxis, Rotation_Axis) == 0x000000, "Member 'B_CreativeMoveTool_Athena_C_UpdateRotationAxis::Rotation_Axis' has a wrong offset!");

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.UpdatePreviewerRotationGuides
// 0x0010 (0x0010 - 0x0000)
struct B_CreativeMoveTool_Athena_C_UpdatePreviewerRotationGuides final
{
public:
	class AB_CreativeMoveTool_BlueprintPreviewer_C* BlueprintPreviewer;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanXOR_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CreativeMoveTool_Athena_C_UpdatePreviewerRotationGuides) == 0x000008, "Wrong alignment on B_CreativeMoveTool_Athena_C_UpdatePreviewerRotationGuides");
static_assert(sizeof(B_CreativeMoveTool_Athena_C_UpdatePreviewerRotationGuides) == 0x000010, "Wrong size on B_CreativeMoveTool_Athena_C_UpdatePreviewerRotationGuides");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_UpdatePreviewerRotationGuides, BlueprintPreviewer) == 0x000000, "Member 'B_CreativeMoveTool_Athena_C_UpdatePreviewerRotationGuides::BlueprintPreviewer' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_UpdatePreviewerRotationGuides, CallFunc_BooleanXOR_ReturnValue) == 0x000008, "Member 'B_CreativeMoveTool_Athena_C_UpdatePreviewerRotationGuides::CallFunc_BooleanXOR_ReturnValue' has a wrong offset!");

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.TrackValidPlacements
// 0x0038 (0x0038 - 0x0000)
struct B_CreativeMoveTool_Athena_C_TrackValidPlacements final
{
public:
	class AActor*                                 ActorForPlacement;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ValidPlacement;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallUpdate;                                        // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_1;                         // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Get_Item_2;                         // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CreativeMoveTool_Athena_C_TrackValidPlacements) == 0x000008, "Wrong alignment on B_CreativeMoveTool_Athena_C_TrackValidPlacements");
static_assert(sizeof(B_CreativeMoveTool_Athena_C_TrackValidPlacements) == 0x000038, "Wrong size on B_CreativeMoveTool_Athena_C_TrackValidPlacements");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_TrackValidPlacements, ActorForPlacement) == 0x000000, "Member 'B_CreativeMoveTool_Athena_C_TrackValidPlacements::ActorForPlacement' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_TrackValidPlacements, ValidPlacement) == 0x000008, "Member 'B_CreativeMoveTool_Athena_C_TrackValidPlacements::ValidPlacement' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_TrackValidPlacements, CallUpdate) == 0x000009, "Member 'B_CreativeMoveTool_Athena_C_TrackValidPlacements::CallUpdate' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_TrackValidPlacements, CallFunc_IsDedicatedServer_ReturnValue) == 0x00000A, "Member 'B_CreativeMoveTool_Athena_C_TrackValidPlacements::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_TrackValidPlacements, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'B_CreativeMoveTool_Athena_C_TrackValidPlacements::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_TrackValidPlacements, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'B_CreativeMoveTool_Athena_C_TrackValidPlacements::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_TrackValidPlacements, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'B_CreativeMoveTool_Athena_C_TrackValidPlacements::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_TrackValidPlacements, CallFunc_Array_Get_Item) == 0x000018, "Member 'B_CreativeMoveTool_Athena_C_TrackValidPlacements::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_TrackValidPlacements, CallFunc_Array_Find_ReturnValue) == 0x000020, "Member 'B_CreativeMoveTool_Athena_C_TrackValidPlacements::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_TrackValidPlacements, CallFunc_Array_Contains_ReturnValue) == 0x000024, "Member 'B_CreativeMoveTool_Athena_C_TrackValidPlacements::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_TrackValidPlacements, CallFunc_Array_Get_Item_1) == 0x000025, "Member 'B_CreativeMoveTool_Athena_C_TrackValidPlacements::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_TrackValidPlacements, CallFunc_Array_Get_Item_2) == 0x000026, "Member 'B_CreativeMoveTool_Athena_C_TrackValidPlacements::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_TrackValidPlacements, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'B_CreativeMoveTool_Athena_C_TrackValidPlacements::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_TrackValidPlacements, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00002C, "Member 'B_CreativeMoveTool_Athena_C_TrackValidPlacements::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_TrackValidPlacements, CallFunc_Less_IntInt_ReturnValue) == 0x00002D, "Member 'B_CreativeMoveTool_Athena_C_TrackValidPlacements::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_TrackValidPlacements, CallFunc_Array_Find_ReturnValue_1) == 0x000030, "Member 'B_CreativeMoveTool_Athena_C_TrackValidPlacements::CallFunc_Array_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_TrackValidPlacements, CallFunc_Array_AddUnique_ReturnValue) == 0x000034, "Member 'B_CreativeMoveTool_Athena_C_TrackValidPlacements::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.SpawnPlaysetOnPlayer
// 0x01D8 (0x01D8 - 0x0000)
struct B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer final
{
public:
	struct FFortItemEntry                         PlaysetItemEntry;                                  // 0x0000(0x01A0)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UFortWeaponRangedItemDefinition*        K2Node_DynamicCast_AsFort_Weapon_Ranged_Item_Definition; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UFortGameplayAbility>       CallFunc_GetPrimaryFireAbility_ReturnValue;        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UFortPlaysetGrenadeItemDefinition*      K2Node_DynamicCast_AsFort_Playset_Grenade_Item_Definition; // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGameplayAbility*                   CallFunc_SpawnObject_ReturnValue;                  // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlaysetItemDefinition*             CallFunc_GetPlaysetToSpawn_ReturnValue;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer) == 0x000008, "Wrong alignment on B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer");
static_assert(sizeof(B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer) == 0x0001D8, "Wrong size on B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer, PlaysetItemEntry) == 0x000000, "Member 'B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer::PlaysetItemEntry' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer, K2Node_DynamicCast_AsFort_Weapon_Ranged_Item_Definition) == 0x0001A0, "Member 'B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer::K2Node_DynamicCast_AsFort_Weapon_Ranged_Item_Definition' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer, K2Node_DynamicCast_bSuccess) == 0x0001A8, "Member 'B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer, CallFunc_GetPrimaryFireAbility_ReturnValue) == 0x0001B0, "Member 'B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer::CallFunc_GetPrimaryFireAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer, K2Node_DynamicCast_AsFort_Playset_Grenade_Item_Definition) == 0x0001B8, "Member 'B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer::K2Node_DynamicCast_AsFort_Playset_Grenade_Item_Definition' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer, K2Node_DynamicCast_bSuccess_1) == 0x0001C0, "Member 'B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer, CallFunc_SpawnObject_ReturnValue) == 0x0001C8, "Member 'B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer, CallFunc_GetPlaysetToSpawn_ReturnValue) == 0x0001D0, "Member 'B_CreativeMoveTool_Athena_C_SpawnPlaysetOnPlayer::CallFunc_GetPlaysetToSpawn_ReturnValue' has a wrong offset!");

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.SetDeleteVisuals
// 0x0010 (0x0010 - 0x0000)
struct B_CreativeMoveTool_Athena_C_SetDeleteVisuals final
{
public:
	TArray<class UMeshComponent*>                 MeshComponents;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_CreativeMoveTool_Athena_C_SetDeleteVisuals) == 0x000008, "Wrong alignment on B_CreativeMoveTool_Athena_C_SetDeleteVisuals");
static_assert(sizeof(B_CreativeMoveTool_Athena_C_SetDeleteVisuals) == 0x000010, "Wrong size on B_CreativeMoveTool_Athena_C_SetDeleteVisuals");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_SetDeleteVisuals, MeshComponents) == 0x000000, "Member 'B_CreativeMoveTool_Athena_C_SetDeleteVisuals::MeshComponents' has a wrong offset!");

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.ServerPlayGameplayAbility
// 0x0010 (0x0010 - 0x0000)
struct B_CreativeMoveTool_Athena_C_ServerPlayGameplayAbility final
{
public:
	class UObjectInteractionBehavior*             ObjectInteractionBehavior;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 NumSelected;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CreativeMoveTool_Athena_C_ServerPlayGameplayAbility) == 0x000008, "Wrong alignment on B_CreativeMoveTool_Athena_C_ServerPlayGameplayAbility");
static_assert(sizeof(B_CreativeMoveTool_Athena_C_ServerPlayGameplayAbility) == 0x000010, "Wrong size on B_CreativeMoveTool_Athena_C_ServerPlayGameplayAbility");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_ServerPlayGameplayAbility, ObjectInteractionBehavior) == 0x000000, "Member 'B_CreativeMoveTool_Athena_C_ServerPlayGameplayAbility::ObjectInteractionBehavior' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_ServerPlayGameplayAbility, NumSelected) == 0x000008, "Member 'B_CreativeMoveTool_Athena_C_ServerPlayGameplayAbility::NumSelected' has a wrong offset!");

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.ScaleInsteadOfRotate
// 0x0001 (0x0001 - 0x0000)
struct B_CreativeMoveTool_Athena_C_ScaleInsteadOfRotate final
{
public:
	bool                                          Scale;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CreativeMoveTool_Athena_C_ScaleInsteadOfRotate) == 0x000001, "Wrong alignment on B_CreativeMoveTool_Athena_C_ScaleInsteadOfRotate");
static_assert(sizeof(B_CreativeMoveTool_Athena_C_ScaleInsteadOfRotate) == 0x000001, "Wrong size on B_CreativeMoveTool_Athena_C_ScaleInsteadOfRotate");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_ScaleInsteadOfRotate, Scale) == 0x000000, "Member 'B_CreativeMoveTool_Athena_C_ScaleInsteadOfRotate::Scale' has a wrong offset!");

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.RemoveMeshComponents
// 0x0040 (0x0040 - 0x0000)
struct B_CreativeMoveTool_Athena_C_RemoveMeshComponents final
{
public:
	TArray<class UMeshComponent*>                 MeshComponents;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UMeshComponent*>                 ArrayToRemoveFrom;                                 // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CreativeMoveTool_Athena_C_RemoveMeshComponents) == 0x000008, "Wrong alignment on B_CreativeMoveTool_Athena_C_RemoveMeshComponents");
static_assert(sizeof(B_CreativeMoveTool_Athena_C_RemoveMeshComponents) == 0x000040, "Wrong size on B_CreativeMoveTool_Athena_C_RemoveMeshComponents");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_RemoveMeshComponents, MeshComponents) == 0x000000, "Member 'B_CreativeMoveTool_Athena_C_RemoveMeshComponents::MeshComponents' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_RemoveMeshComponents, ArrayToRemoveFrom) == 0x000010, "Member 'B_CreativeMoveTool_Athena_C_RemoveMeshComponents::ArrayToRemoveFrom' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_RemoveMeshComponents, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'B_CreativeMoveTool_Athena_C_RemoveMeshComponents::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_RemoveMeshComponents, Temp_int_Array_Index_Variable) == 0x000024, "Member 'B_CreativeMoveTool_Athena_C_RemoveMeshComponents::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_RemoveMeshComponents, CallFunc_Array_Get_Item) == 0x000028, "Member 'B_CreativeMoveTool_Athena_C_RemoveMeshComponents::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_RemoveMeshComponents, CallFunc_Array_RemoveItem_ReturnValue) == 0x000030, "Member 'B_CreativeMoveTool_Athena_C_RemoveMeshComponents::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_RemoveMeshComponents, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'B_CreativeMoveTool_Athena_C_RemoveMeshComponents::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_RemoveMeshComponents, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'B_CreativeMoveTool_Athena_C_RemoveMeshComponents::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_RemoveMeshComponents, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'B_CreativeMoveTool_Athena_C_RemoveMeshComponents::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_RemoveMeshComponents, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'B_CreativeMoveTool_Athena_C_RemoveMeshComponents::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.PlayPrecisionFX
// 0x0002 (0x0002 - 0x0000)
struct B_CreativeMoveTool_Athena_C_PlayPrecisionFX final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         PrecisionLevel;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CreativeMoveTool_Athena_C_PlayPrecisionFX) == 0x000001, "Wrong alignment on B_CreativeMoveTool_Athena_C_PlayPrecisionFX");
static_assert(sizeof(B_CreativeMoveTool_Athena_C_PlayPrecisionFX) == 0x000002, "Wrong size on B_CreativeMoveTool_Athena_C_PlayPrecisionFX");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_PlayPrecisionFX, On) == 0x000000, "Member 'B_CreativeMoveTool_Athena_C_PlayPrecisionFX::On' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_PlayPrecisionFX, PrecisionLevel) == 0x000001, "Member 'B_CreativeMoveTool_Athena_C_PlayPrecisionFX::PrecisionLevel' has a wrong offset!");

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.OnValidPlacementChangedActorInstance
// 0x0010 (0x0010 - 0x0000)
struct B_CreativeMoveTool_Athena_C_OnValidPlacementChangedActorInstance final
{
public:
	class AActor*                                 ActorForPlacement;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ValidPlacement;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CreativeMoveTool_Athena_C_OnValidPlacementChangedActorInstance) == 0x000008, "Wrong alignment on B_CreativeMoveTool_Athena_C_OnValidPlacementChangedActorInstance");
static_assert(sizeof(B_CreativeMoveTool_Athena_C_OnValidPlacementChangedActorInstance) == 0x000010, "Wrong size on B_CreativeMoveTool_Athena_C_OnValidPlacementChangedActorInstance");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_OnValidPlacementChangedActorInstance, ActorForPlacement) == 0x000000, "Member 'B_CreativeMoveTool_Athena_C_OnValidPlacementChangedActorInstance::ActorForPlacement' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_OnValidPlacementChangedActorInstance, ValidPlacement) == 0x000008, "Member 'B_CreativeMoveTool_Athena_C_OnValidPlacementChangedActorInstance::ValidPlacement' has a wrong offset!");

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.OnValidPlacementChanged
// 0x0001 (0x0001 - 0x0000)
struct B_CreativeMoveTool_Athena_C_OnValidPlacementChanged final
{
public:
	bool                                          bValidPlacement;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CreativeMoveTool_Athena_C_OnValidPlacementChanged) == 0x000001, "Wrong alignment on B_CreativeMoveTool_Athena_C_OnValidPlacementChanged");
static_assert(sizeof(B_CreativeMoveTool_Athena_C_OnValidPlacementChanged) == 0x000001, "Wrong size on B_CreativeMoveTool_Athena_C_OnValidPlacementChanged");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_OnValidPlacementChanged, bValidPlacement) == 0x000000, "Member 'B_CreativeMoveTool_Athena_C_OnValidPlacementChanged::bValidPlacement' has a wrong offset!");

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.OnRemoveHighlightSelectedActor
// 0x0018 (0x0018 - 0x0000)
struct B_CreativeMoveTool_Athena_C_OnRemoveHighlightSelectedActor final
{
public:
	class AActor*                                 SelectedActor_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 SelectedComponents;                                // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_CreativeMoveTool_Athena_C_OnRemoveHighlightSelectedActor) == 0x000008, "Wrong alignment on B_CreativeMoveTool_Athena_C_OnRemoveHighlightSelectedActor");
static_assert(sizeof(B_CreativeMoveTool_Athena_C_OnRemoveHighlightSelectedActor) == 0x000018, "Wrong size on B_CreativeMoveTool_Athena_C_OnRemoveHighlightSelectedActor");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_OnRemoveHighlightSelectedActor, SelectedActor_0) == 0x000000, "Member 'B_CreativeMoveTool_Athena_C_OnRemoveHighlightSelectedActor::SelectedActor_0' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_OnRemoveHighlightSelectedActor, SelectedComponents) == 0x000008, "Member 'B_CreativeMoveTool_Athena_C_OnRemoveHighlightSelectedActor::SelectedComponents' has a wrong offset!");

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.OnObjectPlacement
// 0x0028 (0x0028 - 0x0000)
struct B_CreativeMoveTool_Athena_C_OnObjectPlacement final
{
public:
	TArray<class UMeshComponent*>                 Components;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FOriginalAndSpawnedPair                NewlyPlacedActorPair;                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(B_CreativeMoveTool_Athena_C_OnObjectPlacement) == 0x000008, "Wrong alignment on B_CreativeMoveTool_Athena_C_OnObjectPlacement");
static_assert(sizeof(B_CreativeMoveTool_Athena_C_OnObjectPlacement) == 0x000028, "Wrong size on B_CreativeMoveTool_Athena_C_OnObjectPlacement");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_OnObjectPlacement, Components) == 0x000000, "Member 'B_CreativeMoveTool_Athena_C_OnObjectPlacement::Components' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_OnObjectPlacement, NewlyPlacedActorPair) == 0x000010, "Member 'B_CreativeMoveTool_Athena_C_OnObjectPlacement::NewlyPlacedActorPair' has a wrong offset!");

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.OnLoaded_E3775BA448F14810E251D0B6CF812D21
// 0x0008 (0x0008 - 0x0000)
struct B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B6CF812D21 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B6CF812D21) == 0x000008, "Wrong alignment on B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B6CF812D21");
static_assert(sizeof(B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B6CF812D21) == 0x000008, "Wrong size on B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B6CF812D21");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B6CF812D21, Loaded) == 0x000000, "Member 'B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B6CF812D21::Loaded' has a wrong offset!");

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.OnLoaded_E3775BA448F14810E251D0B6517A6B04
// 0x0008 (0x0008 - 0x0000)
struct B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B6517A6B04 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B6517A6B04) == 0x000008, "Wrong alignment on B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B6517A6B04");
static_assert(sizeof(B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B6517A6B04) == 0x000008, "Wrong size on B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B6517A6B04");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B6517A6B04, Loaded) == 0x000000, "Member 'B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B6517A6B04::Loaded' has a wrong offset!");

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.OnLoaded_E3775BA448F14810E251D0B640BB258B
// 0x0008 (0x0008 - 0x0000)
struct B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B640BB258B final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B640BB258B) == 0x000008, "Wrong alignment on B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B640BB258B");
static_assert(sizeof(B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B640BB258B) == 0x000008, "Wrong size on B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B640BB258B");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B640BB258B, Loaded) == 0x000000, "Member 'B_CreativeMoveTool_Athena_C_OnLoaded_E3775BA448F14810E251D0B640BB258B::Loaded' has a wrong offset!");

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.OnHighlightSelectedActor
// 0x0018 (0x0018 - 0x0000)
struct B_CreativeMoveTool_Athena_C_OnHighlightSelectedActor final
{
public:
	class AActor*                                 SelectedActor_0;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 SelectedComponents;                                // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_CreativeMoveTool_Athena_C_OnHighlightSelectedActor) == 0x000008, "Wrong alignment on B_CreativeMoveTool_Athena_C_OnHighlightSelectedActor");
static_assert(sizeof(B_CreativeMoveTool_Athena_C_OnHighlightSelectedActor) == 0x000018, "Wrong size on B_CreativeMoveTool_Athena_C_OnHighlightSelectedActor");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_OnHighlightSelectedActor, SelectedActor_0) == 0x000000, "Member 'B_CreativeMoveTool_Athena_C_OnHighlightSelectedActor::SelectedActor_0' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_OnHighlightSelectedActor, SelectedComponents) == 0x000008, "Member 'B_CreativeMoveTool_Athena_C_OnHighlightSelectedActor::SelectedComponents' has a wrong offset!");

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.OnAllowGravityToggleChanged
// 0x0001 (0x0001 - 0x0000)
struct B_CreativeMoveTool_Athena_C_OnAllowGravityToggleChanged final
{
public:
	bool                                          bAllowGravity;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_CreativeMoveTool_Athena_C_OnAllowGravityToggleChanged) == 0x000001, "Wrong alignment on B_CreativeMoveTool_Athena_C_OnAllowGravityToggleChanged");
static_assert(sizeof(B_CreativeMoveTool_Athena_C_OnAllowGravityToggleChanged) == 0x000001, "Wrong size on B_CreativeMoveTool_Athena_C_OnAllowGravityToggleChanged");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_OnAllowGravityToggleChanged, bAllowGravity) == 0x000000, "Member 'B_CreativeMoveTool_Athena_C_OnAllowGravityToggleChanged::bAllowGravity' has a wrong offset!");

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.IsComponentStillHighlighted
// 0x0068 (0x0068 - 0x0000)
struct B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted final
{
public:
	TArray<class UMeshComponent*>                 MeshComponents;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          Value;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 HoveredComponentsArray;                            // 0x0018(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_Set_ToArray_Result;                       // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted) == 0x000008, "Wrong alignment on B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted");
static_assert(sizeof(B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted) == 0x000068, "Wrong size on B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted, MeshComponents) == 0x000000, "Member 'B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted::MeshComponents' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted, Value) == 0x000010, "Member 'B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted::Value' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted, Found) == 0x000011, "Member 'B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted::Found' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted, HoveredComponentsArray) == 0x000018, "Member 'B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted::HoveredComponentsArray' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted, Temp_bool_True_if_break_was_hit_Variable) == 0x00002C, "Member 'B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted, Temp_int_Array_Index_Variable) == 0x000030, "Member 'B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted, CallFunc_Array_Get_Item) == 0x000038, "Member 'B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted, CallFunc_Not_PreBool_ReturnValue_1) == 0x000048, "Member 'B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted, CallFunc_Less_IntInt_ReturnValue) == 0x000049, "Member 'B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted, CallFunc_BooleanAND_ReturnValue) == 0x00004A, "Member 'B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted, CallFunc_Array_Contains_ReturnValue) == 0x000050, "Member 'B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted, CallFunc_Set_ToArray_Result) == 0x000058, "Member 'B_CreativeMoveTool_Athena_C_IsComponentStillHighlighted::CallFunc_Set_ToArray_Result' has a wrong offset!");

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.HandlePlaysetSelected
// 0x01A0 (0x01A0 - 0x0000)
struct B_CreativeMoveTool_Athena_C_HandlePlaysetSelected final
{
public:
	struct FFortItemEntry                         PlaysetItemEntry;                                  // 0x0000(0x01A0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(B_CreativeMoveTool_Athena_C_HandlePlaysetSelected) == 0x000008, "Wrong alignment on B_CreativeMoveTool_Athena_C_HandlePlaysetSelected");
static_assert(sizeof(B_CreativeMoveTool_Athena_C_HandlePlaysetSelected) == 0x0001A0, "Wrong size on B_CreativeMoveTool_Athena_C_HandlePlaysetSelected");
static_assert(offsetof(B_CreativeMoveTool_Athena_C_HandlePlaysetSelected, PlaysetItemEntry) == 0x000000, "Member 'B_CreativeMoveTool_Athena_C_HandlePlaysetSelected::PlaysetItemEntry' has a wrong offset!");

// Function B_CreativeMoveTool_Athena.B_CreativeMoveTool_Athena_C.ExecuteUbergraph_B_CreativeMoveTool_Athena
// 0x0820 (0x0820 - 0x0000)
struct B_CreativeMoveTool_Athena_C_ExecuteUbergraph_B_CreativeMoveTool_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base_1;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_2;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base_2;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_CreativeMoveTool_BlueprintPreviewer_C* CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x00D8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAverageScaleModifier_ReturnValue;      // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_8;                  // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_8;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_9;                  // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_8;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_9;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_9;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_10;                  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x0128(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_Rotation_Axis;                  // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Scale;                          // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_136[0x2];                                      // 0x0136(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_10;                 // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_10;                // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_11;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0146(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_For_Multi_Selection_ReturnValue;    // 0x0147(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_CreativeMoveTool_BlueprintPreviewer_C* CallFunc_Array_Get_Item_1;                         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x3];                                      // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_CreativeMoveTool_BlueprintPreviewer_C* CallFunc_Array_Get_Item_2;                         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
