#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Resolve_MountedCannon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Resolve_MountedCannon.B_Prj_Resolve_MountedCannon_C
// 0x0220 (0x0C10 - 0x09F0)
class AB_Prj_Resolve_MountedCannon_C final : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        InAirLoop_SFX;                                     // 0x09F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      P_Cannon_Prj_Niagara_VFX;                          // 0x0A00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Cannon_Projectile_VFX;                           // 0x0A08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         AdjustProjectileOffset_ProjectileOffset_FC0E263849DC1EFB37BE53893A771A47; // 0x0A10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            AdjustProjectileOffset__Direction_FC0E263849DC1EFB37BE53893A771A47; // 0x0A14(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A15[0x3];                                      // 0x0A15(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     AdjustProjectileOffset;                            // 0x0A18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cannonball_SurfaceImpactSound;                     // 0x0A20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cannonball_PlayerImpactSound;                      // 0x0A28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cannonball_ExplosionSound;                         // 0x0A30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartingVelocity;                                  // 0x0A38(0x0018)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         LastHitBuilding;                                   // 0x0A50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         EnemyLaunchVelocity;                               // 0x0A58(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         VelocityLossMultiplier;                            // 0x0A80(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MinimumVelocity;                                   // 0x0AA8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         CannonballInitialSpeed;                            // 0x0AD0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         CannonballGravityScale;                            // 0x0AF8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FHitResult                             LastHitResult;                                     // 0x0B20(0x00E0)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UMaterialInterface*                     ExplosionDecal;                                    // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         WaterImpactFX;                                     // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AdjustProjectileOffset__FinishedFunc();
	void AdjustProjectileOffset__UpdateFunc();
	void BndEvt__B_Prj_Resolve_MountedCannon_WaterInteractionComponent_K2Node_ComponentBoundEvent_1_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsFirstBody);
	void BndEvt__ProjectileMovementComponent_K2Node_ComponentBoundEvent_0_OnProjectileStopDelegate__DelegateSignature(const struct FHitResult& ImpactResult);
	struct FVector CalculateNewVelocity(const struct FVector& TraceStart, const struct FVector& TraceEnd, bool* ReturnValue2);
	void ExecuteUbergraph_B_Prj_Resolve_MountedCannon(int32 EntryPoint);
	void HandleProjectileStop();
	void LaunchPawn(class AFortPlayerPawnAthena* LaunchedPawn);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void OnTouched(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FHitResult& HitResult, bool bIsOverlap);
	void PlayExplodeVFXAndSound(const struct FHitResult& HitResult);
	void ReceiveBeginPlay();
	void Resume_Movement();
	bool ShouldResimulateAfterBuildingHit(class ABuildingActor* HitBuilding);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Resolve_MountedCannon_C">();
	}
	static class AB_Prj_Resolve_MountedCannon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Resolve_MountedCannon_C>();
	}
};
static_assert(alignof(AB_Prj_Resolve_MountedCannon_C) == 0x000008, "Wrong alignment on AB_Prj_Resolve_MountedCannon_C");
static_assert(sizeof(AB_Prj_Resolve_MountedCannon_C) == 0x000C10, "Wrong size on AB_Prj_Resolve_MountedCannon_C");
static_assert(offsetof(AB_Prj_Resolve_MountedCannon_C, UberGraphFrame) == 0x0009F0, "Member 'AB_Prj_Resolve_MountedCannon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Resolve_MountedCannon_C, InAirLoop_SFX) == 0x0009F8, "Member 'AB_Prj_Resolve_MountedCannon_C::InAirLoop_SFX' has a wrong offset!");
static_assert(offsetof(AB_Prj_Resolve_MountedCannon_C, P_Cannon_Prj_Niagara_VFX) == 0x000A00, "Member 'AB_Prj_Resolve_MountedCannon_C::P_Cannon_Prj_Niagara_VFX' has a wrong offset!");
static_assert(offsetof(AB_Prj_Resolve_MountedCannon_C, P_Cannon_Projectile_VFX) == 0x000A08, "Member 'AB_Prj_Resolve_MountedCannon_C::P_Cannon_Projectile_VFX' has a wrong offset!");
static_assert(offsetof(AB_Prj_Resolve_MountedCannon_C, AdjustProjectileOffset_ProjectileOffset_FC0E263849DC1EFB37BE53893A771A47) == 0x000A10, "Member 'AB_Prj_Resolve_MountedCannon_C::AdjustProjectileOffset_ProjectileOffset_FC0E263849DC1EFB37BE53893A771A47' has a wrong offset!");
static_assert(offsetof(AB_Prj_Resolve_MountedCannon_C, AdjustProjectileOffset__Direction_FC0E263849DC1EFB37BE53893A771A47) == 0x000A14, "Member 'AB_Prj_Resolve_MountedCannon_C::AdjustProjectileOffset__Direction_FC0E263849DC1EFB37BE53893A771A47' has a wrong offset!");
static_assert(offsetof(AB_Prj_Resolve_MountedCannon_C, AdjustProjectileOffset) == 0x000A18, "Member 'AB_Prj_Resolve_MountedCannon_C::AdjustProjectileOffset' has a wrong offset!");
static_assert(offsetof(AB_Prj_Resolve_MountedCannon_C, Cannonball_SurfaceImpactSound) == 0x000A20, "Member 'AB_Prj_Resolve_MountedCannon_C::Cannonball_SurfaceImpactSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Resolve_MountedCannon_C, Cannonball_PlayerImpactSound) == 0x000A28, "Member 'AB_Prj_Resolve_MountedCannon_C::Cannonball_PlayerImpactSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Resolve_MountedCannon_C, Cannonball_ExplosionSound) == 0x000A30, "Member 'AB_Prj_Resolve_MountedCannon_C::Cannonball_ExplosionSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Resolve_MountedCannon_C, StartingVelocity) == 0x000A38, "Member 'AB_Prj_Resolve_MountedCannon_C::StartingVelocity' has a wrong offset!");
static_assert(offsetof(AB_Prj_Resolve_MountedCannon_C, LastHitBuilding) == 0x000A50, "Member 'AB_Prj_Resolve_MountedCannon_C::LastHitBuilding' has a wrong offset!");
static_assert(offsetof(AB_Prj_Resolve_MountedCannon_C, EnemyLaunchVelocity) == 0x000A58, "Member 'AB_Prj_Resolve_MountedCannon_C::EnemyLaunchVelocity' has a wrong offset!");
static_assert(offsetof(AB_Prj_Resolve_MountedCannon_C, VelocityLossMultiplier) == 0x000A80, "Member 'AB_Prj_Resolve_MountedCannon_C::VelocityLossMultiplier' has a wrong offset!");
static_assert(offsetof(AB_Prj_Resolve_MountedCannon_C, MinimumVelocity) == 0x000AA8, "Member 'AB_Prj_Resolve_MountedCannon_C::MinimumVelocity' has a wrong offset!");
static_assert(offsetof(AB_Prj_Resolve_MountedCannon_C, CannonballInitialSpeed) == 0x000AD0, "Member 'AB_Prj_Resolve_MountedCannon_C::CannonballInitialSpeed' has a wrong offset!");
static_assert(offsetof(AB_Prj_Resolve_MountedCannon_C, CannonballGravityScale) == 0x000AF8, "Member 'AB_Prj_Resolve_MountedCannon_C::CannonballGravityScale' has a wrong offset!");
static_assert(offsetof(AB_Prj_Resolve_MountedCannon_C, LastHitResult) == 0x000B20, "Member 'AB_Prj_Resolve_MountedCannon_C::LastHitResult' has a wrong offset!");
static_assert(offsetof(AB_Prj_Resolve_MountedCannon_C, ExplosionDecal) == 0x000C00, "Member 'AB_Prj_Resolve_MountedCannon_C::ExplosionDecal' has a wrong offset!");
static_assert(offsetof(AB_Prj_Resolve_MountedCannon_C, WaterImpactFX) == 0x000C08, "Member 'AB_Prj_Resolve_MountedCannon_C::WaterImpactFX' has a wrong offset!");

}

