#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Ranged_GenericMountedCannon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Ranged_GenericMountedCannon.B_Ranged_GenericMountedCannon_C.ActivateOrDeactivateWindParticle
// 0x0001 (0x0001 - 0x0000)
struct B_Ranged_GenericMountedCannon_C_ActivateOrDeactivateWindParticle final
{
public:
	bool                                          bNewActive;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_GenericMountedCannon_C_ActivateOrDeactivateWindParticle) == 0x000001, "Wrong alignment on B_Ranged_GenericMountedCannon_C_ActivateOrDeactivateWindParticle");
static_assert(sizeof(B_Ranged_GenericMountedCannon_C_ActivateOrDeactivateWindParticle) == 0x000001, "Wrong size on B_Ranged_GenericMountedCannon_C_ActivateOrDeactivateWindParticle");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ActivateOrDeactivateWindParticle, bNewActive) == 0x000000, "Member 'B_Ranged_GenericMountedCannon_C_ActivateOrDeactivateWindParticle::bNewActive' has a wrong offset!");

// Function B_Ranged_GenericMountedCannon.B_Ranged_GenericMountedCannon_C.ActivateReloadSmokeFX
// 0x0001 (0x0001 - 0x0000)
struct B_Ranged_GenericMountedCannon_C_ActivateReloadSmokeFX final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_GenericMountedCannon_C_ActivateReloadSmokeFX) == 0x000001, "Wrong alignment on B_Ranged_GenericMountedCannon_C_ActivateReloadSmokeFX");
static_assert(sizeof(B_Ranged_GenericMountedCannon_C_ActivateReloadSmokeFX) == 0x000001, "Wrong size on B_Ranged_GenericMountedCannon_C_ActivateReloadSmokeFX");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ActivateReloadSmokeFX, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'B_Ranged_GenericMountedCannon_C_ActivateReloadSmokeFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function B_Ranged_GenericMountedCannon.B_Ranged_GenericMountedCannon_C.ActivateShellsFX
// 0x0001 (0x0001 - 0x0000)
struct B_Ranged_GenericMountedCannon_C_ActivateShellsFX final
{
public:
	bool                                          Bool;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_GenericMountedCannon_C_ActivateShellsFX) == 0x000001, "Wrong alignment on B_Ranged_GenericMountedCannon_C_ActivateShellsFX");
static_assert(sizeof(B_Ranged_GenericMountedCannon_C_ActivateShellsFX) == 0x000001, "Wrong size on B_Ranged_GenericMountedCannon_C_ActivateShellsFX");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ActivateShellsFX, Bool) == 0x000000, "Member 'B_Ranged_GenericMountedCannon_C_ActivateShellsFX::Bool' has a wrong offset!");

// Function B_Ranged_GenericMountedCannon.B_Ranged_GenericMountedCannon_C.AddRandomScale
// 0x0048 (0x0048 - 0x0000)
struct B_Ranged_GenericMountedCannon_C_AddRandomScale final
{
public:
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_GenericMountedCannon_C_AddRandomScale) == 0x000008, "Wrong alignment on B_Ranged_GenericMountedCannon_C_AddRandomScale");
static_assert(sizeof(B_Ranged_GenericMountedCannon_C_AddRandomScale) == 0x000048, "Wrong size on B_Ranged_GenericMountedCannon_C_AddRandomScale");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_AddRandomScale, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'B_Ranged_GenericMountedCannon_C_AddRandomScale::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_AddRandomScale, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000004, "Member 'B_Ranged_GenericMountedCannon_C_AddRandomScale::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_AddRandomScale, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'B_Ranged_GenericMountedCannon_C_AddRandomScale::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_AddRandomScale, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'B_Ranged_GenericMountedCannon_C_AddRandomScale::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_AddRandomScale, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000028, "Member 'B_Ranged_GenericMountedCannon_C_AddRandomScale::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_AddRandomScale, CallFunc_MakeVector_ReturnValue_1) == 0x000030, "Member 'B_Ranged_GenericMountedCannon_C_AddRandomScale::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");

// Function B_Ranged_GenericMountedCannon.B_Ranged_GenericMountedCannon_C.DeactivateReloadSmokeFX
// 0x0001 (0x0001 - 0x0000)
struct B_Ranged_GenericMountedCannon_C_DeactivateReloadSmokeFX final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_GenericMountedCannon_C_DeactivateReloadSmokeFX) == 0x000001, "Wrong alignment on B_Ranged_GenericMountedCannon_C_DeactivateReloadSmokeFX");
static_assert(sizeof(B_Ranged_GenericMountedCannon_C_DeactivateReloadSmokeFX) == 0x000001, "Wrong size on B_Ranged_GenericMountedCannon_C_DeactivateReloadSmokeFX");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_DeactivateReloadSmokeFX, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'B_Ranged_GenericMountedCannon_C_DeactivateReloadSmokeFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function B_Ranged_GenericMountedCannon.B_Ranged_GenericMountedCannon_C.DeactivateShellsFX
// 0x0001 (0x0001 - 0x0000)
struct B_Ranged_GenericMountedCannon_C_DeactivateShellsFX final
{
public:
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_GenericMountedCannon_C_DeactivateShellsFX) == 0x000001, "Wrong alignment on B_Ranged_GenericMountedCannon_C_DeactivateShellsFX");
static_assert(sizeof(B_Ranged_GenericMountedCannon_C_DeactivateShellsFX) == 0x000001, "Wrong size on B_Ranged_GenericMountedCannon_C_DeactivateShellsFX");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_DeactivateShellsFX, CallFunc_IsActive_ReturnValue) == 0x000000, "Member 'B_Ranged_GenericMountedCannon_C_DeactivateShellsFX::CallFunc_IsActive_ReturnValue' has a wrong offset!");

// Function B_Ranged_GenericMountedCannon.B_Ranged_GenericMountedCannon_C.ExecuteUbergraph_B_Ranged_GenericMountedCannon
// 0x0C80 (0x0C80 - 0x0000)
struct B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPI_ReturnValue;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseFirstPersonTargeting_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSecondaryFire;                       // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortReloadFXState                            K2Node_Event_ReloadStage;                          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MathExpression_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MathExpression_ReturnValue_1;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewIsTargeting;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetHiddenInGameOtherLocalControllersOnly_ReturnValue; // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetHiddenInGameControllerOnly_ReturnValue; // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetHiddenInGameControllerOnly_ReturnValue_1; // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortAIPawn*>                    CallFunc_GetAllActorsOfClass_OutActors;            // 0x0030(0x0010)(ReferenceParm)
	bool                                          K2Node_CustomEvent_Enable_Or_Disable;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_StencilBufferValue;             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAlterationItemDefinition*          K2Node_Event_NewAlteration;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortCosmeticModification              K2Node_Event_CosmeticMod;                          // 0x0070(0x0600)()
	bool                                          CallFunc_IsAssetNull_ReturnValue;                  // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAssetNull_ReturnValue_1;                // 0x0671(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0672(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAssetNull_ReturnValue_2;                // 0x0673(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAssetNull_ReturnValue_3;                // 0x0674(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_675[0x3];                                      // 0x0675(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeToNextFire_ReturnValue;            // 0x0678(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocalMagazineAmmoCount_ReturnValue;    // 0x067C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0684(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0688(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseScopeTargeting_ReturnValue;            // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0691(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_692[0x6];                                      // 0x0692(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0698(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x06B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x06C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable_1;                       // 0x06C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CA[0x2];                                      // 0x06CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_TargetLimit_1;                  // 0x06CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x06D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D4[0x4];                                      // 0x06D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x06D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enable;                         // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F1[0x3];                                      // 0x06F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_TargetLimit;                    // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System;              // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_701[0x3];                                      // 0x0701(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingFirstPersonCamera_ReturnValue;     // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingScopeOrFirstPersonCamera_ReturnValue; // 0x0711(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0712(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_713[0x5];                                      // 0x0713(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerZone*              K2Node_DynamicCast_AsFort_Player_Controller_Zone;  // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0728(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_729[0x7];                                      // 0x0729(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWindManager*                       CallFunc_GetWindManager_ReturnValue;               // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetADSTransitionInTime_ReturnValue;       // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x073C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_1;              // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseScopeTargeting_ReturnValue_1;          // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_751[0x7];                                      // 0x0751(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_1;                  // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_761[0x7];                                      // 0x0761(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalViewingPlayerController_ReturnValue; // 0x0768(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_2;              // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_779[0x7];                                      // 0x0779(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_2;                  // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_789[0x7];                                      // 0x0789(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalViewingPlayerController_ReturnValue_1; // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0798(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x079C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79D[0x3];                                      // 0x079D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A4[0x4];                                      // 0x07A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_3;              // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue_4;              // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_3;                  // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C1[0x7];                                      // 0x07C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_4;                  // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D1[0x7];                                      // 0x07D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalViewingPlayerController_ReturnValue_2; // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x07E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x07E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E2[0x6];                                      // 0x07E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x07E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x0800(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0818(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x0828(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UseScopeTargeting_ReturnValue_2;          // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x0839(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSetForLocalControllerOnly;           // 0x083A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83B[0x5];                                      // 0x083B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x0840(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_1;            // 0x0848(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0850(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0851(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_852[0x2];                                      // 0x0852(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingDetailMode_ReturnValue;       // 0x0854(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0858(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0859(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85A[0x2];                                      // 0x085A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingDetailMode_ReturnValue_1;     // 0x085C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0860(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0861(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsTargeting_ReturnValue;               // 0x0862(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsTargeting_ReturnValue_1;             // 0x0863(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_864[0x4];                                      // 0x0864(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetWeaponDataSmallPreviewImage_ReturnValue; // 0x0868(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_GetOrLoadSynchronously_ReturnValue;       // 0x0890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldPlayPersistentFireFX_ReturnValue;   // 0x0898(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_899[0x7];                                      // 0x0899(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_GetBeamPSC_ReturnValue;                   // 0x08A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetUseBeamParticles_ReturnValue;          // 0x08B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B1[0x7];                                      // 0x08B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_2;                            // 0x08B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x08C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C1[0x7];                                      // 0x08C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_2;            // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x08D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D1[0x7];                                      // 0x08D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        CallFunc_SetBeamParticleSystem_ReturnValue;        // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x08E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x08E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System_3;            // 0x08F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x08F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F9[0x3];                                      // 0x08F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x08FC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0908(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_914[0x4];                                      // 0x0914(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_3;                       // 0x0918(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAIPawn*                            CallFunc_Array_Get_Item;                           // 0x0920(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0929(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92A[0x2];                                      // 0x092A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x092C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0930(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0931(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0932(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_933[0xD];                                      // 0x0933(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0940(0x0060)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x09A0(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0A00(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0A18(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0A30(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0A48(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0A60(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0A78(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0A90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0A94(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0A98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0A9C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0AA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0AA4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0AA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AAC[0x4];                                      // 0x0AAC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_3;          // 0x0AB0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0AC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ACC[0x4];                                      // 0x0ACC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_4;          // 0x0AD0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0AE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AEC[0x4];                                      // 0x0AEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0AF0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_1;       // 0x0B08(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0B10(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0B28(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0C08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x0C0C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C0D[0x3];                                      // 0x0C0D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0C10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0C14(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0C18(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1C[0x4];                                      // 0x0C1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0C20(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0C38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x0C3C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0C40(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0C58(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue_1;            // 0x0C70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0C71(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon) == 0x000010, "Wrong alignment on B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon");
static_assert(sizeof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon) == 0x000C80, "Wrong size on B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, EntryPoint) == 0x000000, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_GetPI_ReturnValue) == 0x000004, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_GetPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000008, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_UseFirstPersonTargeting_ReturnValue) == 0x00000C, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_UseFirstPersonTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000010, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, Temp_int_Array_Index_Variable) == 0x000014, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_IsDedicatedServer_ReturnValue) == 0x000018, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000019, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, K2Node_Event_bPersistentFire) == 0x00001A, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, K2Node_Event_bSecondaryFire) == 0x00001B, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::K2Node_Event_bSecondaryFire' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, K2Node_Event_ReloadStage) == 0x00001C, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::K2Node_Event_ReloadStage' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000020, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, K2Node_MathExpression_ReturnValue) == 0x000024, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::K2Node_MathExpression_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, K2Node_MathExpression_ReturnValue_1) == 0x000028, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::K2Node_MathExpression_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, K2Node_Event_bNewIsTargeting) == 0x000029, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::K2Node_Event_bNewIsTargeting' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_SetHiddenInGameOtherLocalControllersOnly_ReturnValue) == 0x00002A, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_SetHiddenInGameOtherLocalControllersOnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_SetHiddenInGameControllerOnly_ReturnValue) == 0x00002B, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_SetHiddenInGameControllerOnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_SetHiddenInGameControllerOnly_ReturnValue_1) == 0x00002C, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_SetHiddenInGameControllerOnly_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_GetAllActorsOfClass_OutActors) == 0x000030, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, K2Node_CustomEvent_Enable_Or_Disable) == 0x000040, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::K2Node_CustomEvent_Enable_Or_Disable' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, K2Node_CustomEvent_StencilBufferValue) == 0x000044, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::K2Node_CustomEvent_StencilBufferValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000058, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x000060, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, K2Node_Event_NewAlteration) == 0x000068, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::K2Node_Event_NewAlteration' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, K2Node_Event_CosmeticMod) == 0x000070, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::K2Node_Event_CosmeticMod' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_IsAssetNull_ReturnValue) == 0x000670, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_IsAssetNull_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_IsAssetNull_ReturnValue_1) == 0x000671, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_IsAssetNull_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_Not_PreBool_ReturnValue) == 0x000672, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_IsAssetNull_ReturnValue_2) == 0x000673, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_IsAssetNull_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_IsAssetNull_ReturnValue_3) == 0x000674, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_IsAssetNull_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_GetTimeToNextFire_ReturnValue) == 0x000678, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_GetTimeToNextFire_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_GetLocalMagazineAmmoCount_ReturnValue) == 0x00067C, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_GetLocalMagazineAmmoCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000680, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000684, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_K2_SetTimer_ReturnValue) == 0x000688, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_UseScopeTargeting_ReturnValue) == 0x000690, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_UseScopeTargeting_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_IsValid_ReturnValue) == 0x000691, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_GetSocketLocation_ReturnValue) == 0x000698, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0006B0, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_GetInstigator_ReturnValue) == 0x0006B8, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, K2Node_DynamicCast_AsFort_Pawn) == 0x0006C0, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, K2Node_DynamicCast_bSuccess) == 0x0006C8, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, K2Node_CustomEvent_Enable_1) == 0x0006C9, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::K2Node_CustomEvent_Enable_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, K2Node_CustomEvent_TargetLimit_1) == 0x0006CC, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::K2Node_CustomEvent_TargetLimit_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_SelectInt_ReturnValue) == 0x0006D0, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0006D8, "Member 'B_Ranged_GenericMountedCannon_C_ExecuteUbergraph_B_Ranged_GenericMountedCannon::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
