#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Ranged_GenericMountedCannon

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "En_ShellTypes_01_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Ranged_GenericMountedCannon.B_Ranged_GenericMountedCannon_C
// 0x0198 (0x16C8 - 0x1530)
class AB_Ranged_GenericMountedCannon_C : public AFortWeaponRangedMountedCannon
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Muzzle1P_Empty_;                                   // 0x1538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   IronSightsMesh1P;                                  // 0x1540(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               MuzzleWindParticle_Empty_;                         // 0x1548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Reload_Empty_;                                     // 0x1550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Shells_empty_;                                     // 0x1558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ScopeMesh1P;                                       // 0x1560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Muzzle_Empty_;                                     // 0x1568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         AnimateScopePostProcess_DownSightPostProcessAmount_E57F8A624B0326DDF7A607AB2B92D195; // 0x1570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            AnimateScopePostProcess__Direction_E57F8A624B0326DDF7A607AB2B92D195; // 0x1574(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1575[0x3];                                     // 0x1575(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     AnimateScopePostProcess;                           // 0x1578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        MuzzleParticleSystem;                              // 0x1580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        WeaponDurabilityDestroyEffect;                     // 0x1588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        WeaponDurabilityDestroyEffectIcon;                 // 0x1590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDestroyEffect;                                  // 0x1598(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Reload_Particles;                              // 0x1599(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159A[0x6];                                     // 0x159A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Reload_ParticleSystem;                             // 0x15A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastPlayFXTime;                                    // 0x15A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinPlayFXTime;                                     // 0x15AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseShellsOnFire_;                                  // 0x15B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseShellsOnReload_;                                // 0x15B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseShellsOnPump_;                                  // 0x15B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15B3[0x5];                                     // 0x15B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        ShellsParticleSystemTemplate;                      // 0x15B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReloadSocketName;                                  // 0x15C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C4[0x4];                                     // 0x15C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortAIPawn*>                    Array_Of_Active_Enemy_AI;                          // 0x15C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          Scope___Render_Enemies_To_Custom_Depth_Buffer;     // 0x15D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_15D9[0x3];                                     // 0x15D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Shells_Socket_Name;                                // 0x15DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	En_ShellTypes_01                              ShellTypeSelect;                                   // 0x15E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15E1[0x3];                                     // 0x15E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Shells_Spawn_Rate_Scale;                           // 0x15E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ShellsRotationRate;                                // 0x15E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Shells_Velocity;                                   // 0x1600(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Shells_Gravity;                                    // 0x1618(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shells_Lifetime;                                   // 0x1630(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1634[0x4];                                     // 0x1634(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Shells_Size;                                       // 0x1638(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shells_Time_Dilation;                              // 0x1650(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SmallShells;                                       // 0x1654(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          MediumShells;                                      // 0x1655(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LargeShells;                                       // 0x1656(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShotgunShells;                                     // 0x1657(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnergyShells;                                      // 0x1658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1659[0x3];                                     // 0x1659(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Inherit_Parent_Velocity;                           // 0x165C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cylindrical_Radius;                                // 0x1660(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cylindrical_Height;                                // 0x1664(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugShellsSocket_;                                // 0x1668(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1669[0x7];                                     // 0x1669(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound_ScopeZoomIn;                                 // 0x1670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_ScopeZoomOut;                                // 0x1678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Alteration_Ambient_PS;                             // 0x1680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ReticleHUDElementTags;                             // 0x1688(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Is_Wind_Enabled;                                   // 0x16A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A9[0x7];                                     // 0x16A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        MuzzleWindParticleSystem;                          // 0x16B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        MuzzleParticleSystem1P;                            // 0x16B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldHideReticleAfterDelay;                       // 0x16C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateOrDeactivateWindParticle(bool bNewActive);
	void ActivateReloadSmokeFX();
	void ActivateShellsFX(bool Bool);
	void AddRandomScale();
	void AnimateScopePostProcess__FinishedFunc();
	void AnimateScopePostProcess__UpdateFunc();
	void DeactivateMuzzleFX();
	void DeactivateReloadSmokeFX();
	void DeactivateShellsFX();
	void ExecuteUbergraph_B_Ranged_GenericMountedCannon(int32 EntryPoint);
	void HandlePawnAndWeaponVisFor1PTargeting(bool IsTargeting);
	void HideGunMesh();
	void HideIronSightsMesh();
	void HideReticle();
	void HideWeapon();
	void HideWeaponMesh();
	void InitializeScopeVariables();
	void K2_OnUnEquip();
	void Muzzle_Flash_FX(bool Persistent_Fire);
	void Muzzle_Play_Reload_FX(EFortReloadFXState Selection);
	void OnEquippedWeaponDestory();
	void OnInitAlteration(class UFortAlterationItemDefinition* NewAlteration);
	void OnInitCosmeticAlterations(const struct FFortCosmeticModification& CosmeticMod);
	void OnLoaded_16CAFB6E4E8091866C2642A669D4DCF7(class UObject* Loaded);
	void OnLoaded_575FCB5443E495736B8BE6BBC3D41E8C(class UObject* Loaded);
	void OnLoaded_941B4D03491F957EF97917BFF1EF6B00(class UObject* Loaded);
	void OnLoaded_CD8718E64EA83A512EE3B892656574CE(class UObject* Loaded);
	void OnPlayReloadFX(EFortReloadFXState ReloadStage);
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void OnSetTargeting(bool bNewIsTargeting);
	void OnStopWeaponFireFX();
	void OnWeaponAttached();
	void OnWeaponVisibilityChanged(bool bVisible, bool bSetForLocalControllerOnly);
	void ReceiveBeginPlay();
	void SetupShellFX();
	void SetWeaponPierceThrough(bool Enable, int32 TargetLimit);
	void SetWeaponPierceThrough_ClientRep(bool Enable, int32 TargetLimit);
	void SetWpnRarity();
	void ShellsON__onPump_();
	void ShowGunMesh();
	void ShowReticle();
	void ShowWeapon();
	void ShowWeaponMesh();
	void Update_Enemy_Custom_Depths(bool Enable_Or_Disable, int32 StencilBufferValue);
	void UpdateShellEmittersFX();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Ranged_GenericMountedCannon_C">();
	}
	static class AB_Ranged_GenericMountedCannon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Ranged_GenericMountedCannon_C>();
	}
};
static_assert(alignof(AB_Ranged_GenericMountedCannon_C) == 0x000008, "Wrong alignment on AB_Ranged_GenericMountedCannon_C");
static_assert(sizeof(AB_Ranged_GenericMountedCannon_C) == 0x0016C8, "Wrong size on AB_Ranged_GenericMountedCannon_C");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, UberGraphFrame) == 0x001530, "Member 'AB_Ranged_GenericMountedCannon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Muzzle1P_Empty_) == 0x001538, "Member 'AB_Ranged_GenericMountedCannon_C::Muzzle1P_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, IronSightsMesh1P) == 0x001540, "Member 'AB_Ranged_GenericMountedCannon_C::IronSightsMesh1P' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, MuzzleWindParticle_Empty_) == 0x001548, "Member 'AB_Ranged_GenericMountedCannon_C::MuzzleWindParticle_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Reload_Empty_) == 0x001550, "Member 'AB_Ranged_GenericMountedCannon_C::Reload_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Shells_empty_) == 0x001558, "Member 'AB_Ranged_GenericMountedCannon_C::Shells_empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, ScopeMesh1P) == 0x001560, "Member 'AB_Ranged_GenericMountedCannon_C::ScopeMesh1P' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Muzzle_Empty_) == 0x001568, "Member 'AB_Ranged_GenericMountedCannon_C::Muzzle_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, AnimateScopePostProcess_DownSightPostProcessAmount_E57F8A624B0326DDF7A607AB2B92D195) == 0x001570, "Member 'AB_Ranged_GenericMountedCannon_C::AnimateScopePostProcess_DownSightPostProcessAmount_E57F8A624B0326DDF7A607AB2B92D195' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, AnimateScopePostProcess__Direction_E57F8A624B0326DDF7A607AB2B92D195) == 0x001574, "Member 'AB_Ranged_GenericMountedCannon_C::AnimateScopePostProcess__Direction_E57F8A624B0326DDF7A607AB2B92D195' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, AnimateScopePostProcess) == 0x001578, "Member 'AB_Ranged_GenericMountedCannon_C::AnimateScopePostProcess' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, MuzzleParticleSystem) == 0x001580, "Member 'AB_Ranged_GenericMountedCannon_C::MuzzleParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, WeaponDurabilityDestroyEffect) == 0x001588, "Member 'AB_Ranged_GenericMountedCannon_C::WeaponDurabilityDestroyEffect' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, WeaponDurabilityDestroyEffectIcon) == 0x001590, "Member 'AB_Ranged_GenericMountedCannon_C::WeaponDurabilityDestroyEffectIcon' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, UseDestroyEffect) == 0x001598, "Member 'AB_Ranged_GenericMountedCannon_C::UseDestroyEffect' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Use_Reload_Particles) == 0x001599, "Member 'AB_Ranged_GenericMountedCannon_C::Use_Reload_Particles' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Reload_ParticleSystem) == 0x0015A0, "Member 'AB_Ranged_GenericMountedCannon_C::Reload_ParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, LastPlayFXTime) == 0x0015A8, "Member 'AB_Ranged_GenericMountedCannon_C::LastPlayFXTime' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, MinPlayFXTime) == 0x0015AC, "Member 'AB_Ranged_GenericMountedCannon_C::MinPlayFXTime' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, UseShellsOnFire_) == 0x0015B0, "Member 'AB_Ranged_GenericMountedCannon_C::UseShellsOnFire_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, UseShellsOnReload_) == 0x0015B1, "Member 'AB_Ranged_GenericMountedCannon_C::UseShellsOnReload_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, UseShellsOnPump_) == 0x0015B2, "Member 'AB_Ranged_GenericMountedCannon_C::UseShellsOnPump_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, ShellsParticleSystemTemplate) == 0x0015B8, "Member 'AB_Ranged_GenericMountedCannon_C::ShellsParticleSystemTemplate' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, ReloadSocketName) == 0x0015C0, "Member 'AB_Ranged_GenericMountedCannon_C::ReloadSocketName' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Array_Of_Active_Enemy_AI) == 0x0015C8, "Member 'AB_Ranged_GenericMountedCannon_C::Array_Of_Active_Enemy_AI' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Scope___Render_Enemies_To_Custom_Depth_Buffer) == 0x0015D8, "Member 'AB_Ranged_GenericMountedCannon_C::Scope___Render_Enemies_To_Custom_Depth_Buffer' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Shells_Socket_Name) == 0x0015DC, "Member 'AB_Ranged_GenericMountedCannon_C::Shells_Socket_Name' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, ShellTypeSelect) == 0x0015E0, "Member 'AB_Ranged_GenericMountedCannon_C::ShellTypeSelect' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Shells_Spawn_Rate_Scale) == 0x0015E4, "Member 'AB_Ranged_GenericMountedCannon_C::Shells_Spawn_Rate_Scale' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, ShellsRotationRate) == 0x0015E8, "Member 'AB_Ranged_GenericMountedCannon_C::ShellsRotationRate' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Shells_Velocity) == 0x001600, "Member 'AB_Ranged_GenericMountedCannon_C::Shells_Velocity' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Shells_Gravity) == 0x001618, "Member 'AB_Ranged_GenericMountedCannon_C::Shells_Gravity' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Shells_Lifetime) == 0x001630, "Member 'AB_Ranged_GenericMountedCannon_C::Shells_Lifetime' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Shells_Size) == 0x001638, "Member 'AB_Ranged_GenericMountedCannon_C::Shells_Size' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Shells_Time_Dilation) == 0x001650, "Member 'AB_Ranged_GenericMountedCannon_C::Shells_Time_Dilation' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, SmallShells) == 0x001654, "Member 'AB_Ranged_GenericMountedCannon_C::SmallShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, MediumShells) == 0x001655, "Member 'AB_Ranged_GenericMountedCannon_C::MediumShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, LargeShells) == 0x001656, "Member 'AB_Ranged_GenericMountedCannon_C::LargeShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, ShotgunShells) == 0x001657, "Member 'AB_Ranged_GenericMountedCannon_C::ShotgunShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, EnergyShells) == 0x001658, "Member 'AB_Ranged_GenericMountedCannon_C::EnergyShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Inherit_Parent_Velocity) == 0x00165C, "Member 'AB_Ranged_GenericMountedCannon_C::Inherit_Parent_Velocity' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Cylindrical_Radius) == 0x001660, "Member 'AB_Ranged_GenericMountedCannon_C::Cylindrical_Radius' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Cylindrical_Height) == 0x001664, "Member 'AB_Ranged_GenericMountedCannon_C::Cylindrical_Height' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, DebugShellsSocket_) == 0x001668, "Member 'AB_Ranged_GenericMountedCannon_C::DebugShellsSocket_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Sound_ScopeZoomIn) == 0x001670, "Member 'AB_Ranged_GenericMountedCannon_C::Sound_ScopeZoomIn' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Sound_ScopeZoomOut) == 0x001678, "Member 'AB_Ranged_GenericMountedCannon_C::Sound_ScopeZoomOut' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Alteration_Ambient_PS) == 0x001680, "Member 'AB_Ranged_GenericMountedCannon_C::Alteration_Ambient_PS' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, ReticleHUDElementTags) == 0x001688, "Member 'AB_Ranged_GenericMountedCannon_C::ReticleHUDElementTags' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, Is_Wind_Enabled) == 0x0016A8, "Member 'AB_Ranged_GenericMountedCannon_C::Is_Wind_Enabled' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, MuzzleWindParticleSystem) == 0x0016B0, "Member 'AB_Ranged_GenericMountedCannon_C::MuzzleWindParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, MuzzleParticleSystem1P) == 0x0016B8, "Member 'AB_Ranged_GenericMountedCannon_C::MuzzleParticleSystem1P' has a wrong offset!");
static_assert(offsetof(AB_Ranged_GenericMountedCannon_C, ShouldHideReticleAfterDelay) == 0x0016C0, "Member 'AB_Ranged_GenericMountedCannon_C::ShouldHideReticleAfterDelay' has a wrong offset!");

}

