#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Resolve_MountedCannonAthena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "B_Ranged_GenericMountedCannon_classes.hpp"
#include "AudioExtensions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Resolve_MountedCannonAthena.B_Resolve_MountedCannonAthena_C
// 0x0128 (0x17F0 - 0x16C8)
class AB_Resolve_MountedCannonAthena_C final : public AB_Ranged_GenericMountedCannon_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Resolve_MountedCannonAthena_C;    // 0x16C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_FiringDelay;                                     // 0x16D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Launched_Player;                                // 0x16D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         DefaultPlayerLaunchSpeed;                          // 0x16E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         IgnoreBarrelDuration;                              // 0x1708(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_170C[0x4];                                     // 0x170C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             ReloadStartSound;                                  // 0x1710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ReloadEndSound;                                    // 0x1718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAudioParameter>                AudioParameters;                                   // 0x1720(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             FireEmptySound;                                    // 0x1730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayAbility>           GA_GliderRedeploy;                                 // 0x1738(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UNiagaraSystem*                         MuzzleFireVFX;                                     // 0x1740(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UCameraShakeBase>           FireCameraShake;                                   // 0x1748(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UFXSystemAsset*                         MuzzleFlashFX;                                     // 0x1750(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMountedCannon__v2_C*                   MountedCannon;                                     // 0x1758(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TraceDistance;                                     // 0x1760(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1764[0x4];                                     // 0x1764(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         IgnoreActorsDistance;                              // 0x1768(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         IgnoreActorsDuration;                              // 0x1790(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 ProjectileHardRef;                                 // 0x17B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLaunchingPawn;                                    // 0x17C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C1[0x7];                                     // 0x17C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_CanFireNormalProjectile;                       // 0x17C8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void CloseOutOfAmmoGate();
	void ExecuteUbergraph_B_Resolve_MountedCannonAthena(int32 EntryPoint);
	void GetLaunchSpeed(float* DesiredSpeed);
	void IgnoreActorsLinkedToCannon(class AFortPlayerPawn* PlayerPawn);
	void IgnoreNearbyCollision(class AFortPlayerPawn* Pawn, const struct FVector& LaunchDirection);
	void Muzzle_Flash_FX(bool Persistent_Fire);
	void OnFinishedCooling();
	void OnHostVehicleSetup();
	void OnLaunchPawn(class AFortPlayerPawn* Pawn, const struct FVector& LaunchDir);
	void OnLocalFailedToFireWhenOverheated();
	void OnLocalTargetingChanged_Event(bool bIsTargeting_0);
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void OnPreLaunchPawn(class AFortPlayerPawn* Pawn, const struct FVector& LaunchDir);
	void OpenOutOfAmmoGate();
	void ReceiveBeginPlay();

	void GetActorSoundParams(TArray<struct FAudioParameter>* Params_0) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Resolve_MountedCannonAthena_C">();
	}
	static class AB_Resolve_MountedCannonAthena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Resolve_MountedCannonAthena_C>();
	}
};
static_assert(alignof(AB_Resolve_MountedCannonAthena_C) == 0x000008, "Wrong alignment on AB_Resolve_MountedCannonAthena_C");
static_assert(sizeof(AB_Resolve_MountedCannonAthena_C) == 0x0017F0, "Wrong size on AB_Resolve_MountedCannonAthena_C");
static_assert(offsetof(AB_Resolve_MountedCannonAthena_C, UberGraphFrame_B_Resolve_MountedCannonAthena_C) == 0x0016C8, "Member 'AB_Resolve_MountedCannonAthena_C::UberGraphFrame_B_Resolve_MountedCannonAthena_C' has a wrong offset!");
static_assert(offsetof(AB_Resolve_MountedCannonAthena_C, P_FiringDelay) == 0x0016D0, "Member 'AB_Resolve_MountedCannonAthena_C::P_FiringDelay' has a wrong offset!");
static_assert(offsetof(AB_Resolve_MountedCannonAthena_C, GE_Launched_Player) == 0x0016D8, "Member 'AB_Resolve_MountedCannonAthena_C::GE_Launched_Player' has a wrong offset!");
static_assert(offsetof(AB_Resolve_MountedCannonAthena_C, DefaultPlayerLaunchSpeed) == 0x0016E0, "Member 'AB_Resolve_MountedCannonAthena_C::DefaultPlayerLaunchSpeed' has a wrong offset!");
static_assert(offsetof(AB_Resolve_MountedCannonAthena_C, IgnoreBarrelDuration) == 0x001708, "Member 'AB_Resolve_MountedCannonAthena_C::IgnoreBarrelDuration' has a wrong offset!");
static_assert(offsetof(AB_Resolve_MountedCannonAthena_C, ReloadStartSound) == 0x001710, "Member 'AB_Resolve_MountedCannonAthena_C::ReloadStartSound' has a wrong offset!");
static_assert(offsetof(AB_Resolve_MountedCannonAthena_C, ReloadEndSound) == 0x001718, "Member 'AB_Resolve_MountedCannonAthena_C::ReloadEndSound' has a wrong offset!");
static_assert(offsetof(AB_Resolve_MountedCannonAthena_C, AudioParameters) == 0x001720, "Member 'AB_Resolve_MountedCannonAthena_C::AudioParameters' has a wrong offset!");
static_assert(offsetof(AB_Resolve_MountedCannonAthena_C, FireEmptySound) == 0x001730, "Member 'AB_Resolve_MountedCannonAthena_C::FireEmptySound' has a wrong offset!");
static_assert(offsetof(AB_Resolve_MountedCannonAthena_C, GA_GliderRedeploy) == 0x001738, "Member 'AB_Resolve_MountedCannonAthena_C::GA_GliderRedeploy' has a wrong offset!");
static_assert(offsetof(AB_Resolve_MountedCannonAthena_C, MuzzleFireVFX) == 0x001740, "Member 'AB_Resolve_MountedCannonAthena_C::MuzzleFireVFX' has a wrong offset!");
static_assert(offsetof(AB_Resolve_MountedCannonAthena_C, FireCameraShake) == 0x001748, "Member 'AB_Resolve_MountedCannonAthena_C::FireCameraShake' has a wrong offset!");
static_assert(offsetof(AB_Resolve_MountedCannonAthena_C, MuzzleFlashFX) == 0x001750, "Member 'AB_Resolve_MountedCannonAthena_C::MuzzleFlashFX' has a wrong offset!");
static_assert(offsetof(AB_Resolve_MountedCannonAthena_C, MountedCannon) == 0x001758, "Member 'AB_Resolve_MountedCannonAthena_C::MountedCannon' has a wrong offset!");
static_assert(offsetof(AB_Resolve_MountedCannonAthena_C, TraceDistance) == 0x001760, "Member 'AB_Resolve_MountedCannonAthena_C::TraceDistance' has a wrong offset!");
static_assert(offsetof(AB_Resolve_MountedCannonAthena_C, IgnoreActorsDistance) == 0x001768, "Member 'AB_Resolve_MountedCannonAthena_C::IgnoreActorsDistance' has a wrong offset!");
static_assert(offsetof(AB_Resolve_MountedCannonAthena_C, IgnoreActorsDuration) == 0x001790, "Member 'AB_Resolve_MountedCannonAthena_C::IgnoreActorsDuration' has a wrong offset!");
static_assert(offsetof(AB_Resolve_MountedCannonAthena_C, ProjectileHardRef) == 0x0017B8, "Member 'AB_Resolve_MountedCannonAthena_C::ProjectileHardRef' has a wrong offset!");
static_assert(offsetof(AB_Resolve_MountedCannonAthena_C, bLaunchingPawn) == 0x0017C0, "Member 'AB_Resolve_MountedCannonAthena_C::bLaunchingPawn' has a wrong offset!");
static_assert(offsetof(AB_Resolve_MountedCannonAthena_C, Row_CanFireNormalProjectile) == 0x0017C8, "Member 'AB_Resolve_MountedCannonAthena_C::Row_CanFireNormalProjectile' has a wrong offset!");

}

