#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BotController_NPC_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_PhoebeController_NonParticipant_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BotController_NPC_Base.BP_BotController_NPC_Base_C
// 0x0050 (0x1220 - 0x11D0)
class ABP_BotController_NPC_Base_C final : public ABP_PhoebeController_NonParticipant_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x11C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortAthenaNpcPatrollingComponent*      FortAthenaNpcPatrolling;                           // 0x11D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_Patrolling;                                     // 0x11D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GE_PatrollingSpeedHandle;                          // 0x11E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               SavedRotationRate;                                 // 0x11E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               PatrollingRotationRate;                            // 0x1200(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_BotController_NPC_Base(int32 EntryPoint);
	void BndEvt__FortAthenaNpcPatrolling_K2Node_ComponentBoundEvent_1_PatrollingComponentOnStopPatrolling__DelegateSignature();
	void BndEvt__FortAthenaNpcPatrolling_K2Node_ComponentBoundEvent_0_PatrollingComponentOnStartPatrolling__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BotController_NPC_Base_C">();
	}
	static class ABP_BotController_NPC_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BotController_NPC_Base_C>();
	}
};
static_assert(alignof(ABP_BotController_NPC_Base_C) == 0x000010, "Wrong alignment on ABP_BotController_NPC_Base_C");
static_assert(sizeof(ABP_BotController_NPC_Base_C) == 0x001220, "Wrong size on ABP_BotController_NPC_Base_C");
static_assert(offsetof(ABP_BotController_NPC_Base_C, UberGraphFrame) == 0x0011C8, "Member 'ABP_BotController_NPC_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BotController_NPC_Base_C, FortAthenaNpcPatrolling) == 0x0011D0, "Member 'ABP_BotController_NPC_Base_C::FortAthenaNpcPatrolling' has a wrong offset!");
static_assert(offsetof(ABP_BotController_NPC_Base_C, GE_Patrolling) == 0x0011D8, "Member 'ABP_BotController_NPC_Base_C::GE_Patrolling' has a wrong offset!");
static_assert(offsetof(ABP_BotController_NPC_Base_C, GE_PatrollingSpeedHandle) == 0x0011E0, "Member 'ABP_BotController_NPC_Base_C::GE_PatrollingSpeedHandle' has a wrong offset!");
static_assert(offsetof(ABP_BotController_NPC_Base_C, SavedRotationRate) == 0x0011E8, "Member 'ABP_BotController_NPC_Base_C::SavedRotationRate' has a wrong offset!");
static_assert(offsetof(ABP_BotController_NPC_Base_C, PatrollingRotationRate) == 0x001200, "Member 'ABP_BotController_NPC_Base_C::PatrollingRotationRate' has a wrong offset!");

}

