#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPi_CreativeMoveToolOverrides

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPi_CreativeMoveToolOverrides.BPi_CreativeMoveToolOverrides_C.GetCreativeActorOrigin
// 0x0020 (0x0020 - 0x0000)
struct BPi_CreativeMoveToolOverrides_C_GetCreativeActorOrigin final
{
public:
	bool                                          Override;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Center;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPi_CreativeMoveToolOverrides_C_GetCreativeActorOrigin) == 0x000008, "Wrong alignment on BPi_CreativeMoveToolOverrides_C_GetCreativeActorOrigin");
static_assert(sizeof(BPi_CreativeMoveToolOverrides_C_GetCreativeActorOrigin) == 0x000020, "Wrong size on BPi_CreativeMoveToolOverrides_C_GetCreativeActorOrigin");
static_assert(offsetof(BPi_CreativeMoveToolOverrides_C_GetCreativeActorOrigin, Override) == 0x000000, "Member 'BPi_CreativeMoveToolOverrides_C_GetCreativeActorOrigin::Override' has a wrong offset!");
static_assert(offsetof(BPi_CreativeMoveToolOverrides_C_GetCreativeActorOrigin, Center) == 0x000008, "Member 'BPi_CreativeMoveToolOverrides_C_GetCreativeActorOrigin::Center' has a wrong offset!");

// Function BPi_CreativeMoveToolOverrides.BPi_CreativeMoveToolOverrides_C.GetCreativeActorBounds
// 0x0020 (0x0020 - 0x0000)
struct BPi_CreativeMoveToolOverrides_C_GetCreativeActorBounds final
{
public:
	bool                                          Override_Bounds;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Bounds;                                            // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPi_CreativeMoveToolOverrides_C_GetCreativeActorBounds) == 0x000008, "Wrong alignment on BPi_CreativeMoveToolOverrides_C_GetCreativeActorBounds");
static_assert(sizeof(BPi_CreativeMoveToolOverrides_C_GetCreativeActorBounds) == 0x000020, "Wrong size on BPi_CreativeMoveToolOverrides_C_GetCreativeActorBounds");
static_assert(offsetof(BPi_CreativeMoveToolOverrides_C_GetCreativeActorBounds, Override_Bounds) == 0x000000, "Member 'BPi_CreativeMoveToolOverrides_C_GetCreativeActorBounds::Override_Bounds' has a wrong offset!");
static_assert(offsetof(BPi_CreativeMoveToolOverrides_C_GetCreativeActorBounds, Bounds) == 0x000008, "Member 'BPi_CreativeMoveToolOverrides_C_GetCreativeActorBounds::Bounds' has a wrong offset!");

}

