#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_ApplyGameplayEffect

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BTService_ApplyGameplayEffect.BTService_ApplyGameplayEffect_C.ReceiveDeactivation
// 0x0008 (0x0008 - 0x0000)
struct BTService_ApplyGameplayEffect_C_ReceiveDeactivation final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_ApplyGameplayEffect_C_ReceiveDeactivation) == 0x000008, "Wrong alignment on BTService_ApplyGameplayEffect_C_ReceiveDeactivation");
static_assert(sizeof(BTService_ApplyGameplayEffect_C_ReceiveDeactivation) == 0x000008, "Wrong size on BTService_ApplyGameplayEffect_C_ReceiveDeactivation");
static_assert(offsetof(BTService_ApplyGameplayEffect_C_ReceiveDeactivation, OwnerActor) == 0x000000, "Member 'BTService_ApplyGameplayEffect_C_ReceiveDeactivation::OwnerActor' has a wrong offset!");

// Function BTService_ApplyGameplayEffect.BTService_ApplyGameplayEffect_C.ReceiveActivation
// 0x0008 (0x0008 - 0x0000)
struct BTService_ApplyGameplayEffect_C_ReceiveActivation final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_ApplyGameplayEffect_C_ReceiveActivation) == 0x000008, "Wrong alignment on BTService_ApplyGameplayEffect_C_ReceiveActivation");
static_assert(sizeof(BTService_ApplyGameplayEffect_C_ReceiveActivation) == 0x000008, "Wrong size on BTService_ApplyGameplayEffect_C_ReceiveActivation");
static_assert(offsetof(BTService_ApplyGameplayEffect_C_ReceiveActivation, OwnerActor) == 0x000000, "Member 'BTService_ApplyGameplayEffect_C_ReceiveActivation::OwnerActor' has a wrong offset!");

// Function BTService_ApplyGameplayEffect.BTService_ApplyGameplayEffect_C.ExecuteUbergraph_BTService_ApplyGameplayEffect
// 0x0080 (0x0080 - 0x0000)
struct BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor_1;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_DynamicCast_AsAIController;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_DynamicCast_AsAIController_1;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue_1;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_1; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0074(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect) == 0x000008, "Wrong alignment on BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect");
static_assert(sizeof(BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect) == 0x000080, "Wrong size on BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect");
static_assert(offsetof(BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect, EntryPoint) == 0x000000, "Member 'BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect, CallFunc_IsValidClass_ReturnValue) == 0x000004, "Member 'BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect, K2Node_Event_OwnerActor_1) == 0x000008, "Member 'BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect::K2Node_Event_OwnerActor_1' has a wrong offset!");
static_assert(offsetof(BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect, K2Node_DynamicCast_AsAIController) == 0x000010, "Member 'BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect::K2Node_DynamicCast_AsAIController' has a wrong offset!");
static_assert(offsetof(BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect, CallFunc_K2_GetPawn_ReturnValue) == 0x000020, "Member 'BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect, K2Node_Event_OwnerActor) == 0x000028, "Member 'BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect::K2Node_Event_OwnerActor' has a wrong offset!");
static_assert(offsetof(BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect, K2Node_DynamicCast_AsAIController_1) == 0x000038, "Member 'BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect::K2Node_DynamicCast_AsAIController_1' has a wrong offset!");
static_assert(offsetof(BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect, CallFunc_K2_GetPawn_ReturnValue_1) == 0x000048, "Member 'BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect::CallFunc_K2_GetPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000058, "Member 'BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect, CallFunc_IsValid_ReturnValue_2) == 0x000060, "Member 'BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect, CallFunc_GetFortAbilitySystemComponent_ReturnValue_1) == 0x000068, "Member 'BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect::CallFunc_GetFortAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect, CallFunc_IsValid_ReturnValue_3) == 0x000070, "Member 'BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000074, "Member 'BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect, CallFunc_IsValidClass_ReturnValue_1) == 0x00007C, "Member 'BTService_ApplyGameplayEffect_C_ExecuteUbergraph_BTService_ApplyGameplayEffect::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");

}

