#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ContrailBaselineController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Niagara_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ContrailBaselineController.ContrailBaselineController_C
// 0x0058 (0x00C0 - 0x0068)
class UContrailBaselineController_C final : public UNiagaraBaselineController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0068(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class USkeletalMesh>           MeshAssetRef;                                      // 0x0070(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            AnimAssetRef;                                      // 0x0098(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	bool OnTickTest();
	void OnOwnerTick(float DeltaTime);
	void OnEndTest(const struct FNiagaraPerfBaselineStats& Stats);
	void OnBeginTest();
	void ExecuteUbergraph_ContrailBaselineController(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ContrailBaselineController_C">();
	}
	static class UContrailBaselineController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UContrailBaselineController_C>();
	}
};
static_assert(alignof(UContrailBaselineController_C) == 0x000008, "Wrong alignment on UContrailBaselineController_C");
static_assert(sizeof(UContrailBaselineController_C) == 0x0000C0, "Wrong size on UContrailBaselineController_C");
static_assert(offsetof(UContrailBaselineController_C, UberGraphFrame) == 0x000068, "Member 'UContrailBaselineController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UContrailBaselineController_C, MeshAssetRef) == 0x000070, "Member 'UContrailBaselineController_C::MeshAssetRef' has a wrong offset!");
static_assert(offsetof(UContrailBaselineController_C, AnimAssetRef) == 0x000098, "Member 'UContrailBaselineController_C::AnimAssetRef' has a wrong offset!");

}

