#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeInteraction_Delete

#include "Basic.hpp"


namespace SDK::Params
{

// Function CreativeInteraction_Delete.CreativeInteraction_Delete_C.ExecuteUbergraph_CreativeInteraction_Delete
// 0x0088 (0x0088 - 0x0000)
struct CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 CallFunc_GetDeleteActorsMeshComponents_Components; // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	class AFortCreativeMoveTool*                  CallFunc_GetFortCreativeMoveTool_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_CreativeMoveTool_Athena_C*           K2Node_DynamicCast_AsB_Creative_Move_Tool_Athena;  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_ActorToDestroy;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete) == 0x000008, "Wrong alignment on CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete");
static_assert(sizeof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete) == 0x000088, "Wrong size on CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, EntryPoint) == 0x000000, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::EntryPoint' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, Temp_int_Loop_Counter_Variable_1) == 0x000008, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, Temp_int_Array_Index_Variable) == 0x000014, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, Temp_int_Array_Index_Variable_1) == 0x000018, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, CallFunc_Array_Get_Item) == 0x000020, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, CallFunc_Less_IntInt_ReturnValue) == 0x00002D, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, CallFunc_GetDeleteActorsMeshComponents_Components) == 0x000030, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::CallFunc_GetDeleteActorsMeshComponents_Components' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, CallFunc_GetFortCreativeMoveTool_ReturnValue) == 0x000040, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::CallFunc_GetFortCreativeMoveTool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, K2Node_DynamicCast_AsB_Creative_Move_Tool_Athena) == 0x000048, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::K2Node_DynamicCast_AsB_Creative_Move_Tool_Athena' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, K2Node_CustomEvent_ActorToDestroy) == 0x000058, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::K2Node_CustomEvent_ActorToDestroy' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, CallFunc_Array_AddUnique_ReturnValue) == 0x000060, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, CallFunc_Array_Get_Item_1) == 0x000068, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, CallFunc_Array_Length_ReturnValue_1) == 0x000074, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, CallFunc_Less_IntInt_ReturnValue_1) == 0x000078, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, CallFunc_Array_Find_ReturnValue) == 0x00007C, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000080, "Member 'CreativeInteraction_Delete_C_ExecuteUbergraph_CreativeInteraction_Delete::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function CreativeInteraction_Delete.CreativeInteraction_Delete_C.DestroyAndDontRemove
// 0x0030 (0x0030 - 0x0000)
struct CreativeInteraction_Delete_C_DestroyAndDontRemove final
{
public:
	class AActor*                                 ActorToDestroy;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortCreativeMoveTool*                  CallFunc_GetFortCreativeMoveTool_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortCreativeMoveTool*                  CallFunc_GetFortCreativeMoveTool_ReturnValue_1;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunningOnOwningClient_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_CreativeMoveTool_Athena_C*           K2Node_DynamicCast_AsB_Creative_Move_Tool_Athena;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeInteraction_Delete_C_DestroyAndDontRemove) == 0x000008, "Wrong alignment on CreativeInteraction_Delete_C_DestroyAndDontRemove");
static_assert(sizeof(CreativeInteraction_Delete_C_DestroyAndDontRemove) == 0x000030, "Wrong size on CreativeInteraction_Delete_C_DestroyAndDontRemove");
static_assert(offsetof(CreativeInteraction_Delete_C_DestroyAndDontRemove, ActorToDestroy) == 0x000000, "Member 'CreativeInteraction_Delete_C_DestroyAndDontRemove::ActorToDestroy' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_DestroyAndDontRemove, CallFunc_GetFortCreativeMoveTool_ReturnValue) == 0x000008, "Member 'CreativeInteraction_Delete_C_DestroyAndDontRemove::CallFunc_GetFortCreativeMoveTool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_DestroyAndDontRemove, CallFunc_GetFortCreativeMoveTool_ReturnValue_1) == 0x000010, "Member 'CreativeInteraction_Delete_C_DestroyAndDontRemove::CallFunc_GetFortCreativeMoveTool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_DestroyAndDontRemove, CallFunc_IsRunningOnOwningClient_ReturnValue) == 0x000018, "Member 'CreativeInteraction_Delete_C_DestroyAndDontRemove::CallFunc_IsRunningOnOwningClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_DestroyAndDontRemove, K2Node_DynamicCast_AsB_Creative_Move_Tool_Athena) == 0x000020, "Member 'CreativeInteraction_Delete_C_DestroyAndDontRemove::K2Node_DynamicCast_AsB_Creative_Move_Tool_Athena' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_DestroyAndDontRemove, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'CreativeInteraction_Delete_C_DestroyAndDontRemove::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CreativeInteraction_Delete.CreativeInteraction_Delete_C.DestroyActorOnAnimationFinished
// 0x0038 (0x0038 - 0x0000)
struct CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished final
{
public:
	class AActor*                                 ActorToDestroy;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortCreativeMoveTool*                  CallFunc_GetFortCreativeMoveTool_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRunningOnOwningClient_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortCreativeMoveTool*                  CallFunc_GetFortCreativeMoveTool_ReturnValue_1;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortCreativeMoveTool*                  CallFunc_GetFortCreativeMoveTool_ReturnValue_2;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_CreativeMoveTool_Athena_C*           K2Node_DynamicCast_AsB_Creative_Move_Tool_Athena;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished) == 0x000008, "Wrong alignment on CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished");
static_assert(sizeof(CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished) == 0x000038, "Wrong size on CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished");
static_assert(offsetof(CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished, ActorToDestroy) == 0x000000, "Member 'CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished::ActorToDestroy' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished, CallFunc_GetFortCreativeMoveTool_ReturnValue) == 0x000008, "Member 'CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished::CallFunc_GetFortCreativeMoveTool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished, CallFunc_IsRunningOnOwningClient_ReturnValue) == 0x000010, "Member 'CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished::CallFunc_IsRunningOnOwningClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished, CallFunc_Array_RemoveItem_ReturnValue) == 0x000011, "Member 'CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished, CallFunc_GetFortCreativeMoveTool_ReturnValue_1) == 0x000018, "Member 'CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished::CallFunc_GetFortCreativeMoveTool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished, CallFunc_GetFortCreativeMoveTool_ReturnValue_2) == 0x000020, "Member 'CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished::CallFunc_GetFortCreativeMoveTool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished, K2Node_DynamicCast_AsB_Creative_Move_Tool_Athena) == 0x000028, "Member 'CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished::K2Node_DynamicCast_AsB_Creative_Move_Tool_Athena' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'CreativeInteraction_Delete_C_DestroyActorOnAnimationFinished::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CreativeInteraction_Delete.CreativeInteraction_Delete_C.Destroy Actor
// 0x0008 (0x0008 - 0x0000)
struct CreativeInteraction_Delete_C_Destroy_Actor final
{
public:
	class AActor*                                 ActorToDestroy;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeInteraction_Delete_C_Destroy_Actor) == 0x000008, "Wrong alignment on CreativeInteraction_Delete_C_Destroy_Actor");
static_assert(sizeof(CreativeInteraction_Delete_C_Destroy_Actor) == 0x000008, "Wrong size on CreativeInteraction_Delete_C_Destroy_Actor");
static_assert(offsetof(CreativeInteraction_Delete_C_Destroy_Actor, ActorToDestroy) == 0x000000, "Member 'CreativeInteraction_Delete_C_Destroy_Actor::ActorToDestroy' has a wrong offset!");

}

