#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Creative_Device_Prop_Parent

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "EEnabledOnPhase_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "EVisibleInGameState_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function Creative_Device_Prop_Parent.Creative_Device_Prop_Parent_C.UserConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct Creative_Device_Prop_Parent_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_InEditor_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_Device_Prop_Parent_C_UserConstructionScript) == 0x000001, "Wrong alignment on Creative_Device_Prop_Parent_C_UserConstructionScript");
static_assert(sizeof(Creative_Device_Prop_Parent_C_UserConstructionScript) == 0x000002, "Wrong size on Creative_Device_Prop_Parent_C_UserConstructionScript");
static_assert(offsetof(Creative_Device_Prop_Parent_C_UserConstructionScript, CallFunc_InEditor_ReturnValue) == 0x000000, "Member 'Creative_Device_Prop_Parent_C_UserConstructionScript::CallFunc_InEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_UserConstructionScript, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'Creative_Device_Prop_Parent_C_UserConstructionScript::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function Creative_Device_Prop_Parent.Creative_Device_Prop_Parent_C.Update Visibility In Game
// 0x0005 (0x0005 - 0x0000)
struct Creative_Device_Prop_Parent_C_Update_Visibility_In_Game final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVisibleInGameState                           Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVisibleInGameState                           Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Visible_In_Game_Visible;               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVisibleInGameState                           K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_Device_Prop_Parent_C_Update_Visibility_In_Game) == 0x000001, "Wrong alignment on Creative_Device_Prop_Parent_C_Update_Visibility_In_Game");
static_assert(sizeof(Creative_Device_Prop_Parent_C_Update_Visibility_In_Game) == 0x000005, "Wrong size on Creative_Device_Prop_Parent_C_Update_Visibility_In_Game");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Visibility_In_Game, Temp_bool_Variable) == 0x000000, "Member 'Creative_Device_Prop_Parent_C_Update_Visibility_In_Game::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Visibility_In_Game, Temp_byte_Variable) == 0x000001, "Member 'Creative_Device_Prop_Parent_C_Update_Visibility_In_Game::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Visibility_In_Game, Temp_byte_Variable_1) == 0x000002, "Member 'Creative_Device_Prop_Parent_C_Update_Visibility_In_Game::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Visibility_In_Game, CallFunc_Is_Visible_In_Game_Visible) == 0x000003, "Member 'Creative_Device_Prop_Parent_C_Update_Visibility_In_Game::CallFunc_Is_Visible_In_Game_Visible' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Visibility_In_Game, K2Node_Select_Default) == 0x000004, "Member 'Creative_Device_Prop_Parent_C_Update_Visibility_In_Game::K2Node_Select_Default' has a wrong offset!");

// Function Creative_Device_Prop_Parent.Creative_Device_Prop_Parent_C.Update Preview Only Visibility
// 0x0068 (0x0068 - 0x0000)
struct Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPreviewBuildingActor_ReturnValue;       // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USceneComponent*>                CallFunc_GetMoveToolPreviewComponents_ForceHideInPreview; // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class USceneComponent*>                CallFunc_GetMoveToolPreviewComponents_ForceShowInPreview; // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility) == 0x000008, "Wrong alignment on Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility");
static_assert(sizeof(Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility) == 0x000068, "Wrong size on Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility, Temp_int_Array_Index_Variable) == 0x000008, "Member 'Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility, CallFunc_IsDedicatedServer_ReturnValue) == 0x00000C, "Member 'Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility, CallFunc_IsPreviewBuildingActor_ReturnValue) == 0x00000D, "Member 'Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility::CallFunc_IsPreviewBuildingActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility, CallFunc_GetMoveToolPreviewComponents_ForceHideInPreview) == 0x000018, "Member 'Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility::CallFunc_GetMoveToolPreviewComponents_ForceHideInPreview' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility, CallFunc_GetMoveToolPreviewComponents_ForceShowInPreview) == 0x000028, "Member 'Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility::CallFunc_GetMoveToolPreviewComponents_ForceShowInPreview' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility, Temp_int_Loop_Counter_Variable_1) == 0x000038, "Member 'Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility, CallFunc_Array_Get_Item) == 0x000040, "Member 'Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility, CallFunc_Add_IntInt_ReturnValue_1) == 0x000048, "Member 'Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility, CallFunc_Array_Length_ReturnValue_1) == 0x00005C, "Member 'Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility, CallFunc_Less_IntInt_ReturnValue_1) == 0x000060, "Member 'Creative_Device_Prop_Parent_C_Update_Preview_Only_Visibility::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function Creative_Device_Prop_Parent.Creative_Device_Prop_Parent_C.ResetHealthIfSet
// 0x0068 (0x0068 - 0x0000)
struct Creative_Device_Prop_Parent_C_ResetHealthIfSet final
{
public:
	float                                         Health;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0030(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0040(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_Device_Prop_Parent_C_ResetHealthIfSet) == 0x000008, "Wrong alignment on Creative_Device_Prop_Parent_C_ResetHealthIfSet");
static_assert(sizeof(Creative_Device_Prop_Parent_C_ResetHealthIfSet) == 0x000068, "Wrong size on Creative_Device_Prop_Parent_C_ResetHealthIfSet");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ResetHealthIfSet, Health) == 0x000000, "Member 'Creative_Device_Prop_Parent_C_ResetHealthIfSet::Health' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ResetHealthIfSet, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'Creative_Device_Prop_Parent_C_ResetHealthIfSet::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ResetHealthIfSet, CallFunc_GetMaxHealth_ReturnValue) == 0x000008, "Member 'Creative_Device_Prop_Parent_C_ResetHealthIfSet::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ResetHealthIfSet, Temp_bool_Variable) == 0x00000C, "Member 'Creative_Device_Prop_Parent_C_ResetHealthIfSet::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ResetHealthIfSet, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'Creative_Device_Prop_Parent_C_ResetHealthIfSet::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ResetHealthIfSet, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'Creative_Device_Prop_Parent_C_ResetHealthIfSet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ResetHealthIfSet, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000020, "Member 'Creative_Device_Prop_Parent_C_ResetHealthIfSet::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ResetHealthIfSet, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000028, "Member 'Creative_Device_Prop_Parent_C_ResetHealthIfSet::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ResetHealthIfSet, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'Creative_Device_Prop_Parent_C_ResetHealthIfSet::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ResetHealthIfSet, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000030, "Member 'Creative_Device_Prop_Parent_C_ResetHealthIfSet::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ResetHealthIfSet, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000040, "Member 'Creative_Device_Prop_Parent_C_ResetHealthIfSet::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ResetHealthIfSet, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x000050, "Member 'Creative_Device_Prop_Parent_C_ResetHealthIfSet::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ResetHealthIfSet, Temp_float_Variable) == 0x000058, "Member 'Creative_Device_Prop_Parent_C_ResetHealthIfSet::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ResetHealthIfSet, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00005C, "Member 'Creative_Device_Prop_Parent_C_ResetHealthIfSet::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ResetHealthIfSet, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x00005D, "Member 'Creative_Device_Prop_Parent_C_ResetHealthIfSet::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ResetHealthIfSet, K2Node_Select_Default) == 0x000060, "Member 'Creative_Device_Prop_Parent_C_ResetHealthIfSet::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ResetHealthIfSet, CallFunc_Not_PreBool_ReturnValue) == 0x000064, "Member 'Creative_Device_Prop_Parent_C_ResetHealthIfSet::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function Creative_Device_Prop_Parent.Creative_Device_Prop_Parent_C.Play Mode Changed
// 0x0010 (0x0010 - 0x0000)
struct Creative_Device_Prop_Parent_C_Play_Mode_Changed final
{
public:
	class AFortMinigame*                          Minigame;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInPlayMode;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_Device_Prop_Parent_C_Play_Mode_Changed) == 0x000008, "Wrong alignment on Creative_Device_Prop_Parent_C_Play_Mode_Changed");
static_assert(sizeof(Creative_Device_Prop_Parent_C_Play_Mode_Changed) == 0x000010, "Wrong size on Creative_Device_Prop_Parent_C_Play_Mode_Changed");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Play_Mode_Changed, Minigame) == 0x000000, "Member 'Creative_Device_Prop_Parent_C_Play_Mode_Changed::Minigame' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Play_Mode_Changed, bIsInPlayMode) == 0x000008, "Member 'Creative_Device_Prop_Parent_C_Play_Mode_Changed::bIsInPlayMode' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Play_Mode_Changed, CallFunc_HasAuthority_ReturnValue) == 0x000009, "Member 'Creative_Device_Prop_Parent_C_Play_Mode_Changed::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function Creative_Device_Prop_Parent.Creative_Device_Prop_Parent_C.On Mingame State Changed
// 0x0010 (0x0010 - 0x0000)
struct Creative_Device_Prop_Parent_C_On_Mingame_State_Changed final
{
public:
	class AFortMinigame*                          Minigame;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMinigameState                            MinigameState;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_Device_Prop_Parent_C_On_Mingame_State_Changed) == 0x000008, "Wrong alignment on Creative_Device_Prop_Parent_C_On_Mingame_State_Changed");
static_assert(sizeof(Creative_Device_Prop_Parent_C_On_Mingame_State_Changed) == 0x000010, "Wrong size on Creative_Device_Prop_Parent_C_On_Mingame_State_Changed");
static_assert(offsetof(Creative_Device_Prop_Parent_C_On_Mingame_State_Changed, Minigame) == 0x000000, "Member 'Creative_Device_Prop_Parent_C_On_Mingame_State_Changed::Minigame' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_On_Mingame_State_Changed, MinigameState) == 0x000008, "Member 'Creative_Device_Prop_Parent_C_On_Mingame_State_Changed::MinigameState' has a wrong offset!");

// Function Creative_Device_Prop_Parent.Creative_Device_Prop_Parent_C.MigrateLegacyEnabledIndex
// 0x0020 (0x0020 - 0x0000)
struct Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex final
{
public:
	bool                                          MigratedProperties;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_EnabledPhaseEnumToLegacyInt_LegacyInteger; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnabledOnPhase                               CallFunc_LegacyIntToEnabledPhaseEnum_EnabledPhase; // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex) == 0x000008, "Wrong alignment on Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex");
static_assert(sizeof(Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex) == 0x000020, "Wrong size on Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex, MigratedProperties) == 0x000000, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex::MigratedProperties' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex, CallFunc_EnabledPhaseEnumToLegacyInt_LegacyInteger) == 0x000004, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex::CallFunc_EnabledPhaseEnumToLegacyInt_LegacyInteger' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex, CallFunc_GetObjectClass_ReturnValue) == 0x000010, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000018, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex, CallFunc_BooleanOR_ReturnValue) == 0x000019, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex, CallFunc_LegacyIntToEnabledPhaseEnum_EnabledPhase) == 0x00001A, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex::CallFunc_LegacyIntToEnabledPhaseEnum_EnabledPhase' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x00001B, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyEnabledIndex::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function Creative_Device_Prop_Parent.Creative_Device_Prop_Parent_C.MigrateLegacyDeviceParentUserOptions
// 0x0006 (0x0006 - 0x0000)
struct Creative_Device_Prop_Parent_C_MigrateLegacyDeviceParentUserOptions final
{
public:
	bool                                          bMigrateEnabledIndex;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMigrateActivateOnPhase;                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMigratedProperties;                               // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MigrateLegacyActivateOnGamePhase_MigratedProperties; // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MigrateLegacyEnabledIndex_MigratedProperties; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_Device_Prop_Parent_C_MigrateLegacyDeviceParentUserOptions) == 0x000001, "Wrong alignment on Creative_Device_Prop_Parent_C_MigrateLegacyDeviceParentUserOptions");
static_assert(sizeof(Creative_Device_Prop_Parent_C_MigrateLegacyDeviceParentUserOptions) == 0x000006, "Wrong size on Creative_Device_Prop_Parent_C_MigrateLegacyDeviceParentUserOptions");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyDeviceParentUserOptions, bMigrateEnabledIndex) == 0x000000, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyDeviceParentUserOptions::bMigrateEnabledIndex' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyDeviceParentUserOptions, bMigrateActivateOnPhase) == 0x000001, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyDeviceParentUserOptions::bMigrateActivateOnPhase' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyDeviceParentUserOptions, bMigratedProperties) == 0x000002, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyDeviceParentUserOptions::bMigratedProperties' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyDeviceParentUserOptions, CallFunc_MigrateLegacyActivateOnGamePhase_MigratedProperties) == 0x000003, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyDeviceParentUserOptions::CallFunc_MigrateLegacyActivateOnGamePhase_MigratedProperties' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyDeviceParentUserOptions, CallFunc_MigrateLegacyEnabledIndex_MigratedProperties) == 0x000004, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyDeviceParentUserOptions::CallFunc_MigrateLegacyEnabledIndex_MigratedProperties' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyDeviceParentUserOptions, CallFunc_BooleanOR_ReturnValue) == 0x000005, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyDeviceParentUserOptions::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function Creative_Device_Prop_Parent.Creative_Device_Prop_Parent_C.MigrateLegacyActivateOnGamePhase
// 0x0020 (0x0020 - 0x0000)
struct Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase final
{
public:
	bool                                          MigratedProperties;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase) == 0x000008, "Wrong alignment on Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase");
static_assert(sizeof(Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase) == 0x000020, "Wrong size on Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase, MigratedProperties) == 0x000000, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase::MigratedProperties' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000004, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000008, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase, CallFunc_Conv_IntToByte_ReturnValue) == 0x000009, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase, CallFunc_GetValidValue_ReturnValue) == 0x00000A, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase, CallFunc_GetObjectClass_ReturnValue) == 0x000010, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000018, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000019, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase, CallFunc_BooleanOR_ReturnValue) == 0x00001A, "Member 'Creative_Device_Prop_Parent_C_MigrateLegacyActivateOnGamePhase::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function Creative_Device_Prop_Parent.Creative_Device_Prop_Parent_C.LegacyIntToEnabledPhaseEnum
// 0x0010 (0x0010 - 0x0000)
struct Creative_Device_Prop_Parent_C_LegacyIntToEnabledPhaseEnum final
{
public:
	int32                                         LegacyInteger;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEnabledOnPhase                               EnabledPhase;                                      // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_Device_Prop_Parent_C_LegacyIntToEnabledPhaseEnum) == 0x000004, "Wrong alignment on Creative_Device_Prop_Parent_C_LegacyIntToEnabledPhaseEnum");
static_assert(sizeof(Creative_Device_Prop_Parent_C_LegacyIntToEnabledPhaseEnum) == 0x000010, "Wrong size on Creative_Device_Prop_Parent_C_LegacyIntToEnabledPhaseEnum");
static_assert(offsetof(Creative_Device_Prop_Parent_C_LegacyIntToEnabledPhaseEnum, LegacyInteger) == 0x000000, "Member 'Creative_Device_Prop_Parent_C_LegacyIntToEnabledPhaseEnum::LegacyInteger' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_LegacyIntToEnabledPhaseEnum, EnabledPhase) == 0x000004, "Member 'Creative_Device_Prop_Parent_C_LegacyIntToEnabledPhaseEnum::EnabledPhase' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_LegacyIntToEnabledPhaseEnum, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Creative_Device_Prop_Parent_C_LegacyIntToEnabledPhaseEnum::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_LegacyIntToEnabledPhaseEnum, CallFunc_Conv_IntToByte_ReturnValue) == 0x00000C, "Member 'Creative_Device_Prop_Parent_C_LegacyIntToEnabledPhaseEnum::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_LegacyIntToEnabledPhaseEnum, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000D, "Member 'Creative_Device_Prop_Parent_C_LegacyIntToEnabledPhaseEnum::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_LegacyIntToEnabledPhaseEnum, CallFunc_GetValidValue_ReturnValue) == 0x00000E, "Member 'Creative_Device_Prop_Parent_C_LegacyIntToEnabledPhaseEnum::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");

// Function Creative_Device_Prop_Parent.Creative_Device_Prop_Parent_C.Is Visible In Game
// 0x0001 (0x0001 - 0x0000)
struct Creative_Device_Prop_Parent_C_Is_Visible_In_Game final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_Device_Prop_Parent_C_Is_Visible_In_Game) == 0x000001, "Wrong alignment on Creative_Device_Prop_Parent_C_Is_Visible_In_Game");
static_assert(sizeof(Creative_Device_Prop_Parent_C_Is_Visible_In_Game) == 0x000001, "Wrong size on Creative_Device_Prop_Parent_C_Is_Visible_In_Game");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Is_Visible_In_Game, Visible) == 0x000000, "Member 'Creative_Device_Prop_Parent_C_Is_Visible_In_Game::Visible' has a wrong offset!");

// Function Creative_Device_Prop_Parent.Creative_Device_Prop_Parent_C.Initialize Device
// 0x0001 (0x0001 - 0x0000)
struct Creative_Device_Prop_Parent_C_Initialize_Device final
{
public:
	bool                                          CallFunc_IsInPlayMode_bIsInPlayMode;               // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_Device_Prop_Parent_C_Initialize_Device) == 0x000001, "Wrong alignment on Creative_Device_Prop_Parent_C_Initialize_Device");
static_assert(sizeof(Creative_Device_Prop_Parent_C_Initialize_Device) == 0x000001, "Wrong size on Creative_Device_Prop_Parent_C_Initialize_Device");
static_assert(offsetof(Creative_Device_Prop_Parent_C_Initialize_Device, CallFunc_IsInPlayMode_bIsInPlayMode) == 0x000000, "Member 'Creative_Device_Prop_Parent_C_Initialize_Device::CallFunc_IsInPlayMode_bIsInPlayMode' has a wrong offset!");

// Function Creative_Device_Prop_Parent.Creative_Device_Prop_Parent_C.GetVisibilityComponentsWithCollisionOverrides
// 0x00A0 (0x00A0 - 0x0000)
struct Creative_Device_Prop_Parent_C_GetVisibilityComponentsWithCollisionOverrides final
{
public:
	TMap<class USceneComponent*, ECollisionEnabled> VisibilityComponents;                              // 0x0000(0x0050)(Parm, OutParm, ContainsInstancedReference)
	TMap<class USceneComponent*, ECollisionEnabled> K2Node_MakeMap_Map;                                // 0x0050(0x0050)(ContainsInstancedReference)
};
static_assert(alignof(Creative_Device_Prop_Parent_C_GetVisibilityComponentsWithCollisionOverrides) == 0x000008, "Wrong alignment on Creative_Device_Prop_Parent_C_GetVisibilityComponentsWithCollisionOverrides");
static_assert(sizeof(Creative_Device_Prop_Parent_C_GetVisibilityComponentsWithCollisionOverrides) == 0x0000A0, "Wrong size on Creative_Device_Prop_Parent_C_GetVisibilityComponentsWithCollisionOverrides");
static_assert(offsetof(Creative_Device_Prop_Parent_C_GetVisibilityComponentsWithCollisionOverrides, VisibilityComponents) == 0x000000, "Member 'Creative_Device_Prop_Parent_C_GetVisibilityComponentsWithCollisionOverrides::VisibilityComponents' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_GetVisibilityComponentsWithCollisionOverrides, K2Node_MakeMap_Map) == 0x000050, "Member 'Creative_Device_Prop_Parent_C_GetVisibilityComponentsWithCollisionOverrides::K2Node_MakeMap_Map' has a wrong offset!");

// Function Creative_Device_Prop_Parent.Creative_Device_Prop_Parent_C.GetVisibilityComponents
// 0x0020 (0x0020 - 0x0000)
struct Creative_Device_Prop_Parent_C_GetVisibilityComponents final
{
public:
	TArray<class USceneComponent*>                VisibilityComponents;                              // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
	TArray<class USceneComponent*>                K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(Creative_Device_Prop_Parent_C_GetVisibilityComponents) == 0x000008, "Wrong alignment on Creative_Device_Prop_Parent_C_GetVisibilityComponents");
static_assert(sizeof(Creative_Device_Prop_Parent_C_GetVisibilityComponents) == 0x000020, "Wrong size on Creative_Device_Prop_Parent_C_GetVisibilityComponents");
static_assert(offsetof(Creative_Device_Prop_Parent_C_GetVisibilityComponents, VisibilityComponents) == 0x000000, "Member 'Creative_Device_Prop_Parent_C_GetVisibilityComponents::VisibilityComponents' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_GetVisibilityComponents, K2Node_MakeArray_Array) == 0x000010, "Member 'Creative_Device_Prop_Parent_C_GetVisibilityComponents::K2Node_MakeArray_Array' has a wrong offset!");

// Function Creative_Device_Prop_Parent.Creative_Device_Prop_Parent_C.ExecuteUbergraph_Creative_Device_Prop_Parent
// 0x00B0 (0x00B0 - 0x0000)
struct Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPreviewBuildingActor_ReturnValue;       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortMinigame*                          K2Node_ComponentBoundEvent_Minigame;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortMinigame*                          K2Node_ComponentBoundEvent_Minigame_1;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortMinigame* Minigame, bool bIsInPlayMode)> K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortMinigame*                          K2Node_CustomEvent_Minigame;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMinigameState                            K2Node_CustomEvent_MinigameState;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AFortMinigame* Minigame, EFortMinigameState MinigameState)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetVisibilityComponents_VisibilityComponents; // 0x0048(0x0010)(ReferenceParm, ContainsInstancedReference)
	TMap<class USceneComponent*, ECollisionEnabled> CallFunc_GetVisibilityComponentsWithCollisionOverrides_VisibilityComponents; // 0x0058(0x0050)(ContainsInstancedReference)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent) == 0x000008, "Wrong alignment on Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent");
static_assert(sizeof(Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent) == 0x0000B0, "Wrong size on Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent, EntryPoint) == 0x000000, "Member 'Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent, CallFunc_IsPreviewBuildingActor_ReturnValue) == 0x000004, "Member 'Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent::CallFunc_IsPreviewBuildingActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent, K2Node_ComponentBoundEvent_Minigame) == 0x000008, "Member 'Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent::K2Node_ComponentBoundEvent_Minigame' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent, K2Node_ComponentBoundEvent_Minigame_1) == 0x000018, "Member 'Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent::K2Node_ComponentBoundEvent_Minigame_1' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent, K2Node_CustomEvent_Minigame) == 0x000030, "Member 'Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent::K2Node_CustomEvent_Minigame' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent, K2Node_CustomEvent_MinigameState) == 0x000038, "Member 'Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent::K2Node_CustomEvent_MinigameState' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent, CallFunc_GetVisibilityComponents_VisibilityComponents) == 0x000048, "Member 'Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent::CallFunc_GetVisibilityComponents_VisibilityComponents' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent, CallFunc_GetVisibilityComponentsWithCollisionOverrides_VisibilityComponents) == 0x000058, "Member 'Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent::CallFunc_GetVisibilityComponentsWithCollisionOverrides_VisibilityComponents' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent, CallFunc_BooleanAND_ReturnValue) == 0x0000A8, "Member 'Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent, CallFunc_BooleanOR_ReturnValue) == 0x0000A9, "Member 'Creative_Device_Prop_Parent_C_ExecuteUbergraph_Creative_Device_Prop_Parent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function Creative_Device_Prop_Parent.Creative_Device_Prop_Parent_C.EnabledPhaseEnumToLegacyInt
// 0x0010 (0x0010 - 0x0000)
struct Creative_Device_Prop_Parent_C_EnabledPhaseEnumToLegacyInt final
{
public:
	uint8                                         EnabledPhase;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LegacyInteger;                                     // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_Device_Prop_Parent_C_EnabledPhaseEnumToLegacyInt) == 0x000004, "Wrong alignment on Creative_Device_Prop_Parent_C_EnabledPhaseEnumToLegacyInt");
static_assert(sizeof(Creative_Device_Prop_Parent_C_EnabledPhaseEnumToLegacyInt) == 0x000010, "Wrong size on Creative_Device_Prop_Parent_C_EnabledPhaseEnumToLegacyInt");
static_assert(offsetof(Creative_Device_Prop_Parent_C_EnabledPhaseEnumToLegacyInt, EnabledPhase) == 0x000000, "Member 'Creative_Device_Prop_Parent_C_EnabledPhaseEnumToLegacyInt::EnabledPhase' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_EnabledPhaseEnumToLegacyInt, LegacyInteger) == 0x000004, "Member 'Creative_Device_Prop_Parent_C_EnabledPhaseEnumToLegacyInt::LegacyInteger' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_EnabledPhaseEnumToLegacyInt, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000008, "Member 'Creative_Device_Prop_Parent_C_EnabledPhaseEnumToLegacyInt::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Creative_Device_Prop_Parent_C_EnabledPhaseEnumToLegacyInt, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'Creative_Device_Prop_Parent_C_EnabledPhaseEnumToLegacyInt::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function Creative_Device_Prop_Parent.Creative_Device_Prop_Parent_C.BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_4_OnMinigameAssignmentChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Creative_Device_Prop_Parent_C_BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_4_OnMinigameAssignmentChanged__DelegateSignature final
{
public:
	class AFortMinigame*                          Minigame;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_Device_Prop_Parent_C_BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_4_OnMinigameAssignmentChanged__DelegateSignature) == 0x000008, "Wrong alignment on Creative_Device_Prop_Parent_C_BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_4_OnMinigameAssignmentChanged__DelegateSignature");
static_assert(sizeof(Creative_Device_Prop_Parent_C_BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_4_OnMinigameAssignmentChanged__DelegateSignature) == 0x000008, "Wrong size on Creative_Device_Prop_Parent_C_BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_4_OnMinigameAssignmentChanged__DelegateSignature");
static_assert(offsetof(Creative_Device_Prop_Parent_C_BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_4_OnMinigameAssignmentChanged__DelegateSignature, Minigame) == 0x000000, "Member 'Creative_Device_Prop_Parent_C_BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_4_OnMinigameAssignmentChanged__DelegateSignature::Minigame' has a wrong offset!");

// Function Creative_Device_Prop_Parent.Creative_Device_Prop_Parent_C.BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_1_OnMinigameAssignmentChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct Creative_Device_Prop_Parent_C_BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_1_OnMinigameAssignmentChanged__DelegateSignature final
{
public:
	class AFortMinigame*                          Minigame;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Creative_Device_Prop_Parent_C_BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_1_OnMinigameAssignmentChanged__DelegateSignature) == 0x000008, "Wrong alignment on Creative_Device_Prop_Parent_C_BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_1_OnMinigameAssignmentChanged__DelegateSignature");
static_assert(sizeof(Creative_Device_Prop_Parent_C_BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_1_OnMinigameAssignmentChanged__DelegateSignature) == 0x000008, "Wrong size on Creative_Device_Prop_Parent_C_BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_1_OnMinigameAssignmentChanged__DelegateSignature");
static_assert(offsetof(Creative_Device_Prop_Parent_C_BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_1_OnMinigameAssignmentChanged__DelegateSignature, Minigame) == 0x000000, "Member 'Creative_Device_Prop_Parent_C_BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_1_OnMinigameAssignmentChanged__DelegateSignature::Minigame' has a wrong offset!");

// Function Creative_Device_Prop_Parent.Creative_Device_Prop_Parent_C.BlueprintOnLocalInteract
// 0x0010 (0x0010 - 0x0000)
struct Creative_Device_Prop_Parent_C_BlueprintOnLocalInteract final
{
public:
	class AFortPlayerPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
