#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeToolLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct CreativeToolLayerAnimBP.CreativeToolLayerAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x000B (0x000C - 0x0001)
struct CreativeToolLayerAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty;                                   // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0009(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000004, "Wrong alignment on CreativeToolLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x00000C, "Wrong size on CreativeToolLayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty) == 0x000004, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000008, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000009, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");

// ScriptStruct CreativeToolLayerAnimBP.CreativeToolLayerAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01EF (0x01F0 - 0x0001)
struct CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_296;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_297;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_298;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_299;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_300;                                // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_301;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_302;                                // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_303;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_304;                                // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_305;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_306;                                // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_307;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_308;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_309;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_310;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_311;                            // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_312;                                // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_313;                                // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_314;                            // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_315;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_316;                               // 0x0060(0x0010)(BlueprintVisible, EditFixedSize)
	class UAnimSequenceBase*                      __AnimSequenceBase_317;                            // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_318;                                // 0x0078(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_319;                            // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendProfile*                          __BlendProfile_320;                                // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_321;                                  // 0x0090(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_322;                                // 0x0098(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_323;                                // 0x0099(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_324;                               // 0x00A0(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_325;                                // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_326;                                // 0x00B4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_327;                                // 0x00B8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_328;                               // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_329;                              // 0x00C0(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_330;                               // 0x00EC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_331;                            // 0x00F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_332;                                // 0x00F8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_333;                                // 0x00F9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_334;                                // 0x00FA(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB[0x1];                                       // 0x00FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_335;                                // 0x00FC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_336;                                // 0x0100(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_337;                                // 0x0104(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_338;                                // 0x0108(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_339;                                // 0x010C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_340;                                // 0x0110(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_341;                                // 0x0114(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_342;                                // 0x0118(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_343;                                // 0x011C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_344;                                // 0x0120(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_345;                                // 0x0124(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_346;                                // 0x0128(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_347;                                // 0x012C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_348;                                // 0x0130(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_349;                                // 0x0134(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_350;                              // 0x0138(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_351;                                // 0x0150(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_352;                                // 0x0154(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0158(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01D8(0x0018)()
};
static_assert(alignof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001F0, "Wrong size on CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_296) == 0x000004, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_296' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_297) == 0x000008, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_297' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_298) == 0x00000C, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_298' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_299) == 0x000010, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_299' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_300) == 0x000014, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_300' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_301) == 0x000018, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_301' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_302) == 0x00001C, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_302' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_303) == 0x000020, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_303' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_304) == 0x000024, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_304' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_305) == 0x000028, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_305' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_306) == 0x00002C, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_306' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_307) == 0x000030, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_307' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_308) == 0x000034, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_308' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_309) == 0x000038, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_309' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_310) == 0x00003C, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_310' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_311) == 0x000040, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_311' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_312) == 0x000048, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_312' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_313) == 0x00004C, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_313' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_314) == 0x000050, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_314' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_315) == 0x000058, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_315' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_316) == 0x000060, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_316' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_317) == 0x000070, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_317' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_318) == 0x000078, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_318' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_319) == 0x000080, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_319' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_320) == 0x000088, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_320' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_321) == 0x000090, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_321' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_322) == 0x000098, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_322' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_323) == 0x000099, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_323' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_324) == 0x0000A0, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_324' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_325) == 0x0000B0, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_325' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_326) == 0x0000B4, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_326' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_327) == 0x0000B8, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_327' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_328) == 0x0000BC, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_328' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_329) == 0x0000C0, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_329' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_330) == 0x0000EC, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_330' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_331) == 0x0000F0, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_331' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_332) == 0x0000F8, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_332' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_333) == 0x0000F9, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_333' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_334) == 0x0000FA, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_334' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_335) == 0x0000FC, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_335' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_336) == 0x000100, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_336' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_337) == 0x000104, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_337' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_338) == 0x000108, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_338' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_339) == 0x00010C, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_339' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_340) == 0x000110, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_340' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_341) == 0x000114, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_341' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_342) == 0x000118, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_342' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_343) == 0x00011C, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_343' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_344) == 0x000120, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_344' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_345) == 0x000124, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_345' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_346) == 0x000128, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_346' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_347) == 0x00012C, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_347' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_348) == 0x000130, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_348' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_349) == 0x000134, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_349' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_350) == 0x000138, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_350' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_351) == 0x000150, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_351' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_352) == 0x000154, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_352' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000158, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001D8, "Member 'CreativeToolLayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

