#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeInteraction_MoveObjectsFreely

#include "Basic.hpp"

#include "Enum_CreativeMoveTool_PreviewFX_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function CreativeInteraction_MoveObjectsFreely.CreativeInteraction_MoveObjectsFreely_C.SpawnedObjectEffects
// 0x0070 (0x0070 - 0x0000)
struct CreativeInteraction_MoveObjectsFreely_C_SpawnedObjectEffects final
{
public:
	TArray<class UMeshComponent*>                 Components;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FTransform                             ActorWorldTransform;                               // 0x0010(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CreativeInteraction_MoveObjectsFreely_C_SpawnedObjectEffects) == 0x000010, "Wrong alignment on CreativeInteraction_MoveObjectsFreely_C_SpawnedObjectEffects");
static_assert(sizeof(CreativeInteraction_MoveObjectsFreely_C_SpawnedObjectEffects) == 0x000070, "Wrong size on CreativeInteraction_MoveObjectsFreely_C_SpawnedObjectEffects");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_SpawnedObjectEffects, Components) == 0x000000, "Member 'CreativeInteraction_MoveObjectsFreely_C_SpawnedObjectEffects::Components' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_SpawnedObjectEffects, ActorWorldTransform) == 0x000010, "Member 'CreativeInteraction_MoveObjectsFreely_C_SpawnedObjectEffects::ActorWorldTransform' has a wrong offset!");

// Function CreativeInteraction_MoveObjectsFreely.CreativeInteraction_MoveObjectsFreely_C.Server Set State
// 0x0010 (0x0010 - 0x0000)
struct CreativeInteraction_MoveObjectsFreely_C_Server_Set_State final
{
public:
	class AB_CreativeMoveTool_BlueprintPreviewer_C* Preview;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_CreativeMoveTool_PreviewFX               FX_State;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeInteraction_MoveObjectsFreely_C_Server_Set_State) == 0x000008, "Wrong alignment on CreativeInteraction_MoveObjectsFreely_C_Server_Set_State");
static_assert(sizeof(CreativeInteraction_MoveObjectsFreely_C_Server_Set_State) == 0x000010, "Wrong size on CreativeInteraction_MoveObjectsFreely_C_Server_Set_State");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_Server_Set_State, Preview) == 0x000000, "Member 'CreativeInteraction_MoveObjectsFreely_C_Server_Set_State::Preview' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_Server_Set_State, FX_State) == 0x000008, "Member 'CreativeInteraction_MoveObjectsFreely_C_Server_Set_State::FX_State' has a wrong offset!");

// Function CreativeInteraction_MoveObjectsFreely.CreativeInteraction_MoveObjectsFreely_C.ReturnBlueprintPreviewToPoolDispatchEvent
// 0x0010 (0x0010 - 0x0000)
struct CreativeInteraction_MoveObjectsFreely_C_ReturnBlueprintPreviewToPoolDispatchEvent final
{
public:
	class AActor*                                 Prop_Actor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_CreativeMoveTool_BlueprintPreviewer_C* Preview;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeInteraction_MoveObjectsFreely_C_ReturnBlueprintPreviewToPoolDispatchEvent) == 0x000008, "Wrong alignment on CreativeInteraction_MoveObjectsFreely_C_ReturnBlueprintPreviewToPoolDispatchEvent");
static_assert(sizeof(CreativeInteraction_MoveObjectsFreely_C_ReturnBlueprintPreviewToPoolDispatchEvent) == 0x000010, "Wrong size on CreativeInteraction_MoveObjectsFreely_C_ReturnBlueprintPreviewToPoolDispatchEvent");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_ReturnBlueprintPreviewToPoolDispatchEvent, Prop_Actor) == 0x000000, "Member 'CreativeInteraction_MoveObjectsFreely_C_ReturnBlueprintPreviewToPoolDispatchEvent::Prop_Actor' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_ReturnBlueprintPreviewToPoolDispatchEvent, Preview) == 0x000008, "Member 'CreativeInteraction_MoveObjectsFreely_C_ReturnBlueprintPreviewToPoolDispatchEvent::Preview' has a wrong offset!");

// Function CreativeInteraction_MoveObjectsFreely.CreativeInteraction_MoveObjectsFreely_C.Return Blueprint Preview to Pool
// 0x0060 (0x0060 - 0x0000)
struct CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool final
{
public:
	class AActor*                                 PropActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_CreativeMoveTool_BlueprintPreviewer_C* PreviewToPool;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_CreativeMoveTool_BlueprintPreviewer_C* PreviewToRemove;                                   // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ActorToRemove;                                     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_CreativeMoveTool_BlueprintPreviewer_C* FoundPooledActor;                                  // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FoundActorInPool;                                  // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortCreativeMoveTool*                  CallFunc_GetFortCreativeMoveTool_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_CreativeMoveTool_Athena_C*           K2Node_DynamicCast_AsB_Creative_Move_Tool_Athena;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_CreativeMoveTool_BlueprintPreviewer_C* CallFunc_Map_Find_Value;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool) == 0x000008, "Wrong alignment on CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool");
static_assert(sizeof(CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool) == 0x000060, "Wrong size on CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool, PropActor) == 0x000000, "Member 'CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool::PropActor' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool, PreviewToPool) == 0x000008, "Member 'CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool::PreviewToPool' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool, PreviewToRemove) == 0x000010, "Member 'CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool::PreviewToRemove' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool, ActorToRemove) == 0x000018, "Member 'CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool::ActorToRemove' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool, FoundPooledActor) == 0x000020, "Member 'CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool::FoundPooledActor' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool, FoundActorInPool) == 0x000028, "Member 'CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool::FoundActorInPool' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool, CallFunc_Map_Remove_ReturnValue) == 0x000029, "Member 'CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool, CallFunc_GetFortCreativeMoveTool_ReturnValue) == 0x000030, "Member 'CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool::CallFunc_GetFortCreativeMoveTool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool, K2Node_DynamicCast_AsB_Creative_Move_Tool_Athena) == 0x000040, "Member 'CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool::K2Node_DynamicCast_AsB_Creative_Move_Tool_Athena' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool, CallFunc_Map_Find_Value) == 0x000050, "Member 'CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool, CallFunc_Map_Find_ReturnValue) == 0x000058, "Member 'CreativeInteraction_MoveObjectsFreely_C_Return_Blueprint_Preview_to_Pool::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function CreativeInteraction_MoveObjectsFreely.CreativeInteraction_MoveObjectsFreely_C.OnObjectPlacement
// 0x0028 (0x0028 - 0x0000)
struct CreativeInteraction_MoveObjectsFreely_C_OnObjectPlacement final
{
public:
	TArray<class UMeshComponent*>                 Components;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	struct FOriginalAndSpawnedPair                NewlyPlacedActorPair;                              // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(CreativeInteraction_MoveObjectsFreely_C_OnObjectPlacement) == 0x000008, "Wrong alignment on CreativeInteraction_MoveObjectsFreely_C_OnObjectPlacement");
static_assert(sizeof(CreativeInteraction_MoveObjectsFreely_C_OnObjectPlacement) == 0x000028, "Wrong size on CreativeInteraction_MoveObjectsFreely_C_OnObjectPlacement");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_OnObjectPlacement, Components) == 0x000000, "Member 'CreativeInteraction_MoveObjectsFreely_C_OnObjectPlacement::Components' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_OnObjectPlacement, NewlyPlacedActorPair) == 0x000010, "Member 'CreativeInteraction_MoveObjectsFreely_C_OnObjectPlacement::NewlyPlacedActorPair' has a wrong offset!");

// Function CreativeInteraction_MoveObjectsFreely.CreativeInteraction_MoveObjectsFreely_C.GetBlueprintPreviewFromPool
// 0x00B0 (0x00B0 - 0x0000)
struct CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool final
{
public:
	TArray<class UMeshComponent*>                 MeshComponents;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AActor*                                 PropActor;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_CreativeMoveTool_PreviewFX               SpawnTransitionState;                              // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ActorWorldTransform;                               // 0x0020(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	class AB_CreativeMoveTool_BlueprintPreviewer_C* FoundPooledActor;                                  // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FoundActorInPool;                                  // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortCreativeMoveTool*                  CallFunc_GetFortCreativeMoveTool_ReturnValue;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_CreativeMoveTool_Athena_C*           K2Node_DynamicCast_AsB_Creative_Move_Tool_Athena;  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool) == 0x000010, "Wrong alignment on CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool");
static_assert(sizeof(CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool) == 0x0000B0, "Wrong size on CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool, MeshComponents) == 0x000000, "Member 'CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool::MeshComponents' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool, PropActor) == 0x000010, "Member 'CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool::PropActor' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool, SpawnTransitionState) == 0x000018, "Member 'CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool::SpawnTransitionState' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool, ActorWorldTransform) == 0x000020, "Member 'CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool::ActorWorldTransform' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool, FoundPooledActor) == 0x000080, "Member 'CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool::FoundPooledActor' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool, FoundActorInPool) == 0x000088, "Member 'CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool::FoundActorInPool' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool, CallFunc_GetFortCreativeMoveTool_ReturnValue) == 0x000090, "Member 'CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool::CallFunc_GetFortCreativeMoveTool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool, K2Node_DynamicCast_AsB_Creative_Move_Tool_Athena) == 0x0000A0, "Member 'CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool::K2Node_DynamicCast_AsB_Creative_Move_Tool_Athena' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'CreativeInteraction_MoveObjectsFreely_C_GetBlueprintPreviewFromPool::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function CreativeInteraction_MoveObjectsFreely.CreativeInteraction_MoveObjectsFreely_C.FindActiveBlueprintPreviewFromMap
// 0x0038 (0x0038 - 0x0000)
struct CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap final
{
public:
	class AActor*                                 PropActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_CreativeMoveTool_BlueprintPreviewer_C* BlueprintPreview;                                  // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_CreativeMoveTool_BlueprintPreviewer_C* FoundPooledActor;                                  // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FoundActorInPool;                                  // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_CreativeMoveTool_BlueprintPreviewer_C* CallFunc_Map_Find_Value;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap) == 0x000008, "Wrong alignment on CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap");
static_assert(sizeof(CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap) == 0x000038, "Wrong size on CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap, PropActor) == 0x000000, "Member 'CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap::PropActor' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap, Success) == 0x000008, "Member 'CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap::Success' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap, BlueprintPreview) == 0x000010, "Member 'CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap::BlueprintPreview' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap, FoundPooledActor) == 0x000018, "Member 'CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap::FoundPooledActor' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap, FoundActorInPool) == 0x000020, "Member 'CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap::FoundActorInPool' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap, CallFunc_Map_Find_Value) == 0x000028, "Member 'CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap, CallFunc_Map_Find_ReturnValue) == 0x000030, "Member 'CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap, CallFunc_BooleanAND_ReturnValue) == 0x000032, "Member 'CreativeInteraction_MoveObjectsFreely_C_FindActiveBlueprintPreviewFromMap::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function CreativeInteraction_MoveObjectsFreely.CreativeInteraction_MoveObjectsFreely_C.ExecuteUbergraph_CreativeInteraction_MoveObjectsFreely
// 0x0250 (0x0250 - 0x0000)
struct CreativeInteraction_MoveObjectsFreely_C_ExecuteUbergraph_CreativeInteraction_MoveObjectsFreely final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetSelectedActors_SelectedActors;         // 0x0010(0x0010)(ReferenceParm)
	class AActor*                                 K2Node_CustomEvent_Prop_Actor;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_CreativeMoveTool_BlueprintPreviewer_C* K2Node_CustomEvent_Preview_1;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMeshComponent*>                 CallFunc_GetSelectedActorsMeshComponents_Components; // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class AActor*>                         CallFunc_GetSelectedActors_SelectedActors_1;       // 0x0050(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_CreativeMoveTool_BlueprintPreviewer_C* K2Node_CustomEvent_Preview;                        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_CreativeMoveTool_PreviewFX               K2Node_CustomEvent_FX_State;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 K2Node_CustomEvent_Components;                     // 0x0080(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	struct FTransform                             K2Node_CustomEvent_ActorWorldTransform;            // 0x0090(0x0060)(IsPlainOldData, NoDestructor)
	class UMeshComponent*                         CallFunc_Array_Get_Item_1;                         // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindActiveBlueprintPreviewFromMap_Success; // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_CreativeMoveTool_BlueprintPreviewer_C* CallFunc_FindActiveBlueprintPreviewFromMap_BlueprintPreview; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 K2Node_Event_Components;                           // 0x0150(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	struct FOriginalAndSpawnedPair                K2Node_Event_NewlyPlacedActorPair;                 // 0x0160(0x0018)(NoDestructor)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0180(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x01E0(0x0060)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeInteraction_MoveObjectsFreely_C_ExecuteUbergraph_CreativeInteraction_MoveObjectsFreely) == 0x000010, "Wrong alignment on CreativeInteraction_MoveObjectsFreely_C_ExecuteUbergraph_CreativeInteraction_MoveObjectsFreely");
static_assert(sizeof(CreativeInteraction_MoveObjectsFreely_C_ExecuteUbergraph_CreativeInteraction_MoveObjectsFreely) == 0x000250, "Wrong size on CreativeInteraction_MoveObjectsFreely_C_ExecuteUbergraph_CreativeInteraction_MoveObjectsFreely");
static_assert(offsetof(CreativeInteraction_MoveObjectsFreely_C_ExecuteUbergraph_CreativeInteraction_MoveObjectsFreely, EntryPoint) == 0x000000, "Member 'CreativeInteraction_MoveObjectsFreely_C_ExecuteUbergraph_CreativeInteraction_MoveObjectsFreely::EntryPoint' has a wrong offset!");
