#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeInteraction_PossessProp

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function CreativeInteraction_PossessProp.CreativeInteraction_PossessProp_C.IsPossessingProp
// 0x0030 (0x0030 - 0x0000)
struct CreativeInteraction_PossessProp_C_IsPossessingProp final
{
public:
	bool                                          IsProp;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetFortPlayerPawn_Pawn;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponentAthena*      K2Node_DynamicCast_AsFort_Ability_System_Component_Athena; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasActiveAbilityWithAnyMatchingTag_ReturnValue; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeInteraction_PossessProp_C_IsPossessingProp) == 0x000008, "Wrong alignment on CreativeInteraction_PossessProp_C_IsPossessingProp");
static_assert(sizeof(CreativeInteraction_PossessProp_C_IsPossessingProp) == 0x000030, "Wrong size on CreativeInteraction_PossessProp_C_IsPossessingProp");
static_assert(offsetof(CreativeInteraction_PossessProp_C_IsPossessingProp, IsProp) == 0x000000, "Member 'CreativeInteraction_PossessProp_C_IsPossessingProp::IsProp' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_IsPossessingProp, CallFunc_GetFortPlayerPawn_Pawn) == 0x000008, "Member 'CreativeInteraction_PossessProp_C_IsPossessingProp::CallFunc_GetFortPlayerPawn_Pawn' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_IsPossessingProp, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'CreativeInteraction_PossessProp_C_IsPossessingProp::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_IsPossessingProp, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'CreativeInteraction_PossessProp_C_IsPossessingProp::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_IsPossessingProp, K2Node_DynamicCast_AsFort_Ability_System_Component_Athena) == 0x000020, "Member 'CreativeInteraction_PossessProp_C_IsPossessingProp::K2Node_DynamicCast_AsFort_Ability_System_Component_Athena' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_IsPossessingProp, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'CreativeInteraction_PossessProp_C_IsPossessingProp::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_IsPossessingProp, CallFunc_HasActiveAbilityWithAnyMatchingTag_ReturnValue) == 0x000029, "Member 'CreativeInteraction_PossessProp_C_IsPossessingProp::CallFunc_HasActiveAbilityWithAnyMatchingTag_ReturnValue' has a wrong offset!");

// Function CreativeInteraction_PossessProp.CreativeInteraction_PossessProp_C.GetFortPlayerPawn
// 0x0028 (0x0028 - 0x0000)
struct CreativeInteraction_PossessProp_C_GetFortPlayerPawn final
{
public:
	class AFortPlayerPawn*                        Pawn;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  FortPC;                                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetPlayerPawn_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerController_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeInteraction_PossessProp_C_GetFortPlayerPawn) == 0x000008, "Wrong alignment on CreativeInteraction_PossessProp_C_GetFortPlayerPawn");
static_assert(sizeof(CreativeInteraction_PossessProp_C_GetFortPlayerPawn) == 0x000028, "Wrong size on CreativeInteraction_PossessProp_C_GetFortPlayerPawn");
static_assert(offsetof(CreativeInteraction_PossessProp_C_GetFortPlayerPawn, Pawn) == 0x000000, "Member 'CreativeInteraction_PossessProp_C_GetFortPlayerPawn::Pawn' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_GetFortPlayerPawn, FortPC) == 0x000008, "Member 'CreativeInteraction_PossessProp_C_GetFortPlayerPawn::FortPC' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_GetFortPlayerPawn, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'CreativeInteraction_PossessProp_C_GetFortPlayerPawn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_GetFortPlayerPawn, CallFunc_GetPlayerPawn_ReturnValue) == 0x000018, "Member 'CreativeInteraction_PossessProp_C_GetFortPlayerPawn::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_GetFortPlayerPawn, CallFunc_GetFortPlayerController_ReturnValue) == 0x000020, "Member 'CreativeInteraction_PossessProp_C_GetFortPlayerPawn::CallFunc_GetFortPlayerController_ReturnValue' has a wrong offset!");

// Function CreativeInteraction_PossessProp.CreativeInteraction_PossessProp_C.CanInteract
// 0x0078 (0x0078 - 0x0000)
struct CreativeInteraction_PossessProp_C_CanInteract final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortVolumeManager*                     CallFunc_GetVolumeManager_OutVolumeManager;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVolumeValidityResult                         CallFunc_GetVolumeManager_OutIsValid;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPossessingProp_IsProp;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetFortPlayerPawn_Pawn;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortVolume*                            CallFunc_GetVolumeForActor_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortMinigame*                          CallFunc_GetMinigameForVolume_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMinigame_PlayerCreated_C*              K2Node_DynamicCast_AsMinigame_Player_Created;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMinigameExec                             CallFunc_K2_IsInProgress_OutExec;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_63[0x5];                                       // 0x0063(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PropPossessorConfigProp_C*          K2Node_DynamicCast_AsBP_Prop_Possessor_Config_Prop; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanInteract_ReturnValue;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CreativeInteraction_PossessProp_C_CanInteract) == 0x000008, "Wrong alignment on CreativeInteraction_PossessProp_C_CanInteract");
static_assert(sizeof(CreativeInteraction_PossessProp_C_CanInteract) == 0x000078, "Wrong size on CreativeInteraction_PossessProp_C_CanInteract");
static_assert(offsetof(CreativeInteraction_PossessProp_C_CanInteract, ReturnValue) == 0x000000, "Member 'CreativeInteraction_PossessProp_C_CanInteract::ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_CanInteract, CallFunc_GetVolumeManager_OutVolumeManager) == 0x000008, "Member 'CreativeInteraction_PossessProp_C_CanInteract::CallFunc_GetVolumeManager_OutVolumeManager' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_CanInteract, CallFunc_GetVolumeManager_OutIsValid) == 0x000010, "Member 'CreativeInteraction_PossessProp_C_CanInteract::CallFunc_GetVolumeManager_OutIsValid' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_CanInteract, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'CreativeInteraction_PossessProp_C_CanInteract::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_CanInteract, CallFunc_IsPossessingProp_IsProp) == 0x000012, "Member 'CreativeInteraction_PossessProp_C_CanInteract::CallFunc_IsPossessingProp_IsProp' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_CanInteract, CallFunc_GetFortPlayerPawn_Pawn) == 0x000018, "Member 'CreativeInteraction_PossessProp_C_CanInteract::CallFunc_GetFortPlayerPawn_Pawn' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_CanInteract, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'CreativeInteraction_PossessProp_C_CanInteract::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_CanInteract, CallFunc_GetVolumeForActor_ReturnValue) == 0x000028, "Member 'CreativeInteraction_PossessProp_C_CanInteract::CallFunc_GetVolumeForActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_CanInteract, CallFunc_GetMinigameForVolume_ReturnValue) == 0x000030, "Member 'CreativeInteraction_PossessProp_C_CanInteract::CallFunc_GetMinigameForVolume_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_CanInteract, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'CreativeInteraction_PossessProp_C_CanInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_CanInteract, K2Node_DynamicCast_AsMinigame_Player_Created) == 0x000040, "Member 'CreativeInteraction_PossessProp_C_CanInteract::K2Node_DynamicCast_AsMinigame_Player_Created' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_CanInteract, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'CreativeInteraction_PossessProp_C_CanInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_CanInteract, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000050, "Member 'CreativeInteraction_PossessProp_C_CanInteract::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_CanInteract, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000060, "Member 'CreativeInteraction_PossessProp_C_CanInteract::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_CanInteract, CallFunc_K2_IsInProgress_OutExec) == 0x000061, "Member 'CreativeInteraction_PossessProp_C_CanInteract::CallFunc_K2_IsInProgress_OutExec' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_CanInteract, K2Node_SwitchEnum_CmpSuccess_1) == 0x000062, "Member 'CreativeInteraction_PossessProp_C_CanInteract::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_CanInteract, K2Node_DynamicCast_AsBP_Prop_Possessor_Config_Prop) == 0x000068, "Member 'CreativeInteraction_PossessProp_C_CanInteract::K2Node_DynamicCast_AsBP_Prop_Possessor_Config_Prop' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_CanInteract, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'CreativeInteraction_PossessProp_C_CanInteract::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_CanInteract, CallFunc_CanInteract_ReturnValue) == 0x000071, "Member 'CreativeInteraction_PossessProp_C_CanInteract::CallFunc_CanInteract_ReturnValue' has a wrong offset!");
static_assert(offsetof(CreativeInteraction_PossessProp_C_CanInteract, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000072, "Member 'CreativeInteraction_PossessProp_C_CanInteract::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");

}

