#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeToolLayerAnimBP

#include "Basic.hpp"

#include "CreativeToolLayerAnimBP_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass CreativeToolLayerAnimBP.CreativeToolLayerAnimBP_C
// 0x15F0 (0x1AA0 - 0x04B0)
class UCreativeToolLayerAnimBP_C final : public UFortItemLayerAnimInstance_FullLocomotion
{
public:
	uint8                                         Pad_4A8[0x8];                                      // 0x04A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct CreativeToolLayerAnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x04B8(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04C8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04D0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_34;                             // 0x04D8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_17;                  // 0x04F8(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_33;                             // 0x05B8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_16;                  // 0x05D8(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_32;                             // 0x0698(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x06B8(0x00C0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x0778(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_31;                             // 0x0838(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x0858(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_30;                             // 0x0918(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_29;                             // 0x0938(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_28;                             // 0x0958(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_27;                             // 0x0978(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_26;                             // 0x0998(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_25;                             // 0x09B8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x09D8(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_24;                             // 0x0A98(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x0AB8(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_23;                             // 0x0B78(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x0B98(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_22;                             // 0x0C58(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_21;                             // 0x0C78(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_20;                             // 0x0C98(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0CB8(0x0040)()
	struct FAnimNode_Root                         AnimGraphNode_Root_19;                             // 0x0CF8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0D18(0x0040)()
	struct FAnimNode_Root                         AnimGraphNode_Root_18;                             // 0x0D58(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0D78(0x0040)()
	struct FAnimNode_Root                         AnimGraphNode_Root_17;                             // 0x0DB8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0DD8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0E20(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0E60(0x0040)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x0EA0(0x00C0)()
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x0F60(0x0010)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0F70(0x0040)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0FB0(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_16;                             // 0x0FF8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_15;                             // 0x1018(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1038(0x0040)()
	struct FAnimNode_Root                         AnimGraphNode_Root_14;                             // 0x1078(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_13;                             // 0x1098(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_12;                             // 0x10B8(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_11;                             // 0x10D8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x10F8(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_10;                             // 0x11B8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x11D8(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x1298(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x12B8(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x1378(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x1398(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x1458(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x1478(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x1538(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x1558(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x1618(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x1638(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x16F8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x1718(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x17D8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x17F8(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x18B8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x18D8(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1998(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x19B8(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1A78(0x0020)()
	EFortWeaponCoreAnimation                      WeaponCoreAnim;                                    // 0x1A98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ItemZipLineStartAdditive(struct FPoseLink* ItemZipLineStartAdditive_0);
	void ItemUpperBody(const struct FPoseLink& InPoseUpperBody, const struct FFortAnimInput_AdjustedAim& InputParam, struct FPoseLink* ItemUpperBody_0);
	void ItemSwimJumpSurfaceLoop(struct FPoseLink* ItemSwimJumpSurfaceLoop_0);
	void ItemSwimJumpSurfaceEnd(struct FPoseLink* ItemSwimJumpSurfaceEnd_0);
	void ItemSwimJumpStartLoop(struct FPoseLink* ItemSwimJumpStartLoop_0);
	void ItemSwimJumpStart(struct FPoseLink* ItemSwimJumpStart_0);
	void ItemSwimJumpFallLoop(struct FPoseLink* ItemSwimJumpFallLoop_0);
	void ItemSlopeSliding(struct FPoseLink* ItemSlopeSliding_0);
	void ItemSkeletalControl(const struct FPoseLink& InPose, struct FPoseLink* ItemSkeletalControl_0);
	void ItemRelaxedEntry(const struct FPoseLink& InPoseRelaxedEntry, struct FPoseLink* ItemRelaxedEntry_0);
	void ItemPreIK(const struct FPoseLink& InPose_PreIK, struct FPoseLink* ItemPreIK_0);
	void ItemLowerBodyMovement(const struct FPoseLink& InPoseLowerBodyMovement, struct FPoseLink* ItemLowerBodyMovement_0);
	void ItemLowerBodyLeanAdditive(const struct FPoseLink& InPoseLowerBodyLeanAdditive, struct FPoseLink* ItemLowerBodyLeanAdditive_0);
	void ItemLowerBodyJogStop(const struct FPoseLink& InPoseLowerBodyJogStop, struct FPoseLink* ItemLowerBodyJogStop_0);
	void ItemLowerBodyJogStart(const struct FPoseLink& InPoseLowerBodyJogStart, struct FPoseLink* ItemLowerBodyJogStart_0);
	void ItemLowerBodyJogPrePivot(const struct FPoseLink& InPoseLowerBodyJogPrePivot, struct FPoseLink* ItemLowerBodyJogPrePivot_0);
	void ItemLowerBodyJogPostPivot(const struct FPoseLink& InPoseLowerBodyJogPostPivot, struct FPoseLink* ItemLowerBodyJogPostPivot_0);
	void ItemJumpUpAdditive(struct FPoseLink* ItemJumpUpAdditive_0);
	void ItemJumpLoopAdditive(struct FPoseLink* ItemJumpLoopAdditive_0);
	void ItemJogStopAdditive(const struct FPoseLink& InPoseJogStopAdditive, struct FPoseLink* ItemJogStopAdditive_0);
	void ItemJogStartAdditive(const struct FPoseLink& InPoseJogStartAdditive, struct FPoseLink* ItemJogStartAdditive_0);
	void ItemJogPrePivotAdditive(const struct FPoseLink& InPosePrePivotAdditive, struct FPoseLink* ItemJogPrePivotAdditive_0);
	void ItemJogPostPivotAdditive(const struct FPoseLink& InPosePostPivotAdditive, struct FPoseLink* ItemJogPostPivotAdditive_0);
	void ItemJetPackStartAdditive(struct FPoseLink* ItemJetPackStartAdditive_0);
	void ItemJetPackJumpAdditive(struct FPoseLink* ItemJetPackJumpAdditive_0);
	void ItemIdleAdditive(const struct FPoseLink& InPoseIdleAdditive, struct FPoseLink* ItemIdleAdditive_0);
	void ItemFullBodySprint(const struct FPoseLink& InPoseSprint, struct FPoseLink* ItemFullBodySprint_0);
	void ItemFullBodyOverride(const struct FPoseLink& InPoseFullBody, struct FPoseLink* ItemFullBodyOverride_0);
	void ItemFlyModeStartAdditive(struct FPoseLink* ItemFlyModeStartAdditive_0);
	void ItemFlyModeLoopAdditive(struct FPoseLink* ItemFlyModeLoopAdditive_0);
	void ItemFallLandAdditive(struct FPoseLink* ItemFallLandAdditive_0);
	void ItemFallAdditive(struct FPoseLink* ItemFallAdditive_0);
	void ItemCrouchTurningAdditive(struct FPoseLink* ItemCrouchTurningAdditive_0);
	void ItemAimOffset(const struct FPoseLink& InPose_AimOffset, float AimOffsetAlpha, float Yaw, float Pitch, const struct FPoseLink& InPose_UpperLowerPreMeleeAO, struct FPoseLink* ItemAimOffset_0);
	void ExecuteUbergraph_CreativeToolLayerAnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreativeToolLayerAnimBP_C">();
	}
	static class UCreativeToolLayerAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeToolLayerAnimBP_C>();
	}
};
static_assert(alignof(UCreativeToolLayerAnimBP_C) == 0x000010, "Wrong alignment on UCreativeToolLayerAnimBP_C");
static_assert(sizeof(UCreativeToolLayerAnimBP_C) == 0x001AA0, "Wrong size on UCreativeToolLayerAnimBP_C");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, UberGraphFrame) == 0x0004B0, "Member 'UCreativeToolLayerAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, __AnimBlueprintMutables) == 0x0004B8, "Member 'UCreativeToolLayerAnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x0004C8, "Member 'UCreativeToolLayerAnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimBlueprintExtension_Base) == 0x0004D0, "Member 'UCreativeToolLayerAnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_34) == 0x0004D8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_34' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_LinkedInputPose_17) == 0x0004F8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_LinkedInputPose_17' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_33) == 0x0005B8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_33' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_LinkedInputPose_16) == 0x0005D8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_LinkedInputPose_16' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_32) == 0x000698, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_32' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_LinkedInputPose_15) == 0x0006B8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_LinkedInputPose_15' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_LinkedInputPose_14) == 0x000778, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_LinkedInputPose_14' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_31) == 0x000838, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_31' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_LinkedInputPose_13) == 0x000858, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_LinkedInputPose_13' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_30) == 0x000918, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_30' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_29) == 0x000938, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_29' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_28) == 0x000958, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_28' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_27) == 0x000978, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_27' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_26) == 0x000998, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_26' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_25) == 0x0009B8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_25' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_LinkedInputPose_12) == 0x0009D8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_LinkedInputPose_12' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_24) == 0x000A98, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_24' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_LinkedInputPose_11) == 0x000AB8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_LinkedInputPose_11' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_23) == 0x000B78, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_23' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_LinkedInputPose_10) == 0x000B98, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_LinkedInputPose_10' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_22) == 0x000C58, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_22' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_21) == 0x000C78, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_21' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_20) == 0x000C98, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_20' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x000CB8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_19) == 0x000CF8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_19' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x000D18, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_18) == 0x000D58, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_18' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x000D78, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_17) == 0x000DB8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_17' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x000DD8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x000E20, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x000E60, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_TwoWayBlend) == 0x000EA0, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_TwoWayBlend' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_IdentityPose) == 0x000F60, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_IdentityPose' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x000F70, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_BlendListByBool) == 0x000FB0, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_16) == 0x000FF8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_16' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_15) == 0x001018, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_15' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_SequencePlayer) == 0x001038, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_14) == 0x001078, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_14' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_13) == 0x001098, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_13' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_12) == 0x0010B8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_12' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_11) == 0x0010D8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_11' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_LinkedInputPose_9) == 0x0010F8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_LinkedInputPose_9' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_10) == 0x0011B8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_10' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_LinkedInputPose_8) == 0x0011D8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_LinkedInputPose_8' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_9) == 0x001298, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_9' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_LinkedInputPose_7) == 0x0012B8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_LinkedInputPose_7' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_8) == 0x001378, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_8' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_LinkedInputPose_6) == 0x001398, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_LinkedInputPose_6' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_7) == 0x001458, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_7' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_LinkedInputPose_5) == 0x001478, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_LinkedInputPose_5' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_6) == 0x001538, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_6' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_LinkedInputPose_4) == 0x001558, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_LinkedInputPose_4' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_5) == 0x001618, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_5' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_LinkedInputPose_3) == 0x001638, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_LinkedInputPose_3' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_4) == 0x0016F8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_4' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_LinkedInputPose_2) == 0x001718, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_LinkedInputPose_2' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_3) == 0x0017D8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_3' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_LinkedInputPose_1) == 0x0017F8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_2) == 0x0018B8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_LinkedInputPose) == 0x0018D8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root_1) == 0x001998, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_SubInput) == 0x0019B8, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, AnimGraphNode_Root) == 0x001A78, "Member 'UCreativeToolLayerAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UCreativeToolLayerAnimBP_C, WeaponCoreAnim) == 0x001A98, "Member 'UCreativeToolLayerAnimBP_C::WeaponCoreAnim' has a wrong offset!");

}

