#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_Med_Soldier_01_Skeleton_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct F_Med_Soldier_01_Skeleton_AnimBP.F_Med_Soldier_01_Skeleton_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0000 (0x0001 - 0x0001)
struct F_Med_Soldier_01_Skeleton_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
};
static_assert(alignof(F_Med_Soldier_01_Skeleton_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on F_Med_Soldier_01_Skeleton_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(F_Med_Soldier_01_Skeleton_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong size on F_Med_Soldier_01_Skeleton_AnimBP::FAnimBlueprintGeneratedMutableData");

// ScriptStruct F_Med_Soldier_01_Skeleton_AnimBP.F_Med_Soldier_01_Skeleton_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00BF (0x00C0 - 0x0001)
struct F_Med_Soldier_01_Skeleton_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_25;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_26;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_27;                               // 0x0010(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0028(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00A8(0x0018)()
};
static_assert(alignof(F_Med_Soldier_01_Skeleton_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on F_Med_Soldier_01_Skeleton_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(F_Med_Soldier_01_Skeleton_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0000C0, "Wrong size on F_Med_Soldier_01_Skeleton_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(F_Med_Soldier_01_Skeleton_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_25) == 0x000004, "Member 'F_Med_Soldier_01_Skeleton_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_25' has a wrong offset!");
static_assert(offsetof(F_Med_Soldier_01_Skeleton_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_26) == 0x000008, "Member 'F_Med_Soldier_01_Skeleton_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_26' has a wrong offset!");
static_assert(offsetof(F_Med_Soldier_01_Skeleton_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_27) == 0x000010, "Member 'F_Med_Soldier_01_Skeleton_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_27' has a wrong offset!");
static_assert(offsetof(F_Med_Soldier_01_Skeleton_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000028, "Member 'F_Med_Soldier_01_Skeleton_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(F_Med_Soldier_01_Skeleton_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000A8, "Member 'F_Med_Soldier_01_Skeleton_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

