#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_ASN_Sarah_Head_01_Dyn_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct F_MED_ASN_Sarah_Head_01_Dyn_AnimBP.F_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00E7 (0x00E8 - 0x0001)
struct F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_25;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_26;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_27;                                 // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_28;                                   // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_29;                                 // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_30;                                 // 0x0021(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_31;                                 // 0x0022(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_32;                                // 0x0028(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_33;                               // 0x0038(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0050(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00D0(0x0018)()
};
static_assert(alignof(F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0000E8, "Wrong size on F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_25) == 0x000004, "Member 'F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_25' has a wrong offset!");
static_assert(offsetof(F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_26) == 0x000008, "Member 'F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_26' has a wrong offset!");
static_assert(offsetof(F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_27) == 0x000010, "Member 'F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_27' has a wrong offset!");
static_assert(offsetof(F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_28) == 0x000018, "Member 'F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_28' has a wrong offset!");
static_assert(offsetof(F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_29) == 0x000020, "Member 'F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_29' has a wrong offset!");
static_assert(offsetof(F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_30) == 0x000021, "Member 'F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_30' has a wrong offset!");
static_assert(offsetof(F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_31) == 0x000022, "Member 'F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_31' has a wrong offset!");
static_assert(offsetof(F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_32) == 0x000028, "Member 'F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_32' has a wrong offset!");
static_assert(offsetof(F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_33) == 0x000038, "Member 'F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_33' has a wrong offset!");
static_assert(offsetof(F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000050, "Member 'F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000D0, "Member 'F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct F_MED_ASN_Sarah_Head_01_Dyn_AnimBP.F_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'F_MED_ASN_Sarah_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

