#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_DuckHero_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_DuckHero_FaceAcc_AnimBP.F_MED_DuckHero_FaceAcc_AnimBP_C
// 0x0B80 (0x1210 - 0x0690)
class UF_MED_DuckHero_FaceAcc_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0698(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x06C8(0x0180)(ContainsInstancedReference)
	uint8                                         Pad_848[0x8];                                      // 0x0848(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0850(0x0980)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x11D0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x11F0(0x0020)()

public:
	void ExecuteUbergraph_F_MED_DuckHero_FaceAcc_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_DuckHero_FaceAcc_AnimBP_C">();
	}
	static class UF_MED_DuckHero_FaceAcc_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_DuckHero_FaceAcc_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_DuckHero_FaceAcc_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_DuckHero_FaceAcc_AnimBP_C");
static_assert(sizeof(UF_MED_DuckHero_FaceAcc_AnimBP_C) == 0x001210, "Wrong size on UF_MED_DuckHero_FaceAcc_AnimBP_C");
static_assert(offsetof(UF_MED_DuckHero_FaceAcc_AnimBP_C, UberGraphFrame) == 0x000690, "Member 'UF_MED_DuckHero_FaceAcc_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_DuckHero_FaceAcc_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000698, "Member 'UF_MED_DuckHero_FaceAcc_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_DuckHero_FaceAcc_AnimBP_C, AnimBlueprintExtension_Base) == 0x0006A0, "Member 'UF_MED_DuckHero_FaceAcc_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_DuckHero_FaceAcc_AnimBP_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UF_MED_DuckHero_FaceAcc_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_DuckHero_FaceAcc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0006C8, "Member 'UF_MED_DuckHero_FaceAcc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_DuckHero_FaceAcc_AnimBP_C, AnimGraphNode_RigidBody) == 0x000850, "Member 'UF_MED_DuckHero_FaceAcc_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_DuckHero_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0011D0, "Member 'UF_MED_DuckHero_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_DuckHero_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0011F0, "Member 'UF_MED_DuckHero_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");

}

