#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP.F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0004 (0x0005 - 0x0001)
struct F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_1;                                  // 0x0003(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_2;                                  // 0x0004(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000005, "Wrong size on F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");
static_assert(offsetof(F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_1) == 0x000003, "Member 'F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_1' has a wrong offset!");
static_assert(offsetof(F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty_2) == 0x000004, "Member 'F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty_2' has a wrong offset!");

// ScriptStruct F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP.F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00F7 (0x00F8 - 0x0001)
struct F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_129;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_130;                                // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_131;                               // 0x0010(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_132;                                // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_133;                                  // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_134;                                // 0x0030(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_135;                                // 0x0031(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_136;                                // 0x0032(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_137;                               // 0x0038(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_138;                              // 0x0048(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0060(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00E0(0x0018)()
};
static_assert(alignof(F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0000F8, "Wrong size on F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_129) == 0x000004, "Member 'F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_129' has a wrong offset!");
static_assert(offsetof(F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_130) == 0x000008, "Member 'F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_130' has a wrong offset!");
static_assert(offsetof(F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_131) == 0x000010, "Member 'F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_131' has a wrong offset!");
static_assert(offsetof(F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_132) == 0x000020, "Member 'F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_132' has a wrong offset!");
static_assert(offsetof(F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_133) == 0x000028, "Member 'F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_133' has a wrong offset!");
static_assert(offsetof(F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_134) == 0x000030, "Member 'F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_134' has a wrong offset!");
static_assert(offsetof(F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_135) == 0x000031, "Member 'F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_135' has a wrong offset!");
static_assert(offsetof(F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_136) == 0x000032, "Member 'F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_136' has a wrong offset!");
static_assert(offsetof(F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_137) == 0x000038, "Member 'F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_137' has a wrong offset!");
static_assert(offsetof(F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_138) == 0x000048, "Member 'F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_138' has a wrong offset!");
static_assert(offsetof(F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000060, "Member 'F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000E0, "Member 'F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

