#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_COD_Squad_Plaid_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_COD_Squad_Plaid_AnimBP.F_MED_COD_Squad_Plaid_AnimBP_C
// 0x4870 (0x4F00 - 0x0690)
class UF_MED_COD_Squad_Plaid_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0698(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A0(0x0008)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x06A8(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x07B0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x07D0(0x0020)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x07F0(0x0980)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_10;                     // 0x1170(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_9;                      // 0x1680(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8;                      // 0x1B90(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x20A0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x25B0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x2AC0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x2FD0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x34E0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x39F0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x3F00(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x4410(0x0510)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x4920(0x0180)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x4AA0(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x4AC0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x4BC8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x4CD0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x4DD8(0x0108)()
	class USkeletalMeshComponent*                 skeletal_mesh;                                     // 0x4EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         thigh_rot_l;                                       // 0x4EE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         thigh_rot_r;                                       // 0x4EEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         calf_rot_l;                                        // 0x4EF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         calf_rot_r;                                        // 0x4EF4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_F_MED_COD_Squad_Plaid_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_COD_Squad_Plaid_AnimBP_C">();
	}
	static class UF_MED_COD_Squad_Plaid_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_COD_Squad_Plaid_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_COD_Squad_Plaid_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_COD_Squad_Plaid_AnimBP_C");
static_assert(sizeof(UF_MED_COD_Squad_Plaid_AnimBP_C) == 0x004F00, "Wrong size on UF_MED_COD_Squad_Plaid_AnimBP_C");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, UberGraphFrame) == 0x000690, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000698, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimBlueprintExtension_Base) == 0x0006A0, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_Constraint_4) == 0x0006A8, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_Constraint_4' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0007B0, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0007D0, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_RigidBody) == 0x0007F0, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_AnimDynamics_10) == 0x001170, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_AnimDynamics_10' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_AnimDynamics_9) == 0x001680, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_AnimDynamics_9' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_AnimDynamics_8) == 0x001B90, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_AnimDynamics_8' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_AnimDynamics_7) == 0x0020A0, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_AnimDynamics_6) == 0x0025B0, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_AnimDynamics_5) == 0x002AC0, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x002FD0, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x0034E0, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x0039F0, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x003F00, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x004410, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x004920, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_Root) == 0x004AA0, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_Constraint_3) == 0x004AC0, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_Constraint_2) == 0x004BC8, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_Constraint_1) == 0x004CD0, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, AnimGraphNode_Constraint) == 0x004DD8, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, skeletal_mesh) == 0x004EE0, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::skeletal_mesh' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, thigh_rot_l) == 0x004EE8, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::thigh_rot_l' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, thigh_rot_r) == 0x004EEC, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::thigh_rot_r' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, calf_rot_l) == 0x004EF0, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::calf_rot_l' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_AnimBP_C, calf_rot_r) == 0x004EF4, "Member 'UF_MED_COD_Squad_Plaid_AnimBP_C::calf_rot_r' has a wrong offset!");

}

