#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Binary_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ControlRig_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Binary_FaceAcc_AnimBP.F_MED_Binary_FaceAcc_AnimBP_C
// 0x41F0 (0x4880 - 0x0690)
class UF_MED_Binary_FaceAcc_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0698(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x06C8(0x0458)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x0B20(0x0510)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1030(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x1050(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x1560(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x1A70(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x1F80(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x2490(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x29A0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x2EB0(0x0510)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x33C0(0x0980)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x3D40(0x0020)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x3D60(0x0980)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x46E0(0x0180)(ContainsInstancedReference)
	class USkeletalMeshComponent*                 Body_Mesh;                                         // 0x4860(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 skel_mesh;                                         // 0x4868(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Upperarm_r_Physics_Alpha;                          // 0x4870(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Upperarm_l_Physics_Alpha;                          // 0x4874(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_F_MED_Binary_FaceAcc_AnimBP(int32 EntryPoint);
	void OnCharacterCustomizationLoaded();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Binary_FaceAcc_AnimBP_C">();
	}
	static class UF_MED_Binary_FaceAcc_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Binary_FaceAcc_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_Binary_FaceAcc_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_Binary_FaceAcc_AnimBP_C");
static_assert(sizeof(UF_MED_Binary_FaceAcc_AnimBP_C) == 0x004880, "Wrong size on UF_MED_Binary_FaceAcc_AnimBP_C");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, UberGraphFrame) == 0x000690, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000698, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, AnimBlueprintExtension_Base) == 0x0006A0, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, AnimGraphNode_ControlRig) == 0x0006C8, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_7) == 0x000B20, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x001030, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_6) == 0x001050, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_5) == 0x001560, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x001A70, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x001F80, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x002490, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x0029A0, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x002EB0, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, AnimGraphNode_RigidBody_1) == 0x0033C0, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x003D40, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, AnimGraphNode_RigidBody) == 0x003D60, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0046E0, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, Body_Mesh) == 0x004860, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::Body_Mesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, skel_mesh) == 0x004868, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::skel_mesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, Upperarm_r_Physics_Alpha) == 0x004870, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::Upperarm_r_Physics_Alpha' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_FaceAcc_AnimBP_C, Upperarm_l_Physics_Alpha) == 0x004874, "Member 'UF_MED_Binary_FaceAcc_AnimBP_C::Upperarm_l_Physics_Alpha' has a wrong offset!");

}

