#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Meteorwomen_Head_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Meteorwomen_Head_AnimBP.F_MED_Meteorwomen_Head_AnimBP_C
// 0x1B50 (0x21E0 - 0x0690)
class UF_MED_Meteorwomen_Head_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0698(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A0(0x0008)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x06A8(0x0180)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0828(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0848(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0868(0x0020)()
	uint8                                         Pad_888[0x8];                                      // 0x0888(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x0890(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x0DA0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x12B0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x17C0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x1CD0(0x0510)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_F_MED_Meteorwomen_Head_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Meteorwomen_Head_AnimBP_C">();
	}
	static class UF_MED_Meteorwomen_Head_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Meteorwomen_Head_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_Meteorwomen_Head_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_Meteorwomen_Head_AnimBP_C");
static_assert(sizeof(UF_MED_Meteorwomen_Head_AnimBP_C) == 0x0021E0, "Wrong size on UF_MED_Meteorwomen_Head_AnimBP_C");
static_assert(offsetof(UF_MED_Meteorwomen_Head_AnimBP_C, UberGraphFrame) == 0x000690, "Member 'UF_MED_Meteorwomen_Head_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Meteorwomen_Head_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000698, "Member 'UF_MED_Meteorwomen_Head_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_Meteorwomen_Head_AnimBP_C, AnimBlueprintExtension_Base) == 0x0006A0, "Member 'UF_MED_Meteorwomen_Head_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_Meteorwomen_Head_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0006A8, "Member 'UF_MED_Meteorwomen_Head_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Meteorwomen_Head_AnimBP_C, AnimGraphNode_Root) == 0x000828, "Member 'UF_MED_Meteorwomen_Head_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Meteorwomen_Head_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000848, "Member 'UF_MED_Meteorwomen_Head_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Meteorwomen_Head_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000868, "Member 'UF_MED_Meteorwomen_Head_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Meteorwomen_Head_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x000890, "Member 'UF_MED_Meteorwomen_Head_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Meteorwomen_Head_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x000DA0, "Member 'UF_MED_Meteorwomen_Head_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Meteorwomen_Head_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x0012B0, "Member 'UF_MED_Meteorwomen_Head_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Meteorwomen_Head_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x0017C0, "Member 'UF_MED_Meteorwomen_Head_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Meteorwomen_Head_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x001CD0, "Member 'UF_MED_Meteorwomen_Head_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");

}

