#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Aztec_Body_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "F_MED_Aztec_Body_AnimBP_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Aztec_Body_AnimBP.F_MED_Aztec_Body_AnimBP_C
// 0x06F0 (0x0D80 - 0x0690)
class UF_MED_Aztec_Body_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct F_MED_Aztec_Body_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0698(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_69A[0x6];                                      // 0x069A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x06A0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06B0(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x06D0(0x0180)(ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0850(0x0100)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0950(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0998(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x09C0(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0AA0(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0AC8(0x0128)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0BF0(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0C18(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0C38(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0C58(0x0128)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_F_MED_Aztec_Body_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Aztec_Body_AnimBP_C">();
	}
	static class UF_MED_Aztec_Body_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Aztec_Body_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_Aztec_Body_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_Aztec_Body_AnimBP_C");
static_assert(sizeof(UF_MED_Aztec_Body_AnimBP_C) == 0x000D80, "Wrong size on UF_MED_Aztec_Body_AnimBP_C");
static_assert(offsetof(UF_MED_Aztec_Body_AnimBP_C, UberGraphFrame) == 0x000690, "Member 'UF_MED_Aztec_Body_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Body_AnimBP_C, __AnimBlueprintMutables) == 0x000698, "Member 'UF_MED_Aztec_Body_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Body_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x0006A0, "Member 'UF_MED_Aztec_Body_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Body_AnimBP_C, AnimBlueprintExtension_Base) == 0x0006A8, "Member 'UF_MED_Aztec_Body_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Body_AnimBP_C, AnimGraphNode_Root) == 0x0006B0, "Member 'UF_MED_Aztec_Body_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Body_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0006D0, "Member 'UF_MED_Aztec_Body_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Body_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x000850, "Member 'UF_MED_Aztec_Body_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Body_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x000950, "Member 'UF_MED_Aztec_Body_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Body_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x000998, "Member 'UF_MED_Aztec_Body_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Body_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x0009C0, "Member 'UF_MED_Aztec_Body_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Body_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x000AA0, "Member 'UF_MED_Aztec_Body_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Body_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x000AC8, "Member 'UF_MED_Aztec_Body_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Body_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x000BF0, "Member 'UF_MED_Aztec_Body_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Body_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000C18, "Member 'UF_MED_Aztec_Body_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Body_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000C38, "Member 'UF_MED_Aztec_Body_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Body_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000C58, "Member 'UF_MED_Aztec_Body_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");

}

