#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_COD_Squad_Plaid_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "F_MED_COD_Squad_Plaid_FaceAcc_AnimBP_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ControlRig_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_COD_Squad_Plaid_FaceAcc_AnimBP.F_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C
// 0x25C0 (0x2C50 - 0x0690)
class UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct F_MED_COD_Squad_Plaid_FaceAcc_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0698(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_69A[0x6];                                      // 0x069A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x06A0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A8(0x0008)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x06B0(0x0180)(ContainsInstancedReference)
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0830(0x0980)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x11B0(0x0458)()
	uint8                                         Pad_1608[0x8];                                     // 0x1608(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x1610(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x1B20(0x0510)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x2030(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x2050(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2070(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x2090(0x0510)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x25A0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x26C8(0x0128)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x27F0(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x28F8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x2918(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x2938(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2A60(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x2A80(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2AA8(0x0100)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x2BA8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2BF0(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2C18(0x0020)()
	class USkeletalMeshComponent*                 Mesh_To_Copy;                                      // 0x2C38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Skydiving;                                         // 0x2C40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         targeting_alpha;                                   // 0x2C44(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_F_MED_COD_Squad_Plaid_FaceAcc_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C">();
	}
	static class UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C");
static_assert(sizeof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C) == 0x002C50, "Wrong size on UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, UberGraphFrame) == 0x000690, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, __AnimBlueprintMutables) == 0x000698, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x0006A0, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimBlueprintExtension_Base) == 0x0006A8, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0006B0, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_RigidBody) == 0x000830, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_ControlRig) == 0x0011B0, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x001610, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x001B20, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x002030, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace_2) == 0x002050, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_Root) == 0x002070, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x002090, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x0025A0, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x0026C8, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_Constraint) == 0x0027F0, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x0028F8, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x002918, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone) == 0x002938, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x002A60, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x002A80, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x002AA8, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x002BA8, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x002BF0, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x002C18, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, Mesh_To_Copy) == 0x002C38, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::Mesh_To_Copy' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, Skydiving) == 0x002C40, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::Skydiving' has a wrong offset!");
static_assert(offsetof(UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C, targeting_alpha) == 0x002C44, "Member 'UF_MED_COD_Squad_Plaid_FaceAcc_AnimBP_C::targeting_alpha' has a wrong offset!");

}

