#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Binary_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ControlRig_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Binary_AnimBP.F_MED_Binary_AnimBP_C
// 0x3860 (0x3EF0 - 0x0690)
class UF_MED_Binary_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0698(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x06C8(0x0180)(ContainsInstancedReference)
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x0848(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0950(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x0970(0x0510)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x0E80(0x0108)()
	uint8                                         Pad_F88[0x8];                                      // 0x0F88(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x0F90(0x0510)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x14A0(0x0108)()
	uint8                                         Pad_15A8[0x8];                                     // 0x15A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x15B0(0x0510)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x1AC0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x1BC8(0x0108)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x1CD0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x21E0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x26F0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x2C00(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x3110(0x0510)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0x3620(0x0458)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x3A78(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x3A98(0x0458)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_F_MED_Binary_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Binary_AnimBP_C">();
	}
	static class UF_MED_Binary_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Binary_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_Binary_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_Binary_AnimBP_C");
static_assert(sizeof(UF_MED_Binary_AnimBP_C) == 0x003EF0, "Wrong size on UF_MED_Binary_AnimBP_C");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, UberGraphFrame) == 0x000690, "Member 'UF_MED_Binary_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000698, "Member 'UF_MED_Binary_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimBlueprintExtension_Base) == 0x0006A0, "Member 'UF_MED_Binary_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UF_MED_Binary_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0006C8, "Member 'UF_MED_Binary_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimGraphNode_Constraint_4) == 0x000848, "Member 'UF_MED_Binary_AnimBP_C::AnimGraphNode_Constraint_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000950, "Member 'UF_MED_Binary_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimGraphNode_AnimDynamics_7) == 0x000970, "Member 'UF_MED_Binary_AnimBP_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimGraphNode_Constraint_3) == 0x000E80, "Member 'UF_MED_Binary_AnimBP_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimGraphNode_AnimDynamics_6) == 0x000F90, "Member 'UF_MED_Binary_AnimBP_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimGraphNode_Constraint_2) == 0x0014A0, "Member 'UF_MED_Binary_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimGraphNode_AnimDynamics_5) == 0x0015B0, "Member 'UF_MED_Binary_AnimBP_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimGraphNode_Constraint_1) == 0x001AC0, "Member 'UF_MED_Binary_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimGraphNode_Constraint) == 0x001BC8, "Member 'UF_MED_Binary_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x001CD0, "Member 'UF_MED_Binary_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x0021E0, "Member 'UF_MED_Binary_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x0026F0, "Member 'UF_MED_Binary_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x002C00, "Member 'UF_MED_Binary_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x003110, "Member 'UF_MED_Binary_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimGraphNode_ControlRig_1) == 0x003620, "Member 'UF_MED_Binary_AnimBP_C::AnimGraphNode_ControlRig_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x003A78, "Member 'UF_MED_Binary_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Binary_AnimBP_C, AnimGraphNode_ControlRig) == 0x003A98, "Member 'UF_MED_Binary_AnimBP_C::AnimGraphNode_ControlRig' has a wrong offset!");

}

