#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Island_Nomad_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct F_MED_Island_Nomad_FaceAcc_AnimBP.F_MED_Island_Nomad_FaceAcc_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

// ScriptStruct F_MED_Island_Nomad_FaceAcc_AnimBP.F_MED_Island_Nomad_FaceAcc_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00E7 (0x00E8 - 0x0001)
struct F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_109;                                // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_110;                                  // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_111;                                // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_112;                                // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_113;                                // 0x001A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_114;                               // 0x0020(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_115;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_116;                                // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_117;                              // 0x0038(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0050(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00D0(0x0018)()
};
static_assert(alignof(F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0000E8, "Wrong size on F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_109) == 0x000008, "Member 'F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_109' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_110) == 0x000010, "Member 'F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_110' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_111) == 0x000018, "Member 'F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_111' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_112) == 0x000019, "Member 'F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_112' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_113) == 0x00001A, "Member 'F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_113' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_114) == 0x000020, "Member 'F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_114' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_115) == 0x000030, "Member 'F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_115' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_116) == 0x000034, "Member 'F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_116' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_117) == 0x000038, "Member 'F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_117' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000050, "Member 'F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000D0, "Member 'F_MED_Island_Nomad_FaceAcc_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

