#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Aztec_Face_Acc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function F_MED_Aztec_Face_Acc_AnimBP.F_MED_Aztec_Face_Acc_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct F_MED_Aztec_Face_Acc_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(F_MED_Aztec_Face_Acc_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on F_MED_Aztec_Face_Acc_AnimBP_C_AnimGraph");
static_assert(sizeof(F_MED_Aztec_Face_Acc_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on F_MED_Aztec_Face_Acc_AnimBP_C_AnimGraph");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function F_MED_Aztec_Face_Acc_AnimBP.F_MED_Aztec_Face_Acc_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct F_MED_Aztec_Face_Acc_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Aztec_Face_Acc_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on F_MED_Aztec_Face_Acc_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(F_MED_Aztec_Face_Acc_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on F_MED_Aztec_Face_Acc_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function F_MED_Aztec_Face_Acc_AnimBP.F_MED_Aztec_Face_Acc_AnimBP_C.ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP
// 0x01B0 (0x01B0 - 0x0000)
struct F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SelectVector_ReturnValue_1;               // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_DirectionBetweenSockets_ReturnValue;   // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1; // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetDeltaTransformFromRefPose_ReturnValue; // 0x00E0(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_2;            // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP) == 0x000010, "Wrong alignment on F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP");
static_assert(sizeof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP) == 0x0001B0, "Wrong size on F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, EntryPoint) == 0x000000, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_SelectFloat_ReturnValue) == 0x000004, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_SelectVector_ReturnValue) == 0x000008, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_SelectVector_ReturnValue_1) == 0x000020, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_SelectVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, K2Node_Event_DeltaTimeX) == 0x000038, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x000040, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_K2_DirectionBetweenSockets_ReturnValue) == 0x000048, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_K2_DirectionBetweenSockets_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000060, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000078, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_Add_VectorVector_ReturnValue) == 0x000090, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x0000A8, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000C0, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1) == 0x0000D8, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_GetDeltaTransformFromRefPose_ReturnValue) == 0x0000E0, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_GetDeltaTransformFromRefPose_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_BreakTransform_Location) == 0x000140, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_BreakTransform_Rotation) == 0x000158, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_BreakTransform_Scale) == 0x000170, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_BreakRotator_Roll) == 0x000188, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_BreakRotator_Pitch) == 0x00018C, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_BreakRotator_Yaw) == 0x000190, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_MapRangeClamped_ReturnValue) == 0x000194, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000198, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_SelectFloat_ReturnValue_1) == 0x00019C, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_MapRangeClamped_ReturnValue_2) == 0x0001A0, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP, CallFunc_SelectFloat_ReturnValue_2) == 0x0001A4, "Member 'F_MED_Aztec_Face_Acc_AnimBP_C_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");

}

