#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Island_Nomad_Deform_CtrlRig_sculpters

#include "Basic.hpp"

#include "RigVM_classes.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimationCore_structs.hpp"


namespace SDK
{

// RigVMMemoryStorageGeneratorClass F_MED_Island_Nomad_Deform_CtrlRig_sculpters.RigVMMemory_Work
// 0x19F8 (0x1A20 - 0x0028)
class F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FControlRigExecuteContext              ExecuteContext_;                                   // 0x0030(0x0070)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionFromEuler_Result;                    // 0x00A0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_2_4_2_Result;                        // 0x00C0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_4_2_4_Result;                // 0x00D8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetInitialBoneTransform_2_4_Transform;     // 0x00F0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetInitialBoneTransform_2_4_CachedBone;    // 0x0150(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_4_2_4_Value;                 // 0x0160(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_BoneToModify__IO;             // 0x0180(0x0010)(Edit, EditConst, NonTransactional)
	float                                         MathFloatRemap_Result;                             // 0x0190(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MathQuaternionToEuler_Result;                      // 0x0198(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetRelativeBoneTransform_Transform;        // 0x01B0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetRelativeBoneTransform_CachedBone;       // 0x0210(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigUnit_GetRelativeBoneTransform_CachedSpace;      // 0x0220(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_Value;                       // 0x0230(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         MathFloatRemap_Value;                              // 0x0250(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_WorkData;                     // 0x0258(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromEuler_1_Result;                  // 0x0270(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_2_4_2_1_Result;                      // 0x0290(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_4_2_4_1_Result;              // 0x02A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetInitialBoneTransform_2_4_1_Transform;   // 0x02C0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetInitialBoneTransform_2_4_1_CachedBone;  // 0x0320(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_4_2_4_1_Value;               // 0x0330(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_1_BoneToModify__IO;           // 0x0350(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_1_WorkData;                   // 0x0360(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionFromEuler_2_Result;                  // 0x0370(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_2_4_2_2_Result;                      // 0x0390(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_2_BoneToModify__IO;           // 0x03A8(0x0010)(Edit, EditConst, NonTransactional)
	float                                         MathFloatRemap_1_Result;                           // 0x03B8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_2_WorkData;                   // 0x03C0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionFromEuler_1_1_Result;                // 0x03D0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_2_4_2_1_1_Result;                    // 0x03F0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_1_1_BoneToModify__IO;         // 0x0408(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_1_1_WorkData;                 // 0x0418(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_428[0x8];                                      // 0x0428(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromEuler_5_Result;                  // 0x0430(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_2_4_2_3_Result;                      // 0x0450(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_4_2_4_2_Result;              // 0x0468(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetInitialBoneTransform_2_4_2_Transform;   // 0x0480(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetInitialBoneTransform_2_4_2_CachedBone;  // 0x04E0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_4_2_4_2_Value;               // 0x04F0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_4_BoneToModify__IO;           // 0x0510(0x0010)(Edit, EditConst, NonTransactional)
	float                                         MathFloatRemap_3_Result;                           // 0x0520(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MathQuaternionToEuler_2_Result;                    // 0x0528(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetRelativeBoneTransform_2_Transform;      // 0x0540(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetRelativeBoneTransform_2_CachedBone;     // 0x05A0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigUnit_GetRelativeBoneTransform_2_CachedSpace;    // 0x05B0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_2_Value;                     // 0x05C0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         MathFloatRemap_3_Value;                            // 0x05E0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_4_WorkData;                   // 0x05E8(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_5F8[0x8];                                      // 0x05F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromEuler_1_3_Result;                // 0x0600(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_2_4_2_1_2_Result;                    // 0x0620(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_4_2_4_1_1_Result;            // 0x0638(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetInitialBoneTransform_2_4_1_1_Transform; // 0x0650(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetInitialBoneTransform_2_4_1_1_CachedBone; // 0x06B0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_4_2_4_1_1_Value;             // 0x06C0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_1_3_BoneToModify__IO;         // 0x06E0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_1_3_WorkData;                 // 0x06F0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionFromEuler_2_3_Result;                // 0x0700(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_2_4_2_2_1_Result;                    // 0x0720(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_2_2_BoneToModify__IO;         // 0x0738(0x0010)(Edit, EditConst, NonTransactional)
	float                                         MathFloatRemap_1_2_Result;                         // 0x0748(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74C[0x4];                                      // 0x074C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_2_2_WorkData;                 // 0x0750(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionFromEuler_1_1_2_Result;              // 0x0760(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_2_4_2_1_1_1_Result;                  // 0x0780(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_1_1_2_BoneToModify__IO;       // 0x0798(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_1_1_2_WorkData;               // 0x07A8(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_7B8[0x8];                                      // 0x07B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromEuler_3_Result;                  // 0x07C0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_2_4_3_Result;                        // 0x07E0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_4_2_Result;                  // 0x07F8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetInitialBoneTransform_2_Transform;       // 0x0810(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetInitialBoneTransform_2_CachedBone;      // 0x0870(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_4_2_Value;                   // 0x0880(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_3_BoneToModify__IO;           // 0x08A0(0x0010)(Edit, EditConst, NonTransactional)
	float                                         MathFloatRemap_2_Result;                           // 0x08B0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8B4[0x4];                                      // 0x08B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MathQuaternionToEuler_1_Result;                    // 0x08B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetRelativeBoneTransform_1_Transform;      // 0x08D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetRelativeBoneTransform_1_CachedBone;     // 0x0930(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigUnit_GetRelativeBoneTransform_1_CachedSpace;    // 0x0940(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_1_Value;                     // 0x0950(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         MathFloatRemap_2_Value;                            // 0x0970(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_974[0x4];                                      // 0x0974(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_3_WorkData;                   // 0x0978(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_988[0x8];                                      // 0x0988(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromEuler_1_2_Result;                // 0x0990(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_2_4_Result;                          // 0x09B0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_4_2_1_Result;                // 0x09C8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetInitialBoneTransform_2_1_Transform;     // 0x09E0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetInitialBoneTransform_2_1_CachedBone;    // 0x0A40(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_4_2_1_Value;                 // 0x0A50(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_1_2_BoneToModify__IO;         // 0x0A70(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_1_2_WorkData;                 // 0x0A80(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionFromEuler_2_2_Result;                // 0x0A90(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_2_4_1_Result;                        // 0x0AB0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_2_1_BoneToModify__IO;         // 0x0AC8(0x0010)(Edit, EditConst, NonTransactional)
	float                                         MathFloatRemap_1_1_Result;                         // 0x0AD8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ADC[0x4];                                      // 0x0ADC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_2_1_WorkData;                 // 0x0AE0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionFromEuler_1_1_1_Result;              // 0x0AF0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_2_4_1_1_Result;                      // 0x0B10(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_1_1_1_BoneToModify__IO;       // 0x0B28(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_1_1_1_WorkData;               // 0x0B38(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_B48[0x8];                                      // 0x0B48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromEuler_3_1_Result;                // 0x0B50(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_2_3_Result;                          // 0x0B70(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_4_2_3_Result;                // 0x0B88(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetInitialBoneTransform_2_3_Transform;     // 0x0BA0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetInitialBoneTransform_2_3_CachedBone;    // 0x0C00(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_4_2_3_Value;                 // 0x0C10(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_3_1_BoneToModify__IO;         // 0x0C30(0x0010)(Edit, EditConst, NonTransactional)
	float                                         MathFloatRemap_2_1_Result;                         // 0x0C40(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C44[0x4];                                      // 0x0C44(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MathQuaternionToEuler_1_2_Result;                  // 0x0C48(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetRelativeBoneTransform_1_1_Transform;    // 0x0C60(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetRelativeBoneTransform_1_1_CachedBone;   // 0x0CC0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigUnit_GetRelativeBoneTransform_1_1_CachedSpace;  // 0x0CD0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_1_2_Value;                   // 0x0CE0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         MathFloatRemap_2_1_Value;                          // 0x0D00(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D04[0x4];                                      // 0x0D04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_3_1_WorkData;                 // 0x0D08(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_D18[0x8];                                      // 0x0D18(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromEuler_1_2_1_Result;              // 0x0D20(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_2_2_Result;                          // 0x0D40(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_4_2_2_Result;                // 0x0D58(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetInitialBoneTransform_2_2_Transform;     // 0x0D70(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetInitialBoneTransform_2_2_CachedBone;    // 0x0DD0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_4_2_2_Value;                 // 0x0DE0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_1_2_1_BoneToModify__IO;       // 0x0E00(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_1_2_1_WorkData;               // 0x0E10(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionFromEuler_2_2_1_Result;              // 0x0E20(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_2_1_Result;                          // 0x0E40(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_2_1_1_BoneToModify__IO;       // 0x0E58(0x0010)(Edit, EditConst, NonTransactional)
	float                                         MathFloatRemap_1_1_1_Result;                       // 0x0E68(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E6C[0x4];                                      // 0x0E6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_2_1_1_WorkData;               // 0x0E70(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionFromEuler_1_1_1_1_Result;            // 0x0E80(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_2_Result;                            // 0x0EA0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_1_1_1_1_BoneToModify__IO;     // 0x0EB8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_1_1_1_1_WorkData;             // 0x0EC8(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_ED8[0x8];                                      // 0x0ED8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromEuler_4_1_Result;                // 0x0EE0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_3_Result;                            // 0x0F00(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_4_3_Result;                  // 0x0F18(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetInitialBoneTransform_3_Transform;       // 0x0F30(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetInitialBoneTransform_3_CachedBone;      // 0x0F90(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_4_3_Value;                   // 0x0FA0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_5_1_BoneToModify__IO;         // 0x0FC0(0x0010)(Edit, EditConst, NonTransactional)
	float                                         MathFloatRemap_4_1_Result;                         // 0x0FD0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MathFloatAbs_Result;                               // 0x0FD4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_3_1_Result;                  // 0x0FD8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetRelativeBoneTransform_3_1_Transform;    // 0x0FF0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetRelativeBoneTransform_3_1_CachedBone;   // 0x1050(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigUnit_GetRelativeBoneTransform_3_1_CachedSpace;  // 0x1060(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_3_1_Value;                   // 0x1070(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         MathFloatAbs_Value;                                // 0x1090(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1094[0x4];                                     // 0x1094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_5_1_WorkData;                 // 0x1098(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_10A8[0x8];                                     // 0x10A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromEuler_1_4_1_1_Result;            // 0x10B0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_1_1_Result;                          // 0x10D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_4_1_1_Result;                // 0x10E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetInitialBoneTransform_1_1_Transform;     // 0x1100(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetInitialBoneTransform_1_1_CachedBone;    // 0x1160(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_4_1_1_Value;                 // 0x1170(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_1_4_1_BoneToModify__IO;       // 0x1190(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_1_4_1_WorkData;               // 0x11A0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionFromEuler_4_Result;                  // 0x11B0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_Result;                              // 0x11D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_4_Result;                    // 0x11E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetInitialBoneTransform_Transform;         // 0x1200(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetInitialBoneTransform_CachedBone;        // 0x1260(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_4_Value;                     // 0x1270(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_5_BoneToModify__IO;           // 0x1290(0x0010)(Edit, EditConst, NonTransactional)
	float                                         MathFloatRemap_4_Result;                           // 0x12A0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MathFloatAbs_1_Result;                             // 0x12A4(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_3_Result;                    // 0x12A8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetRelativeBoneTransform_3_Transform;      // 0x12C0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetRelativeBoneTransform_3_CachedBone;     // 0x1320(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigUnit_GetRelativeBoneTransform_3_CachedSpace;    // 0x1330(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_3_Value;                     // 0x1340(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         MathFloatAbs_1_Value;                              // 0x1360(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1364[0x4];                                     // 0x1364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_5_WorkData;                   // 0x1368(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_1378[0x8];                                     // 0x1378(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromEuler_1_4_1_Result;              // 0x1380(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_1_Result;                            // 0x13A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_4_1_Result;                  // 0x13B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetInitialBoneTransform_1_Transform;       // 0x13D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetInitialBoneTransform_1_CachedBone;      // 0x1430(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_4_1_Value;                   // 0x1440(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_1_4_BoneToModify__IO;         // 0x1460(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_1_4_WorkData;                 // 0x1470(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionFromEuler_4_1_1_Result;              // 0x1480(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_3_1_Result;                          // 0x14A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_4_3_1_Result;                // 0x14B8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetInitialBoneTransform_3_1_Transform;     // 0x14D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetInitialBoneTransform_3_1_CachedBone;    // 0x1530(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_4_3_1_Value;                 // 0x1540(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_5_1_1_BoneToModify__IO;       // 0x1560(0x0010)(Edit, EditConst, NonTransactional)
	float                                         MathFloatRemap_4_1_1_Result;                       // 0x1570(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MathFloatAbs_2_Result;                             // 0x1574(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_3_1_1_Result;                // 0x1578(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetRelativeBoneTransform_3_1_1_Transform;  // 0x1590(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetRelativeBoneTransform_3_1_1_CachedBone; // 0x15F0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigUnit_GetRelativeBoneTransform_3_1_1_CachedSpace; // 0x1600(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_3_1_1_Value;                 // 0x1610(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         MathFloatAbs_2_Value;                              // 0x1630(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1634[0x4];                                     // 0x1634(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_5_1_1_WorkData;               // 0x1638(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_1648[0x8];                                     // 0x1648(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromEuler_1_4_1_1_1_Result;          // 0x1650(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_1_1_1_Result;                        // 0x1670(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_4_1_1_1_Result;              // 0x1688(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetInitialBoneTransform_1_1_1_Transform;   // 0x16A0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetInitialBoneTransform_1_1_1_CachedBone;  // 0x1700(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_4_1_1_1_Value;               // 0x1710(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_1_4_1_1_BoneToModify__IO;     // 0x1730(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_1_4_1_1_WorkData;             // 0x1740(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionFromEuler_4_1_1_1_Result;            // 0x1750(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_3_1_1_Result;                        // 0x1770(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_4_3_1_1_Result;              // 0x1788(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetInitialBoneTransform_3_1_1_Transform;   // 0x17A0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetInitialBoneTransform_3_1_1_CachedBone;  // 0x1800(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_4_3_1_1_Value;               // 0x1810(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_5_1_1_1_BoneToModify__IO;     // 0x1830(0x0010)(Edit, EditConst, NonTransactional)
	float                                         MathFloatRemap_4_1_1_1_Result;                     // 0x1840(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MathFloatAbs_2_1_Result;                           // 0x1844(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_3_1_1_1_Result;              // 0x1848(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetRelativeBoneTransform_3_1_1_1_Transform; // 0x1860(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetRelativeBoneTransform_3_1_1_1_CachedBone; // 0x18C0(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigUnit_GetRelativeBoneTransform_3_1_1_1_CachedSpace; // 0x18D0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_3_1_1_1_Value;               // 0x18E0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	float                                         MathFloatAbs_2_1_Value;                            // 0x1900(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1904[0x4];                                     // 0x1904(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_5_1_1_1_WorkData;             // 0x1908(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_1918[0x8];                                     // 0x1918(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  MathQuaternionFromEuler_1_4_1_1_1_1_Result;        // 0x1920(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FVector                                MathVectorAdd_1_1_1_1_Result;                      // 0x1940(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MathQuaternionToEuler_4_1_1_1_1_Result;            // 0x1958(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigUnit_GetInitialBoneTransform_1_1_1_1_Transform; // 0x1970(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigUnit_GetInitialBoneTransform_1_1_1_1_CachedBone; // 0x19D0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  MathQuaternionToEuler_4_1_1_1_1_Value;             // 0x19E0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	TArray<struct FRigUnit_ModifyBoneTransforms_PerBone> ModifyBoneTransforms_1_4_1_1_1_BoneToModify__IO;   // 0x1A00(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FRigUnit_ModifyBoneTransforms_WorkData> ModifyBoneTransforms_1_4_1_1_1_WorkData;           // 0x1A10(0x0010)(Edit, EditConst, NonTransactional)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RigVMMemoryStorageGeneratorClass F_MED_Island_Nomad_Deform_CtrlRig_sculpters.RigVMMemory_Work", true>();
	}
	static class F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work* GetDefaultObj()
	{
		return GetDefaultObjImpl<F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work>();
	}
};
static_assert(alignof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work) == 0x000010, "Wrong alignment on F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work");
static_assert(sizeof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work) == 0x001A20, "Wrong size on F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, ExecuteContext_) == 0x000030, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::ExecuteContext_' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathQuaternionFromEuler_Result) == 0x0000A0, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathQuaternionFromEuler_Result' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathVectorAdd_2_4_2_Result) == 0x0000C0, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathVectorAdd_2_4_2_Result' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathQuaternionToEuler_4_2_4_Result) == 0x0000D8, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathQuaternionToEuler_4_2_4_Result' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, RigUnit_GetInitialBoneTransform_2_4_Transform) == 0x0000F0, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::RigUnit_GetInitialBoneTransform_2_4_Transform' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, RigUnit_GetInitialBoneTransform_2_4_CachedBone) == 0x000150, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::RigUnit_GetInitialBoneTransform_2_4_CachedBone' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathQuaternionToEuler_4_2_4_Value) == 0x000160, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathQuaternionToEuler_4_2_4_Value' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, ModifyBoneTransforms_BoneToModify__IO) == 0x000180, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::ModifyBoneTransforms_BoneToModify__IO' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathFloatRemap_Result) == 0x000190, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathFloatRemap_Result' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathQuaternionToEuler_Result) == 0x000198, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathQuaternionToEuler_Result' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, RigUnit_GetRelativeBoneTransform_Transform) == 0x0001B0, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::RigUnit_GetRelativeBoneTransform_Transform' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, RigUnit_GetRelativeBoneTransform_CachedBone) == 0x000210, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::RigUnit_GetRelativeBoneTransform_CachedBone' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, RigUnit_GetRelativeBoneTransform_CachedSpace) == 0x000220, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::RigUnit_GetRelativeBoneTransform_CachedSpace' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathQuaternionToEuler_Value) == 0x000230, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathQuaternionToEuler_Value' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathFloatRemap_Value) == 0x000250, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathFloatRemap_Value' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, ModifyBoneTransforms_WorkData) == 0x000258, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::ModifyBoneTransforms_WorkData' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathQuaternionFromEuler_1_Result) == 0x000270, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathQuaternionFromEuler_1_Result' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathVectorAdd_2_4_2_1_Result) == 0x000290, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathVectorAdd_2_4_2_1_Result' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathQuaternionToEuler_4_2_4_1_Result) == 0x0002A8, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathQuaternionToEuler_4_2_4_1_Result' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, RigUnit_GetInitialBoneTransform_2_4_1_Transform) == 0x0002C0, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::RigUnit_GetInitialBoneTransform_2_4_1_Transform' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, RigUnit_GetInitialBoneTransform_2_4_1_CachedBone) == 0x000320, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::RigUnit_GetInitialBoneTransform_2_4_1_CachedBone' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathQuaternionToEuler_4_2_4_1_Value) == 0x000330, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathQuaternionToEuler_4_2_4_1_Value' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, ModifyBoneTransforms_1_BoneToModify__IO) == 0x000350, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::ModifyBoneTransforms_1_BoneToModify__IO' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, ModifyBoneTransforms_1_WorkData) == 0x000360, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::ModifyBoneTransforms_1_WorkData' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathQuaternionFromEuler_2_Result) == 0x000370, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathQuaternionFromEuler_2_Result' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathVectorAdd_2_4_2_2_Result) == 0x000390, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathVectorAdd_2_4_2_2_Result' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, ModifyBoneTransforms_2_BoneToModify__IO) == 0x0003A8, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::ModifyBoneTransforms_2_BoneToModify__IO' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathFloatRemap_1_Result) == 0x0003B8, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathFloatRemap_1_Result' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, ModifyBoneTransforms_2_WorkData) == 0x0003C0, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::ModifyBoneTransforms_2_WorkData' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathQuaternionFromEuler_1_1_Result) == 0x0003D0, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathQuaternionFromEuler_1_1_Result' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathVectorAdd_2_4_2_1_1_Result) == 0x0003F0, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathVectorAdd_2_4_2_1_1_Result' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, ModifyBoneTransforms_1_1_BoneToModify__IO) == 0x000408, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::ModifyBoneTransforms_1_1_BoneToModify__IO' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, ModifyBoneTransforms_1_1_WorkData) == 0x000418, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::ModifyBoneTransforms_1_1_WorkData' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathQuaternionFromEuler_5_Result) == 0x000430, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathQuaternionFromEuler_5_Result' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathVectorAdd_2_4_2_3_Result) == 0x000450, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathVectorAdd_2_4_2_3_Result' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathQuaternionToEuler_4_2_4_2_Result) == 0x000468, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathQuaternionToEuler_4_2_4_2_Result' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, RigUnit_GetInitialBoneTransform_2_4_2_Transform) == 0x000480, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::RigUnit_GetInitialBoneTransform_2_4_2_Transform' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, RigUnit_GetInitialBoneTransform_2_4_2_CachedBone) == 0x0004E0, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::RigUnit_GetInitialBoneTransform_2_4_2_CachedBone' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathQuaternionToEuler_4_2_4_2_Value) == 0x0004F0, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathQuaternionToEuler_4_2_4_2_Value' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, ModifyBoneTransforms_4_BoneToModify__IO) == 0x000510, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::ModifyBoneTransforms_4_BoneToModify__IO' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathFloatRemap_3_Result) == 0x000520, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathFloatRemap_3_Result' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathQuaternionToEuler_2_Result) == 0x000528, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathQuaternionToEuler_2_Result' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, RigUnit_GetRelativeBoneTransform_2_Transform) == 0x000540, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::RigUnit_GetRelativeBoneTransform_2_Transform' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, RigUnit_GetRelativeBoneTransform_2_CachedBone) == 0x0005A0, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::RigUnit_GetRelativeBoneTransform_2_CachedBone' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, RigUnit_GetRelativeBoneTransform_2_CachedSpace) == 0x0005B0, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::RigUnit_GetRelativeBoneTransform_2_CachedSpace' has a wrong offset!");
static_assert(offsetof(F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work, MathQuaternionToEuler_2_Value) == 0x0005C0, "Member 'F_MED_Island_Nomad_Deform_CtrlRig_sculpters::URigVMMemory_Work::MathQuaternionToEuler_2_Value' has a wrong offset!");
