#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Temple_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Temple_AnimBP.F_MED_Temple_AnimBP_C
// 0x38B0 (0x3F40 - 0x0690)
class UF_MED_Temple_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0698(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x06C8(0x0180)(ContainsInstancedReference)
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0848(0x0128)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x0970(0x0510)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0E80(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0FA8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0FC8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0FE8(0x0128)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x1110(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x1620(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x1B30(0x0510)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x2040(0x0980)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_5;                        // 0x29C0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x2AC8(0x0108)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x2BD0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x30E0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x35F0(0x0510)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x3B00(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x3C08(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x3D10(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x3E18(0x0108)()
	class USkeletalMeshComponent*                 skel_mesh;                                         // 0x3F20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         thigh_rot_l;                                       // 0x3F28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         thigh_rot_r;                                       // 0x3F2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         pack_alpha;                                        // 0x3F30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_F_MED_Temple_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintInitializeAnimation();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Temple_AnimBP_C">();
	}
	static class UF_MED_Temple_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Temple_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_Temple_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_Temple_AnimBP_C");
static_assert(sizeof(UF_MED_Temple_AnimBP_C) == 0x003F40, "Wrong size on UF_MED_Temple_AnimBP_C");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, UberGraphFrame) == 0x000690, "Member 'UF_MED_Temple_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000698, "Member 'UF_MED_Temple_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimBlueprintExtension_Base) == 0x0006A0, "Member 'UF_MED_Temple_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0006C8, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x000848, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_AnimDynamics_6) == 0x000970, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x000E80, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000FA8, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000FC8, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000FE8, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_AnimDynamics_5) == 0x001110, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x001620, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x001B30, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_RigidBody) == 0x002040, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_Constraint_5) == 0x0029C0, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_Constraint_5' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_Constraint_4) == 0x002AC8, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_Constraint_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x002BD0, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x0030E0, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x0035F0, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_Constraint_3) == 0x003B00, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_Constraint_2) == 0x003C08, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_Constraint_1) == 0x003D10, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, AnimGraphNode_Constraint) == 0x003E18, "Member 'UF_MED_Temple_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, skel_mesh) == 0x003F20, "Member 'UF_MED_Temple_AnimBP_C::skel_mesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, thigh_rot_l) == 0x003F28, "Member 'UF_MED_Temple_AnimBP_C::thigh_rot_l' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, thigh_rot_r) == 0x003F2C, "Member 'UF_MED_Temple_AnimBP_C::thigh_rot_r' has a wrong offset!");
static_assert(offsetof(UF_MED_Temple_AnimBP_C, pack_alpha) == 0x003F30, "Member 'UF_MED_Temple_AnimBP_C::pack_alpha' has a wrong offset!");

}

