#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Aztec_Face_Acc_AnimBP

#include "Basic.hpp"

#include "F_MED_Aztec_Face_Acc_AnimBP_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Aztec_Face_Acc_AnimBP.F_MED_Aztec_Face_Acc_AnimBP_C
// 0x8E10 (0x94A0 - 0x0690)
class UF_MED_Aztec_Face_Acc_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct F_MED_Aztec_Face_Acc_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0698(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_69A[0x6];                                      // 0x069A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x06A0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A8(0x0008)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_1;                  // 0x06B0(0x0180)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0830(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x0850(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_15;                     // 0x0870(0x0510)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0D80(0x0980)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x1700(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x1828(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x1950(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1A78(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1BA0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1CC8(0x0128)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x1DF0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x1EF8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x2000(0x0108)()
	uint8                                         Pad_2108[0x8];                                     // 0x2108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_14;                           // 0x2110(0x0240)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_13;                           // 0x2350(0x0240)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_12;                           // 0x2590(0x0240)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_11;                           // 0x27D0(0x0240)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_10;                           // 0x2A10(0x0240)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_9;                            // 0x2C50(0x0240)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_8;                            // 0x2E90(0x0240)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_7;                            // 0x30D0(0x0240)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x3310(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x3418(0x0108)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_6;                            // 0x3520(0x0240)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x3760(0x0128)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x3888(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x38D0(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x38F0(0x0180)(ContainsInstancedReference)
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_14;                     // 0x3A70(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_13;                     // 0x3F80(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_12;                     // 0x4490(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_11;                     // 0x49A0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_10;                     // 0x4EB0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_9;                      // 0x53C0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8;                      // 0x58D0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x5DE0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x62F0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x6800(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x6D10(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x7220(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x7730(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x7C40(0x0510)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x8150(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x8170(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_5;                            // 0x8190(0x0240)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_4;                            // 0x83D0(0x0240)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_3;                            // 0x8610(0x0240)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_2;                            // 0x8850(0x0240)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_1;                            // 0x8A90(0x0240)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x8CD0(0x0510)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x91E0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x9200(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x9220(0x0240)()
	struct FVector                                skydiving_vector_force;                            // 0x9460(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Head_up;                                           // 0x9478(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_947C[0x4];                                     // 0x947C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 skel_mesh;                                         // 0x9480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Head_Down;                                         // 0x9488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Head_Left;                                         // 0x948C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Target_off;                                        // 0x9490(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP_AnimGraphNode_RigidBody_4DF47E354681E716E195879C4C0F1B8C();
	void ExecuteUbergraph_F_MED_Aztec_Face_Acc_AnimBP(int32 EntryPoint);
	void OnBeginCrouching();
	void OnBeginSkydiving();
	void OnBeginTargeting();
	void OnEndCrouching();
	void OnEndSkydiving();
	void OnParachuteOpened();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Aztec_Face_Acc_AnimBP_C">();
	}
	static class UF_MED_Aztec_Face_Acc_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Aztec_Face_Acc_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_Aztec_Face_Acc_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_Aztec_Face_Acc_AnimBP_C");
static_assert(sizeof(UF_MED_Aztec_Face_Acc_AnimBP_C) == 0x0094A0, "Wrong size on UF_MED_Aztec_Face_Acc_AnimBP_C");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, UberGraphFrame) == 0x000690, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, __AnimBlueprintMutables) == 0x000698, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x0006A0, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimBlueprintExtension_Base) == 0x0006A8, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh_1) == 0x0006B0, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_Root) == 0x000830, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_LocalToComponentSpace_2) == 0x000850, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_AnimDynamics_15) == 0x000870, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_AnimDynamics_15' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_RigidBody) == 0x000D80, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_ModifyBone_6) == 0x001700, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_ModifyBone_5) == 0x001828, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_ModifyBone_4) == 0x001950, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x001A78, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x001BA0, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x001CC8, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_Constraint_4) == 0x001DF0, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_Constraint_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_Constraint_3) == 0x001EF8, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_Constraint_2) == 0x002000, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_LookAt_14) == 0x002110, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_LookAt_14' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_LookAt_13) == 0x002350, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_LookAt_13' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_LookAt_12) == 0x002590, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_LookAt_12' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_LookAt_11) == 0x0027D0, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_LookAt_11' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_LookAt_10) == 0x002A10, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_LookAt_10' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_LookAt_9) == 0x002C50, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_LookAt_9' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_LookAt_8) == 0x002E90, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_LookAt_8' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_LookAt_7) == 0x0030D0, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_LookAt_7' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_Constraint_1) == 0x003310, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_Constraint) == 0x003418, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_LookAt_6) == 0x003520, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_LookAt_6' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_ModifyBone) == 0x003760, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x003888, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x0038D0, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0038F0, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_AnimDynamics_14) == 0x003A70, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_AnimDynamics_14' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_AnimDynamics_13) == 0x003F80, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_AnimDynamics_13' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_AnimDynamics_12) == 0x004490, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_AnimDynamics_12' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_AnimDynamics_11) == 0x0049A0, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_AnimDynamics_11' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_AnimDynamics_10) == 0x004EB0, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_AnimDynamics_10' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_AnimDynamics_9) == 0x0053C0, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_AnimDynamics_9' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_AnimDynamics_8) == 0x0058D0, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_AnimDynamics_8' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_AnimDynamics_7) == 0x005DE0, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_AnimDynamics_6) == 0x0062F0, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_AnimDynamics_5) == 0x006800, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x006D10, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x007220, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x007730, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x007C40, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x008150, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x008170, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_LookAt_5) == 0x008190, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_LookAt_5' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_LookAt_4) == 0x0083D0, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_LookAt_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_LookAt_3) == 0x008610, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_LookAt_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_LookAt_2) == 0x008850, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_LookAt_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_LookAt_1) == 0x008A90, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_LookAt_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x008CD0, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x0091E0, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x009200, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, AnimGraphNode_LookAt) == 0x009220, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, skydiving_vector_force) == 0x009460, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::skydiving_vector_force' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, Head_up) == 0x009478, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::Head_up' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, skel_mesh) == 0x009480, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::skel_mesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, Head_Down) == 0x009488, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::Head_Down' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, Head_Left) == 0x00948C, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::Head_Left' has a wrong offset!");
static_assert(offsetof(UF_MED_Aztec_Face_Acc_AnimBP_C, Target_off) == 0x009490, "Member 'UF_MED_Aztec_Face_Acc_AnimBP_C::Target_off' has a wrong offset!");

}

