#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_Med_Soldier_01_Skeleton_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_Med_Soldier_01_Skeleton_AnimBP.F_Med_Soldier_01_Skeleton_AnimBP_C
// 0x17F0 (0x1E80 - 0x0690)
class UF_Med_Soldier_01_Skeleton_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0698(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A0(0x0008)()
	uint8                                         Pad_6A8[0x8];                                      // 0x06A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x06B0(0x0510)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0BC0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0BE0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0C00(0x0128)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0D28(0x0180)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0EA8(0x0020)()
	uint8                                         Pad_EC8[0x8];                                      // 0x0EC8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x0ED0(0x0510)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x13E0(0x0108)()
	uint8                                         Pad_14E8[0x8];                                     // 0x14E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x14F0(0x0980)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x1E70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ease_in_animdyn;                                   // 0x1E78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnCharacterCustomizationLoaded();
	void ExecuteUbergraph_F_Med_Soldier_01_Skeleton_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintInitializeAnimation();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_Med_Soldier_01_Skeleton_AnimBP_C">();
	}
	static class UF_Med_Soldier_01_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_Med_Soldier_01_Skeleton_AnimBP_C>();
	}
};
static_assert(alignof(UF_Med_Soldier_01_Skeleton_AnimBP_C) == 0x000010, "Wrong alignment on UF_Med_Soldier_01_Skeleton_AnimBP_C");
static_assert(sizeof(UF_Med_Soldier_01_Skeleton_AnimBP_C) == 0x001E80, "Wrong size on UF_Med_Soldier_01_Skeleton_AnimBP_C");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, UberGraphFrame) == 0x000690, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000698, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimBlueprintExtension_Base) == 0x0006A0, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x0006B0, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000BC0, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000BE0, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000C00, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x000D28, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_Root) == 0x000EA8, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x000ED0, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_Constraint) == 0x0013E0, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_RigidBody) == 0x0014F0, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, MeshToCopy) == 0x001E70, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::MeshToCopy' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, ease_in_animdyn) == 0x001E78, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::ease_in_animdyn' has a wrong offset!");

}

