#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Temple_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GravityOverrideSettingStruct_structs.hpp"


namespace SDK::Params
{

// Function F_MED_Temple_FaceAcc_AnimBP.F_MED_Temple_FaceAcc_AnimBP_C.ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP
// 0x00E0 (0x00E0 - 0x0000)
struct F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Gravity_Override_State_Function_GravityOverride; // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Gravity_Override_State_Function_CurrentStateOut; // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGravityOverrideSettingStruct          CallFunc_Gravity_Override_State_Function_GravityOverrideSettingsOut; // 0x0038(0x0068)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue;   // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchesWildcard_ReturnValue;              // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckForBackbling_bIsWearingBackbling;    // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckForBackbling_bIsBackblingACape;      // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckForBackbling_bIsBackblingLong;       // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB[0x1];                                       // 0x00DB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP) == 0x000008, "Wrong alignment on F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP");
static_assert(sizeof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP) == 0x0000E0, "Wrong size on F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, EntryPoint) == 0x000000, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000004, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, CallFunc_Gravity_Override_State_Function_GravityOverride) == 0x000010, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::CallFunc_Gravity_Override_State_Function_GravityOverride' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, CallFunc_Gravity_Override_State_Function_CurrentStateOut) == 0x000028, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::CallFunc_Gravity_Override_State_Function_CurrentStateOut' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, CallFunc_Gravity_Override_State_Function_GravityOverrideSettingsOut) == 0x000038, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::CallFunc_Gravity_Override_State_Function_GravityOverrideSettingsOut' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000A0, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, CallFunc_GetSkeletalMeshForPartType_ReturnValue) == 0x0000B0, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::CallFunc_GetSkeletalMeshForPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, CallFunc_GetDisplayName_ReturnValue) == 0x0000B8, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x0000C8, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, CallFunc_MatchesWildcard_ReturnValue) == 0x0000CC, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::CallFunc_MatchesWildcard_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x0000CD, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, K2Node_Event_DeltaTimeX) == 0x0000D0, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, CallFunc_CheckForBackbling_bIsWearingBackbling) == 0x0000D4, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::CallFunc_CheckForBackbling_bIsWearingBackbling' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, CallFunc_CheckForBackbling_bIsBackblingACape) == 0x0000D5, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::CallFunc_CheckForBackbling_bIsBackblingACape' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, CallFunc_CheckForBackbling_bIsBackblingLong) == 0x0000D6, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::CallFunc_CheckForBackbling_bIsBackblingLong' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000D7, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, CallFunc_BooleanAND_ReturnValue) == 0x0000D8, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, CallFunc_BooleanAND_ReturnValue_1) == 0x0000D9, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, CallFunc_BooleanAND_ReturnValue_2) == 0x0000DA, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x0000DC, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_ExecuteUbergraph_F_MED_Temple_FaceAcc_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");

// Function F_MED_Temple_FaceAcc_AnimBP.F_MED_Temple_FaceAcc_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct F_MED_Temple_FaceAcc_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_Temple_FaceAcc_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on F_MED_Temple_FaceAcc_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(F_MED_Temple_FaceAcc_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on F_MED_Temple_FaceAcc_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function F_MED_Temple_FaceAcc_AnimBP.F_MED_Temple_FaceAcc_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct F_MED_Temple_FaceAcc_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(F_MED_Temple_FaceAcc_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on F_MED_Temple_FaceAcc_AnimBP_C_AnimGraph");
static_assert(sizeof(F_MED_Temple_FaceAcc_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on F_MED_Temple_FaceAcc_AnimBP_C_AnimGraph");
static_assert(offsetof(F_MED_Temple_FaceAcc_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'F_MED_Temple_FaceAcc_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

