#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_HIS_Aline_Head_01_Dyn_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_HIS_Aline_Head_01_Dyn_AnimBP.F_MED_HIS_Aline_Head_01_Dyn_AnimBP_C
// 0x1FB0 (0x2640 - 0x0690)
class UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0698(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x06C8(0x00C0)()
	uint8                                         Pad_788[0x8];                                      // 0x0788(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x0790(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x0CA0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x11B0(0x0510)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x16C0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x16E0(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x1700(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x1C10(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x2120(0x0510)()
	float                                         Hair_Hat;                                          // 0x2630(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_F_MED_HIS_Aline_Head_01_Dyn_AnimBP_AnimGraphNode_AnimDynamics_26EACFF2458CE3D8995092AA261683F4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_F_MED_HIS_Aline_Head_01_Dyn_AnimBP_AnimGraphNode_AnimDynamics_BDBEF5E944C61B3ECE540EA465C23589();
	void ExecuteUbergraph_F_MED_HIS_Aline_Head_01_Dyn_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_HIS_Aline_Head_01_Dyn_AnimBP_C">();
	}
	static class UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C");
static_assert(sizeof(UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C) == 0x002640, "Wrong size on UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C");
static_assert(offsetof(UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C, UberGraphFrame) == 0x000690, "Member 'UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000698, "Member 'UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C, AnimBlueprintExtension_Base) == 0x0006A0, "Member 'UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C, AnimGraphNode_SubInput) == 0x0006C8, "Member 'UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C, AnimGraphNode_AnimDynamics_5) == 0x000790, "Member 'UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x000CA0, "Member 'UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x0011B0, "Member 'UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0016C0, "Member 'UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0016E0, "Member 'UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x001700, "Member 'UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x001C10, "Member 'UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x002120, "Member 'UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C, Hair_Hat) == 0x002630, "Member 'UF_MED_HIS_Aline_Head_01_Dyn_AnimBP_C::Hair_Hat' has a wrong offset!");

}

