#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FNBR_Player_Prop

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CreativePlayerPropOriginalMaterials_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function FNBR_Player_Prop.FNBR_Player_Prop_C.VerifyPropVisibility
// 0x0002 (0x0002 - 0x0000)
struct FNBR_Player_Prop_C_VerifyPropVisibility final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FNBR_Player_Prop_C_VerifyPropVisibility) == 0x000001, "Wrong alignment on FNBR_Player_Prop_C_VerifyPropVisibility");
static_assert(sizeof(FNBR_Player_Prop_C_VerifyPropVisibility) == 0x000002, "Wrong size on FNBR_Player_Prop_C_VerifyPropVisibility");
static_assert(offsetof(FNBR_Player_Prop_C_VerifyPropVisibility, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'FNBR_Player_Prop_C_VerifyPropVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_VerifyPropVisibility, CallFunc_BooleanAND_ReturnValue) == 0x000001, "Member 'FNBR_Player_Prop_C_VerifyPropVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function FNBR_Player_Prop.FNBR_Player_Prop_C.UpdateVisibility
// 0x0058 (0x0058 - 0x0000)
struct FNBR_Player_Prop_C_UpdateVisibility final
{
public:
	class FString                                 UpdateVisibilityName;                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_1;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetCharacterBodyVisibilityForPossession_ReturnValue; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43[0x1];                                       // 0x0043(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FNBR_Player_Prop_C_UpdateVisibility) == 0x000008, "Wrong alignment on FNBR_Player_Prop_C_UpdateVisibility");
static_assert(sizeof(FNBR_Player_Prop_C_UpdateVisibility) == 0x000058, "Wrong size on FNBR_Player_Prop_C_UpdateVisibility");
static_assert(offsetof(FNBR_Player_Prop_C_UpdateVisibility, UpdateVisibilityName) == 0x000000, "Member 'FNBR_Player_Prop_C_UpdateVisibility::UpdateVisibilityName' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_UpdateVisibility, Temp_name_Variable) == 0x000010, "Member 'FNBR_Player_Prop_C_UpdateVisibility::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_UpdateVisibility, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'FNBR_Player_Prop_C_UpdateVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_UpdateVisibility, CallFunc_IsValid_ReturnValue_1) == 0x000015, "Member 'FNBR_Player_Prop_C_UpdateVisibility::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_UpdateVisibility, CallFunc_IsValid_ReturnValue_2) == 0x000016, "Member 'FNBR_Player_Prop_C_UpdateVisibility::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_UpdateVisibility, CallFunc_IsDedicatedServer_ReturnValue) == 0x000017, "Member 'FNBR_Player_Prop_C_UpdateVisibility::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_UpdateVisibility, Temp_name_Variable_1) == 0x000018, "Member 'FNBR_Player_Prop_C_UpdateVisibility::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_UpdateVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x00001C, "Member 'FNBR_Player_Prop_C_UpdateVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_UpdateVisibility, CallFunc_Conv_BoolToString_ReturnValue) == 0x000020, "Member 'FNBR_Player_Prop_C_UpdateVisibility::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_UpdateVisibility, Temp_bool_Variable) == 0x000030, "Member 'FNBR_Player_Prop_C_UpdateVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_UpdateVisibility, CallFunc_IsValid_ReturnValue_3) == 0x000031, "Member 'FNBR_Player_Prop_C_UpdateVisibility::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_UpdateVisibility, CallFunc_K2_SetTimer_ReturnValue) == 0x000038, "Member 'FNBR_Player_Prop_C_UpdateVisibility::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_UpdateVisibility, CallFunc_Not_PreBool_ReturnValue_1) == 0x000040, "Member 'FNBR_Player_Prop_C_UpdateVisibility::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_UpdateVisibility, CallFunc_SetCharacterBodyVisibilityForPossession_ReturnValue) == 0x000041, "Member 'FNBR_Player_Prop_C_UpdateVisibility::CallFunc_SetCharacterBodyVisibilityForPossession_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_UpdateVisibility, CallFunc_Not_PreBool_ReturnValue_2) == 0x000042, "Member 'FNBR_Player_Prop_C_UpdateVisibility::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_UpdateVisibility, K2Node_Select_Default) == 0x000044, "Member 'FNBR_Player_Prop_C_UpdateVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_UpdateVisibility, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x000048, "Member 'FNBR_Player_Prop_C_UpdateVisibility::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_UpdateVisibility, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00004C, "Member 'FNBR_Player_Prop_C_UpdateVisibility::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_UpdateVisibility, CallFunc_K2_SetTimer_ReturnValue_1) == 0x000050, "Member 'FNBR_Player_Prop_C_UpdateVisibility::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");

// Function FNBR_Player_Prop.FNBR_Player_Prop_C.TransitionVFX
// 0x0001 (0x0001 - 0x0000)
struct FNBR_Player_Prop_C_TransitionVFX final
{
public:
	ETimelineDirection                            Direction;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FNBR_Player_Prop_C_TransitionVFX) == 0x000001, "Wrong alignment on FNBR_Player_Prop_C_TransitionVFX");
static_assert(sizeof(FNBR_Player_Prop_C_TransitionVFX) == 0x000001, "Wrong size on FNBR_Player_Prop_C_TransitionVFX");
static_assert(offsetof(FNBR_Player_Prop_C_TransitionVFX, Direction) == 0x000000, "Member 'FNBR_Player_Prop_C_TransitionVFX::Direction' has a wrong offset!");

// Function FNBR_Player_Prop.FNBR_Player_Prop_C.SetupTimer
// 0x0004 (0x0004 - 0x0000)
struct FNBR_Player_Prop_C_SetupTimer final
{
public:
	float                                         Time_Remaining;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FNBR_Player_Prop_C_SetupTimer) == 0x000004, "Wrong alignment on FNBR_Player_Prop_C_SetupTimer");
static_assert(sizeof(FNBR_Player_Prop_C_SetupTimer) == 0x000004, "Wrong size on FNBR_Player_Prop_C_SetupTimer");
static_assert(offsetof(FNBR_Player_Prop_C_SetupTimer, Time_Remaining) == 0x000000, "Member 'FNBR_Player_Prop_C_SetupTimer::Time_Remaining' has a wrong offset!");

// Function FNBR_Player_Prop.FNBR_Player_Prop_C.SetScale
// 0x0020 (0x0020 - 0x0000)
struct FNBR_Player_Prop_C_SetScale final
{
public:
	struct FVector                                NewScale;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSizeSquared_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FNBR_Player_Prop_C_SetScale) == 0x000008, "Wrong alignment on FNBR_Player_Prop_C_SetScale");
static_assert(sizeof(FNBR_Player_Prop_C_SetScale) == 0x000020, "Wrong size on FNBR_Player_Prop_C_SetScale");
static_assert(offsetof(FNBR_Player_Prop_C_SetScale, NewScale) == 0x000000, "Member 'FNBR_Player_Prop_C_SetScale::NewScale' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetScale, CallFunc_VSizeSquared_ReturnValue) == 0x000018, "Member 'FNBR_Player_Prop_C_SetScale::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetScale, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'FNBR_Player_Prop_C_SetScale::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetScale, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00001D, "Member 'FNBR_Player_Prop_C_SetScale::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

// Function FNBR_Player_Prop.FNBR_Player_Prop_C.SetPropPlaced
// 0x0490 (0x0490 - 0x0000)
struct FNBR_Player_Prop_C_SetPropPlaced final
{
public:
	bool                                          NewPlaced;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlacedYawOffset;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0030(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCreativeHUDLContext*                   CallFunc_GetContext_ReturnValue;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddWorldRotation_SweepHitResult;       // 0x00F0(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorRelativeTransform_SweepHitResult; // 0x01D8(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_CalcPropOffset_PropOffset;                // 0x02B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_AddActorWorldOffset_SweepHitResult;    // 0x02D0(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetActorRelativeLocation_SweepHitResult; // 0x03B0(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(FNBR_Player_Prop_C_SetPropPlaced) == 0x000010, "Wrong alignment on FNBR_Player_Prop_C_SetPropPlaced");
static_assert(sizeof(FNBR_Player_Prop_C_SetPropPlaced) == 0x000490, "Wrong size on FNBR_Player_Prop_C_SetPropPlaced");
static_assert(offsetof(FNBR_Player_Prop_C_SetPropPlaced, NewPlaced) == 0x000000, "Member 'FNBR_Player_Prop_C_SetPropPlaced::NewPlaced' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetPropPlaced, PlacedYawOffset) == 0x000004, "Member 'FNBR_Player_Prop_C_SetPropPlaced::PlacedYawOffset' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetPropPlaced, CallFunc_MakeRotator_ReturnValue) == 0x000008, "Member 'FNBR_Player_Prop_C_SetPropPlaced::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetPropPlaced, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000020, "Member 'FNBR_Player_Prop_C_SetPropPlaced::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetPropPlaced, CallFunc_GetRelativeTransform_ReturnValue) == 0x000030, "Member 'FNBR_Player_Prop_C_SetPropPlaced::CallFunc_GetRelativeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetPropPlaced, CallFunc_BreakTransform_Location) == 0x000090, "Member 'FNBR_Player_Prop_C_SetPropPlaced::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetPropPlaced, CallFunc_BreakTransform_Rotation) == 0x0000A8, "Member 'FNBR_Player_Prop_C_SetPropPlaced::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetPropPlaced, CallFunc_BreakTransform_Scale) == 0x0000C0, "Member 'FNBR_Player_Prop_C_SetPropPlaced::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetPropPlaced, CallFunc_GetContext_ReturnValue) == 0x0000D8, "Member 'FNBR_Player_Prop_C_SetPropPlaced::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetPropPlaced, CallFunc_IsValid_ReturnValue) == 0x0000E0, "Member 'FNBR_Player_Prop_C_SetPropPlaced::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetPropPlaced, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x0000E8, "Member 'FNBR_Player_Prop_C_SetPropPlaced::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetPropPlaced, CallFunc_K2_AddWorldRotation_SweepHitResult) == 0x0000F0, "Member 'FNBR_Player_Prop_C_SetPropPlaced::CallFunc_K2_AddWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetPropPlaced, CallFunc_IsServer_ReturnValue) == 0x0001D0, "Member 'FNBR_Player_Prop_C_SetPropPlaced::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetPropPlaced, CallFunc_K2_SetActorRelativeTransform_SweepHitResult) == 0x0001D8, "Member 'FNBR_Player_Prop_C_SetPropPlaced::CallFunc_K2_SetActorRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetPropPlaced, CallFunc_CalcPropOffset_PropOffset) == 0x0002B8, "Member 'FNBR_Player_Prop_C_SetPropPlaced::CallFunc_CalcPropOffset_PropOffset' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetPropPlaced, CallFunc_K2_AddActorWorldOffset_SweepHitResult) == 0x0002D0, "Member 'FNBR_Player_Prop_C_SetPropPlaced::CallFunc_K2_AddActorWorldOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetPropPlaced, CallFunc_K2_SetActorRelativeLocation_SweepHitResult) == 0x0003B0, "Member 'FNBR_Player_Prop_C_SetPropPlaced::CallFunc_K2_SetActorRelativeLocation_SweepHitResult' has a wrong offset!");

// Function FNBR_Player_Prop.FNBR_Player_Prop_C.SetProp
// 0x0078 (0x0078 - 0x0000)
struct FNBR_Player_Prop_C_SetProp final
{
public:
	class AActor*                                 SelectedProp;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   PlayerPawnToAttachTo;                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaleDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_CalcWorldSpaceBounds_Origin;              // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_CalcWorldSpaceBounds_Extent;              // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_2;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FNBR_Player_Prop_C_SetProp) == 0x000008, "Wrong alignment on FNBR_Player_Prop_C_SetProp");
static_assert(sizeof(FNBR_Player_Prop_C_SetProp) == 0x000078, "Wrong size on FNBR_Player_Prop_C_SetProp");
static_assert(offsetof(FNBR_Player_Prop_C_SetProp, SelectedProp) == 0x000000, "Member 'FNBR_Player_Prop_C_SetProp::SelectedProp' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetProp, PlayerPawnToAttachTo) == 0x000008, "Member 'FNBR_Player_Prop_C_SetProp::PlayerPawnToAttachTo' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetProp, ScaleDuration) == 0x000010, "Member 'FNBR_Player_Prop_C_SetProp::ScaleDuration' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetProp, CallFunc_CalcWorldSpaceBounds_Origin) == 0x000018, "Member 'FNBR_Player_Prop_C_SetProp::CallFunc_CalcWorldSpaceBounds_Origin' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetProp, CallFunc_CalcWorldSpaceBounds_Extent) == 0x000030, "Member 'FNBR_Player_Prop_C_SetProp::CallFunc_CalcWorldSpaceBounds_Extent' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetProp, CallFunc_BreakVector_X) == 0x000048, "Member 'FNBR_Player_Prop_C_SetProp::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetProp, CallFunc_BreakVector_Y) == 0x00004C, "Member 'FNBR_Player_Prop_C_SetProp::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetProp, CallFunc_BreakVector_Z) == 0x000050, "Member 'FNBR_Player_Prop_C_SetProp::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetProp, CallFunc_FClamp_ReturnValue) == 0x000054, "Member 'FNBR_Player_Prop_C_SetProp::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetProp, CallFunc_FClamp_ReturnValue_1) == 0x000058, "Member 'FNBR_Player_Prop_C_SetProp::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetProp, CallFunc_FClamp_ReturnValue_2) == 0x00005C, "Member 'FNBR_Player_Prop_C_SetProp::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetProp, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'FNBR_Player_Prop_C_SetProp::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function FNBR_Player_Prop.FNBR_Player_Prop_C.SetMaxHealth
// 0x0068 (0x0068 - 0x0000)
struct FNBR_Player_Prop_C_SetMaxHealth final
{
public:
	float                                         NewMaxHealth;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           MaxHealthDataTag;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_3;  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0038(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0048(0x0010)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue; // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FNBR_Player_Prop_C_SetMaxHealth) == 0x000008, "Wrong alignment on FNBR_Player_Prop_C_SetMaxHealth");
static_assert(sizeof(FNBR_Player_Prop_C_SetMaxHealth) == 0x000068, "Wrong size on FNBR_Player_Prop_C_SetMaxHealth");
static_assert(offsetof(FNBR_Player_Prop_C_SetMaxHealth, NewMaxHealth) == 0x000000, "Member 'FNBR_Player_Prop_C_SetMaxHealth::NewMaxHealth' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetMaxHealth, MaxHealthDataTag) == 0x000004, "Member 'FNBR_Player_Prop_C_SetMaxHealth::MaxHealthDataTag' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetMaxHealth, CallFunc_HasAuthority_ReturnValue) == 0x000008, "Member 'FNBR_Player_Prop_C_SetMaxHealth::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetMaxHealth, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'FNBR_Player_Prop_C_SetMaxHealth::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetMaxHealth, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000018, "Member 'FNBR_Player_Prop_C_SetMaxHealth::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetMaxHealth, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'FNBR_Player_Prop_C_SetMaxHealth::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetMaxHealth, CallFunc_GetAbilitySystemComponent_ReturnValue_2) == 0x000028, "Member 'FNBR_Player_Prop_C_SetMaxHealth::CallFunc_GetAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetMaxHealth, CallFunc_GetAbilitySystemComponent_ReturnValue_3) == 0x000030, "Member 'FNBR_Player_Prop_C_SetMaxHealth::CallFunc_GetAbilitySystemComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetMaxHealth, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000038, "Member 'FNBR_Player_Prop_C_SetMaxHealth::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetMaxHealth, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000048, "Member 'FNBR_Player_Prop_C_SetMaxHealth::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetMaxHealth, CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue) == 0x000058, "Member 'FNBR_Player_Prop_C_SetMaxHealth::CallFunc_BP_ApplyGameplayEffectSpecToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetMaxHealth, CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000060, "Member 'FNBR_Player_Prop_C_SetMaxHealth::CallFunc_BP_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");

// Function FNBR_Player_Prop.FNBR_Player_Prop_C.SetCapsuleRadius
// 0x0014 (0x0014 - 0x0000)
struct FNBR_Player_Prop_C_SetCapsuleRadius final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FNBR_Player_Prop_C_SetCapsuleRadius) == 0x000004, "Wrong alignment on FNBR_Player_Prop_C_SetCapsuleRadius");
static_assert(sizeof(FNBR_Player_Prop_C_SetCapsuleRadius) == 0x000014, "Wrong size on FNBR_Player_Prop_C_SetCapsuleRadius");
static_assert(offsetof(FNBR_Player_Prop_C_SetCapsuleRadius, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'FNBR_Player_Prop_C_SetCapsuleRadius::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetCapsuleRadius, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'FNBR_Player_Prop_C_SetCapsuleRadius::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetCapsuleRadius, CallFunc_IsValid_ReturnValue_1) == 0x000008, "Member 'FNBR_Player_Prop_C_SetCapsuleRadius::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetCapsuleRadius, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000009, "Member 'FNBR_Player_Prop_C_SetCapsuleRadius::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetCapsuleRadius, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00000C, "Member 'FNBR_Player_Prop_C_SetCapsuleRadius::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetCapsuleRadius, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000010, "Member 'FNBR_Player_Prop_C_SetCapsuleRadius::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_SetCapsuleRadius, CallFunc_BooleanAND_ReturnValue) == 0x000011, "Member 'FNBR_Player_Prop_C_SetCapsuleRadius::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function FNBR_Player_Prop.FNBR_Player_Prop_C.ServerSetPlaced
// 0x0008 (0x0008 - 0x0000)
struct FNBR_Player_Prop_C_ServerSetPlaced final
{
public:
	bool                                          NewPlaced;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlacedYawOffset;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FNBR_Player_Prop_C_ServerSetPlaced) == 0x000004, "Wrong alignment on FNBR_Player_Prop_C_ServerSetPlaced");
static_assert(sizeof(FNBR_Player_Prop_C_ServerSetPlaced) == 0x000008, "Wrong size on FNBR_Player_Prop_C_ServerSetPlaced");
static_assert(offsetof(FNBR_Player_Prop_C_ServerSetPlaced, NewPlaced) == 0x000000, "Member 'FNBR_Player_Prop_C_ServerSetPlaced::NewPlaced' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_ServerSetPlaced, PlacedYawOffset) == 0x000004, "Member 'FNBR_Player_Prop_C_ServerSetPlaced::PlacedYawOffset' has a wrong offset!");

// Function FNBR_Player_Prop.FNBR_Player_Prop_C.ScaleLerp
// 0x0150 (0x0150 - 0x0000)
struct FNBR_Player_Prop_C_ScaleLerp final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetUnscaledCapsuleHalfHeight_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddActorWorldOffset_SweepHitResult;    // 0x0048(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FNBR_Player_Prop_C_ScaleLerp) == 0x000008, "Wrong alignment on FNBR_Player_Prop_C_ScaleLerp");
static_assert(sizeof(FNBR_Player_Prop_C_ScaleLerp) == 0x000150, "Wrong size on FNBR_Player_Prop_C_ScaleLerp");
static_assert(offsetof(FNBR_Player_Prop_C_ScaleLerp, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'FNBR_Player_Prop_C_ScaleLerp::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_ScaleLerp, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'FNBR_Player_Prop_C_ScaleLerp::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_ScaleLerp, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000002, "Member 'FNBR_Player_Prop_C_ScaleLerp::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_ScaleLerp, CallFunc_BreakVector_X) == 0x000004, "Member 'FNBR_Player_Prop_C_ScaleLerp::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_ScaleLerp, CallFunc_BreakVector_Y) == 0x000008, "Member 'FNBR_Player_Prop_C_ScaleLerp::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_ScaleLerp, CallFunc_BreakVector_Z) == 0x00000C, "Member 'FNBR_Player_Prop_C_ScaleLerp::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_ScaleLerp, CallFunc_GetUnscaledCapsuleHalfHeight_ReturnValue) == 0x000010, "Member 'FNBR_Player_Prop_C_ScaleLerp::CallFunc_GetUnscaledCapsuleHalfHeight_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_ScaleLerp, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000014, "Member 'FNBR_Player_Prop_C_ScaleLerp::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_ScaleLerp, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000018, "Member 'FNBR_Player_Prop_C_ScaleLerp::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_ScaleLerp, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'FNBR_Player_Prop_C_ScaleLerp::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_ScaleLerp, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000020, "Member 'FNBR_Player_Prop_C_ScaleLerp::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_ScaleLerp, CallFunc_MakeVector_ReturnValue) == 0x000028, "Member 'FNBR_Player_Prop_C_ScaleLerp::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_ScaleLerp, CallFunc_IsValid_ReturnValue_2) == 0x000040, "Member 'FNBR_Player_Prop_C_ScaleLerp::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_ScaleLerp, CallFunc_K2_AddActorWorldOffset_SweepHitResult) == 0x000048, "Member 'FNBR_Player_Prop_C_ScaleLerp::CallFunc_K2_AddActorWorldOffset_SweepHitResult' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_ScaleLerp, CallFunc_Add_FloatFloat_ReturnValue) == 0x000128, "Member 'FNBR_Player_Prop_C_ScaleLerp::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_ScaleLerp, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x00012C, "Member 'FNBR_Player_Prop_C_ScaleLerp::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_ScaleLerp, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000130, "Member 'FNBR_Player_Prop_C_ScaleLerp::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_ScaleLerp, CallFunc_VLerp_ReturnValue) == 0x000138, "Member 'FNBR_Player_Prop_C_ScaleLerp::CallFunc_VLerp_ReturnValue' has a wrong offset!");

// Function FNBR_Player_Prop.FNBR_Player_Prop_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct FNBR_Player_Prop_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FNBR_Player_Prop_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on FNBR_Player_Prop_C_ReceiveEndPlay");
static_assert(sizeof(FNBR_Player_Prop_C_ReceiveEndPlay) == 0x000001, "Wrong size on FNBR_Player_Prop_C_ReceiveEndPlay");
static_assert(offsetof(FNBR_Player_Prop_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'FNBR_Player_Prop_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function FNBR_Player_Prop.FNBR_Player_Prop_C.Play Prop Removed Sound
// 0x0028 (0x0028 - 0x0000)
struct FNBR_Player_Prop_C_Play_Prop_Removed_Sound final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FNBR_Player_Prop_C_Play_Prop_Removed_Sound) == 0x000008, "Wrong alignment on FNBR_Player_Prop_C_Play_Prop_Removed_Sound");
static_assert(sizeof(FNBR_Player_Prop_C_Play_Prop_Removed_Sound) == 0x000028, "Wrong size on FNBR_Player_Prop_C_Play_Prop_Removed_Sound");
static_assert(offsetof(FNBR_Player_Prop_C_Play_Prop_Removed_Sound, Temp_bool_Variable) == 0x000000, "Member 'FNBR_Player_Prop_C_Play_Prop_Removed_Sound::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_Play_Prop_Removed_Sound, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'FNBR_Player_Prop_C_Play_Prop_Removed_Sound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_Play_Prop_Removed_Sound, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000008, "Member 'FNBR_Player_Prop_C_Play_Prop_Removed_Sound::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_Play_Prop_Removed_Sound, CallFunc_IsDead_ReturnValue) == 0x000010, "Member 'FNBR_Player_Prop_C_Play_Prop_Removed_Sound::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_Play_Prop_Removed_Sound, K2Node_Select_Default) == 0x000018, "Member 'FNBR_Player_Prop_C_Play_Prop_Removed_Sound::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_Play_Prop_Removed_Sound, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000020, "Member 'FNBR_Player_Prop_C_Play_Prop_Removed_Sound::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");

// Function FNBR_Player_Prop.FNBR_Player_Prop_C.OnRep_SoundTimeRemaining
// 0x0050 (0x0050 - 0x0000)
struct FNBR_Player_Prop_C_OnRep_SoundTimeRemaining final
{
public:
	class AFortVolume*                            PlayerVolume;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortVolume*                            CurrentVolume;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortVolumeManager*                     CallFunc_GetVolumeManager_OutVolumeManager;        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVolumeValidityResult                         CallFunc_GetVolumeManager_OutIsValid;              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortVolume*                            CallFunc_GetVolumeForActor_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCreativeHUDLContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerState*                       CallFunc_GetOwningPlayerState_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortVolume*                            CallFunc_GetVolumeForPlayerState_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FNBR_Player_Prop_C_OnRep_SoundTimeRemaining) == 0x000008, "Wrong alignment on FNBR_Player_Prop_C_OnRep_SoundTimeRemaining");
static_assert(sizeof(FNBR_Player_Prop_C_OnRep_SoundTimeRemaining) == 0x000050, "Wrong size on FNBR_Player_Prop_C_OnRep_SoundTimeRemaining");
static_assert(offsetof(FNBR_Player_Prop_C_OnRep_SoundTimeRemaining, PlayerVolume) == 0x000000, "Member 'FNBR_Player_Prop_C_OnRep_SoundTimeRemaining::PlayerVolume' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_OnRep_SoundTimeRemaining, CurrentVolume) == 0x000008, "Member 'FNBR_Player_Prop_C_OnRep_SoundTimeRemaining::CurrentVolume' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_OnRep_SoundTimeRemaining, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'FNBR_Player_Prop_C_OnRep_SoundTimeRemaining::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_OnRep_SoundTimeRemaining, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000011, "Member 'FNBR_Player_Prop_C_OnRep_SoundTimeRemaining::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_OnRep_SoundTimeRemaining, CallFunc_GetVolumeManager_OutVolumeManager) == 0x000018, "Member 'FNBR_Player_Prop_C_OnRep_SoundTimeRemaining::CallFunc_GetVolumeManager_OutVolumeManager' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_OnRep_SoundTimeRemaining, CallFunc_GetVolumeManager_OutIsValid) == 0x000020, "Member 'FNBR_Player_Prop_C_OnRep_SoundTimeRemaining::CallFunc_GetVolumeManager_OutIsValid' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_OnRep_SoundTimeRemaining, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'FNBR_Player_Prop_C_OnRep_SoundTimeRemaining::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_OnRep_SoundTimeRemaining, CallFunc_GetVolumeForActor_ReturnValue) == 0x000028, "Member 'FNBR_Player_Prop_C_OnRep_SoundTimeRemaining::CallFunc_GetVolumeForActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_OnRep_SoundTimeRemaining, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'FNBR_Player_Prop_C_OnRep_SoundTimeRemaining::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_OnRep_SoundTimeRemaining, CallFunc_GetOwningPlayerState_ReturnValue) == 0x000038, "Member 'FNBR_Player_Prop_C_OnRep_SoundTimeRemaining::CallFunc_GetOwningPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_OnRep_SoundTimeRemaining, CallFunc_GetVolumeForPlayerState_ReturnValue) == 0x000040, "Member 'FNBR_Player_Prop_C_OnRep_SoundTimeRemaining::CallFunc_GetVolumeForPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(FNBR_Player_Prop_C_OnRep_SoundTimeRemaining, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'FNBR_Player_Prop_C_OnRep_SoundTimeRemaining::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function FNBR_Player_Prop.FNBR_Player_Prop_C.OnRep_FinalScale
// 0x0008 (0x0008 - 0x0000)
struct FNBR_Player_Prop_C_OnRep_FinalScale final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FNBR_Player_Prop_C_OnRep_FinalScale) == 0x000008, "Wrong alignment on FNBR_Player_Prop_C_OnRep_FinalScale");
static_assert(sizeof(FNBR_Player_Prop_C_OnRep_FinalScale) == 0x000008, "Wrong size on FNBR_Player_Prop_C_OnRep_FinalScale");
static_assert(offsetof(FNBR_Player_Prop_C_OnRep_FinalScale, CallFunc_K2_SetTimer_ReturnValue) == 0x000000, "Member 'FNBR_Player_Prop_C_OnRep_FinalScale::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function FNBR_Player_Prop.FNBR_Player_Prop_C.OnRep_CopiedProp
// 0x0148 (0x0148 - 0x0000)
struct FNBR_Player_Prop_C_OnRep_CopiedProp final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor_1;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorRelativeRotation_SweepHitResult; // 0x0028(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPrimitiveComponent*>            CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0110(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item;                           // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   K2Node_DynamicCast_AsStatic_Mesh_Component;        // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesMeshComponentHaveVisibleMaterial_ReturnValue; // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FNBR_Player_Prop_C_OnRep_CopiedProp) == 0x000008, "Wrong alignment on FNBR_Player_Prop_C_OnRep_CopiedProp");
static_assert(sizeof(FNBR_Player_Prop_C_OnRep_CopiedProp) == 0x000148, "Wrong size on FNBR_Player_Prop_C_OnRep_CopiedProp");
static_assert(offsetof(FNBR_Player_Prop_C_OnRep_CopiedProp, Temp_int_Array_Index_Variable) == 0x000000, "Member 'FNBR_Player_Prop_C_OnRep_CopiedProp::Temp_int_Array_Index_Variable' has a wrong offset!");
