#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FortAnimationBPFunctionLibrary

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "WindGustLocalSettingStruct_structs.hpp"
#include "GravityOverrideSettingStruct_structs.hpp"
#include "GravityOverrideParamsStruct_structs.hpp"
#include "WindGustSettingStruct_structs.hpp"
#include "ClothSettingStruct_structs.hpp"
#include "ClothCoreSettingStruct_structs.hpp"
#include "ClothParamsStruct_structs.hpp"
#include "WindGustParamsStruct_structs.hpp"


namespace SDK::Params
{

// Function FortAnimationBPFunctionLibrary.FortAnimationBPFunctionLibrary_C.WindGustGeneratorFunction
// 0x0168 (0x0168 - 0x0000)
struct FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWindGustSettingStruct                 GustSettings;                                      // 0x0008(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustLocalSettingStruct            ClothGustLocalSettings;                            // 0x0080(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0098(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GustStrength___WindVelocity;                       // 0x00A0(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustLocalSettingStruct            ClothGustLocalSettingsOut;                         // 0x00A4(0x0014)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ActualTime;                                        // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                GustDirectionWeightLocal;                          // 0x00C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ElapsedTimeLocal;                                  // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FinalGustStrengthLocal;                            // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GustDurationLocal;                                 // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GustStrengthLocal;                                 // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeBetweenGustsLocal;                             // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTimeLocal;                                    // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PerlinNoise1D_ReturnValue;                // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PerlinNoise1D_ReturnValue_1;              // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustLocalSettingStruct            K2Node_MakeStruct_WindGustLocalSettingStruct;      // 0x010C(0x0014)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_UnclampedLerp_Return_Value;               // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_1;                  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue_1;                // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_2;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_UnclampedLerp_Return_Value_1;             // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue_3;                  // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue_1;    // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloat_ReturnValue_2;                // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_UnclampedLerp_Return_Value_2;             // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction) == 0x000008, "Wrong alignment on FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction");
static_assert(sizeof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction) == 0x000168, "Wrong size on FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, DeltaTime) == 0x000000, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::DeltaTime' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, GustSettings) == 0x000008, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::GustSettings' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, ClothGustLocalSettings) == 0x000080, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::ClothGustLocalSettings' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, __WorldContext) == 0x000098, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::__WorldContext' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, GustStrength___WindVelocity) == 0x0000A0, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::GustStrength___WindVelocity' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, ClothGustLocalSettingsOut) == 0x0000A4, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::ClothGustLocalSettingsOut' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, ActualTime) == 0x0000B8, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::ActualTime' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, GustDirectionWeightLocal) == 0x0000C0, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::GustDirectionWeightLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, ElapsedTimeLocal) == 0x0000D8, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::ElapsedTimeLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, FinalGustStrengthLocal) == 0x0000DC, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::FinalGustStrengthLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, GustDurationLocal) == 0x0000E0, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::GustDurationLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, GustStrengthLocal) == 0x0000E4, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::GustStrengthLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, TimeBetweenGustsLocal) == 0x0000E8, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::TimeBetweenGustsLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, DeltaTimeLocal) == 0x0000EC, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::DeltaTimeLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x0000F0, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_PerlinNoise1D_ReturnValue) == 0x0000F4, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_PerlinNoise1D_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000F8, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_PerlinNoise1D_ReturnValue_1) == 0x0000FC, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_PerlinNoise1D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000100, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_RandomFloatInRange_ReturnValue) == 0x000104, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000108, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, K2Node_MakeStruct_WindGustLocalSettingStruct) == 0x00010C, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::K2Node_MakeStruct_WindGustLocalSettingStruct' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000120, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000124, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x000128, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00012C, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000130, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_FClamp_ReturnValue) == 0x000134, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_RandomFloat_ReturnValue) == 0x000138, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_UnclampedLerp_Return_Value) == 0x00013C, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_UnclampedLerp_Return_Value' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000140, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_FInterpTo_ReturnValue) == 0x000144, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_FInterpTo_ReturnValue_1) == 0x000148, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_FInterpTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_RandomFloat_ReturnValue_1) == 0x00014C, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_RandomFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_FInterpTo_ReturnValue_2) == 0x000150, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_FInterpTo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_UnclampedLerp_Return_Value_1) == 0x000154, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_UnclampedLerp_Return_Value_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_FInterpTo_ReturnValue_3) == 0x000158, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_FInterpTo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_GreaterEqual_FloatFloat_ReturnValue_1) == 0x00015C, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_GreaterEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_RandomFloat_ReturnValue_2) == 0x000160, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_RandomFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction, CallFunc_UnclampedLerp_Return_Value_2) == 0x000164, "Member 'FortAnimationBPFunctionLibrary_C_WindGustGeneratorFunction::CallFunc_UnclampedLerp_Return_Value_2' has a wrong offset!");

// Function FortAnimationBPFunctionLibrary.FortAnimationBPFunctionLibrary_C.Wind Gust Control Function
// 0x01C8 (0x01C8 - 0x0000)
struct FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function final
{
public:
	class UCustomCharacterPartAnimInstance*       CharacterPartAnimInstance;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTime;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GameTimeinSeconds;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   JointName;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWindGustSettingStruct                 WindGustSettings;                                  // 0x0018(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustLocalSettingStruct            WindGustLocalSettings;                             // 0x0090(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x00A8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GustStrengthWindVelocity_Out;                      // 0x00B0(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustLocalSettingStruct            WindGustLocalSettingsOut;                          // 0x00C8(0x0014)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                GustStrength___WindVelocityLocal;                  // 0x00E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustSettingStruct                 K2Node_MakeStruct_WindGustSettingStruct;           // 0x0100(0x0078)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_WindGustGeneratorFunction_GustStrength___WindVelocity; // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWindGustLocalSettingStruct            CallFunc_WindGustGeneratorFunction_ClothGustLocalSettingsOut; // 0x0180(0x0014)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Random_Vector_Function_VectorOut;         // 0x0198(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function) == 0x000008, "Wrong alignment on FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function");
static_assert(sizeof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function) == 0x0001C8, "Wrong size on FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, CharacterPartAnimInstance) == 0x000000, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::CharacterPartAnimInstance' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, DeltaTime) == 0x000008, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::DeltaTime' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, GameTimeinSeconds) == 0x00000C, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::GameTimeinSeconds' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, JointName) == 0x000010, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::JointName' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, WindGustSettings) == 0x000018, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::WindGustSettings' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, WindGustLocalSettings) == 0x000090, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::WindGustLocalSettings' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, __WorldContext) == 0x0000A8, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::__WorldContext' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, GustStrengthWindVelocity_Out) == 0x0000B0, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::GustStrengthWindVelocity_Out' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, WindGustLocalSettingsOut) == 0x0000C8, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::WindGustLocalSettingsOut' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, GustStrength___WindVelocityLocal) == 0x0000E0, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::GustStrength___WindVelocityLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x0000F8, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, K2Node_MakeStruct_WindGustSettingStruct) == 0x000100, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::K2Node_MakeStruct_WindGustSettingStruct' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, CallFunc_IsValid_ReturnValue) == 0x000178, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, CallFunc_WindGustGeneratorFunction_GustStrength___WindVelocity) == 0x00017C, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::CallFunc_WindGustGeneratorFunction_GustStrength___WindVelocity' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, CallFunc_WindGustGeneratorFunction_ClothGustLocalSettingsOut) == 0x000180, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::CallFunc_WindGustGeneratorFunction_ClothGustLocalSettingsOut' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, CallFunc_Random_Vector_Function_VectorOut) == 0x000198, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::CallFunc_Random_Vector_Function_VectorOut' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001B0, "Member 'FortAnimationBPFunctionLibrary_C_Wind_Gust_Control_Function::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function FortAnimationBPFunctionLibrary.FortAnimationBPFunctionLibrary_C.Set Transformation Montage
// 0x0028 (0x0028 - 0x0000)
struct FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage final
{
public:
	class AFortPlayerPawn*                        FortPlayerPawn;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartTime;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage) == 0x000008, "Wrong alignment on FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage");
static_assert(sizeof(FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage) == 0x000028, "Wrong size on FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage, FortPlayerPawn) == 0x000000, "Member 'FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage::FortPlayerPawn' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage, Montage) == 0x000008, "Member 'FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage::Montage' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage, StartTime) == 0x000010, "Member 'FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage::StartTime' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage, __WorldContext) == 0x000018, "Member 'FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage::__WorldContext' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'FortAnimationBPFunctionLibrary_C_Set_Transformation_Montage::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function FortAnimationBPFunctionLibrary.FortAnimationBPFunctionLibrary_C.Scale Joint Rotation Function
// 0x0150 (0x0150 - 0x0000)
struct FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function final
{
public:
	struct FRotator                               Scale;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class FName                                   TargetBone;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReferenceBone;                                     // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkinnedMeshComponent*                  SkelMeshComponent;                                 // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               FinalRotation;                                     // 0x0030(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               OriginalRotation;                                  // 0x0048(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetDeltaTransformFromRefPose_ReturnValue; // 0x0070(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function) == 0x000010, "Wrong alignment on FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function");
static_assert(sizeof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function) == 0x000150, "Wrong size on FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, Scale) == 0x000000, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::Scale' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, TargetBone) == 0x000018, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::TargetBone' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, ReferenceBone) == 0x00001C, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::ReferenceBone' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, SkelMeshComponent) == 0x000020, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::SkelMeshComponent' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, __WorldContext) == 0x000028, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::__WorldContext' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, FinalRotation) == 0x000030, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::FinalRotation' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, OriginalRotation) == 0x000048, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::OriginalRotation' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, CallFunc_BreakRotator_Roll) == 0x000060, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, CallFunc_BreakRotator_Pitch) == 0x000064, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, CallFunc_BreakRotator_Yaw) == 0x000068, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, CallFunc_GetDeltaTransformFromRefPose_ReturnValue) == 0x000070, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::CallFunc_GetDeltaTransformFromRefPose_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, CallFunc_BreakTransform_Location) == 0x0000D0, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, CallFunc_BreakTransform_Rotation) == 0x0000E8, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, CallFunc_BreakTransform_Scale) == 0x000100, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, CallFunc_BreakRotator_Roll_1) == 0x000118, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, CallFunc_BreakRotator_Pitch_1) == 0x00011C, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, CallFunc_BreakRotator_Yaw_1) == 0x000120, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000124, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000128, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00012C, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function, CallFunc_MakeRotator_ReturnValue) == 0x000130, "Member 'FortAnimationBPFunctionLibrary_C_Scale_Joint_Rotation_Function::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");

// Function FortAnimationBPFunctionLibrary.FortAnimationBPFunctionLibrary_C.RandomRotatorFunction
// 0x00B0 (0x00B0 - 0x0000)
struct FortAnimationBPFunctionLibrary_C_RandomRotatorFunction final
{
public:
	float                                         GameTimeinSeconds;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PerlinScale;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Frequency;                                         // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               Amplitude;                                         // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               Offset;                                            // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         TimeOffset;                                        // 0x0050(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0058(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RandomRotator;                                     // 0x0060(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         PerlinScaleLocal;                                  // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               HairRotator_01;                                    // 0x0080(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_GetRandomWindRotator_ReturnValue;         // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FortAnimationBPFunctionLibrary_C_RandomRotatorFunction) == 0x000008, "Wrong alignment on FortAnimationBPFunctionLibrary_C_RandomRotatorFunction");
static_assert(sizeof(FortAnimationBPFunctionLibrary_C_RandomRotatorFunction) == 0x0000B0, "Wrong size on FortAnimationBPFunctionLibrary_C_RandomRotatorFunction");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_RandomRotatorFunction, GameTimeinSeconds) == 0x000000, "Member 'FortAnimationBPFunctionLibrary_C_RandomRotatorFunction::GameTimeinSeconds' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_RandomRotatorFunction, PerlinScale) == 0x000004, "Member 'FortAnimationBPFunctionLibrary_C_RandomRotatorFunction::PerlinScale' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_RandomRotatorFunction, Frequency) == 0x000008, "Member 'FortAnimationBPFunctionLibrary_C_RandomRotatorFunction::Frequency' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_RandomRotatorFunction, Amplitude) == 0x000020, "Member 'FortAnimationBPFunctionLibrary_C_RandomRotatorFunction::Amplitude' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_RandomRotatorFunction, Offset) == 0x000038, "Member 'FortAnimationBPFunctionLibrary_C_RandomRotatorFunction::Offset' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_RandomRotatorFunction, TimeOffset) == 0x000050, "Member 'FortAnimationBPFunctionLibrary_C_RandomRotatorFunction::TimeOffset' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_RandomRotatorFunction, __WorldContext) == 0x000058, "Member 'FortAnimationBPFunctionLibrary_C_RandomRotatorFunction::__WorldContext' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_RandomRotatorFunction, RandomRotator) == 0x000060, "Member 'FortAnimationBPFunctionLibrary_C_RandomRotatorFunction::RandomRotator' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_RandomRotatorFunction, PerlinScaleLocal) == 0x000078, "Member 'FortAnimationBPFunctionLibrary_C_RandomRotatorFunction::PerlinScaleLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_RandomRotatorFunction, HairRotator_01) == 0x000080, "Member 'FortAnimationBPFunctionLibrary_C_RandomRotatorFunction::HairRotator_01' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_RandomRotatorFunction, CallFunc_GetRandomWindRotator_ReturnValue) == 0x000098, "Member 'FortAnimationBPFunctionLibrary_C_RandomRotatorFunction::CallFunc_GetRandomWindRotator_ReturnValue' has a wrong offset!");

// Function FortAnimationBPFunctionLibrary.FortAnimationBPFunctionLibrary_C.Random Vector Function
// 0x0128 (0x0128 - 0x0000)
struct FortAnimationBPFunctionLibrary_C_Random_Vector_Function final
{
public:
	class UCustomCharacterPartAnimInstance*       CharacterPartAnimInstance;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UMeshComponent*                   SkelMeshComponent;                                 // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   JointName;                                         // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GameTimeinSeconds;                                 // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeOffset;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PerlinScale;                                       // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Frequency;                                         // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Amplitude;                                         // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x0050(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VectorOut;                                         // 0x0070(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VectorOut_Code;                                    // 0x0088(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PerlinScaleLocal;                                  // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                UpVectorLocal;                                     // 0x00A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RightVectorLocal;                                  // 0x00C0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ForwardVectorLocal;                                // 0x00D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   JointNameLocal;                                    // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetRandomWindVector_ReturnValue;          // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_AlignVectorWithJoint_ReturnValue;         // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function) == 0x000008, "Wrong alignment on FortAnimationBPFunctionLibrary_C_Random_Vector_Function");
static_assert(sizeof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function) == 0x000128, "Wrong size on FortAnimationBPFunctionLibrary_C_Random_Vector_Function");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function, CharacterPartAnimInstance) == 0x000000, "Member 'FortAnimationBPFunctionLibrary_C_Random_Vector_Function::CharacterPartAnimInstance' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function, SkelMeshComponent) == 0x000008, "Member 'FortAnimationBPFunctionLibrary_C_Random_Vector_Function::SkelMeshComponent' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function, JointName) == 0x000010, "Member 'FortAnimationBPFunctionLibrary_C_Random_Vector_Function::JointName' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function, GameTimeinSeconds) == 0x000014, "Member 'FortAnimationBPFunctionLibrary_C_Random_Vector_Function::GameTimeinSeconds' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function, TimeOffset) == 0x000018, "Member 'FortAnimationBPFunctionLibrary_C_Random_Vector_Function::TimeOffset' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function, PerlinScale) == 0x00001C, "Member 'FortAnimationBPFunctionLibrary_C_Random_Vector_Function::PerlinScale' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function, Frequency) == 0x000020, "Member 'FortAnimationBPFunctionLibrary_C_Random_Vector_Function::Frequency' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function, Amplitude) == 0x000038, "Member 'FortAnimationBPFunctionLibrary_C_Random_Vector_Function::Amplitude' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function, Offset) == 0x000050, "Member 'FortAnimationBPFunctionLibrary_C_Random_Vector_Function::Offset' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function, __WorldContext) == 0x000068, "Member 'FortAnimationBPFunctionLibrary_C_Random_Vector_Function::__WorldContext' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function, VectorOut) == 0x000070, "Member 'FortAnimationBPFunctionLibrary_C_Random_Vector_Function::VectorOut' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function, VectorOut_Code) == 0x000088, "Member 'FortAnimationBPFunctionLibrary_C_Random_Vector_Function::VectorOut_Code' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function, PerlinScaleLocal) == 0x0000A0, "Member 'FortAnimationBPFunctionLibrary_C_Random_Vector_Function::PerlinScaleLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function, UpVectorLocal) == 0x0000A8, "Member 'FortAnimationBPFunctionLibrary_C_Random_Vector_Function::UpVectorLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function, RightVectorLocal) == 0x0000C0, "Member 'FortAnimationBPFunctionLibrary_C_Random_Vector_Function::RightVectorLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function, ForwardVectorLocal) == 0x0000D8, "Member 'FortAnimationBPFunctionLibrary_C_Random_Vector_Function::ForwardVectorLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function, JointNameLocal) == 0x0000F0, "Member 'FortAnimationBPFunctionLibrary_C_Random_Vector_Function::JointNameLocal' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function, CallFunc_GetRandomWindVector_ReturnValue) == 0x0000F8, "Member 'FortAnimationBPFunctionLibrary_C_Random_Vector_Function::CallFunc_GetRandomWindVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(FortAnimationBPFunctionLibrary_C_Random_Vector_Function, CallFunc_AlignVectorWithJoint_ReturnValue) == 0x000110, "Member 'FortAnimationBPFunctionLibrary_C_Random_Vector_Function::CallFunc_AlignVectorWithJoint_ReturnValue' has a wrong offset!");

// Function FortAnimationBPFunctionLibrary.FortAnimationBPFunctionLibrary_C.Player Movement Function
// 0x01C0 (0x01C0 - 0x0000)
struct FortAnimationBPFunctionLibrary_C_Player_Movement_Function final
{
public:
	class UCustomCharacterPartAnimInstance*       CharacterPartAnimInstance;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         X_Dot_Product;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Y_Dot_Product;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Z_Dot_Product;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawDebug;                                         // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Debug_Scalar;                                      // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         X_Movement;                                        // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Y_Movement;                                        // 0x002C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Z_Movement;                                        // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugDrawLocal;                                    // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        Pawn;                                              // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
