#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Overshield_OnElim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Overshield_OnElim.GA_Athena_Overshield_OnElim_C
// 0x0038 (0x0B48 - 0x0B10)
class UGA_Athena_Overshield_OnElim_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FScalableFloat                         Row_OvershieldHealOnKillEnabled;                   // 0x0B18(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSubclassOf<class UGameplayEffect>            GE_OvershieldOnElim;                               // 0x0B40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_Overshield_OnElim(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

	bool K2_ShouldAbilityRespondToEvent(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayEventData& Payload) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Overshield_OnElim_C">();
	}
	static class UGA_Athena_Overshield_OnElim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Overshield_OnElim_C>();
	}
};
static_assert(alignof(UGA_Athena_Overshield_OnElim_C) == 0x000008, "Wrong alignment on UGA_Athena_Overshield_OnElim_C");
static_assert(sizeof(UGA_Athena_Overshield_OnElim_C) == 0x000B48, "Wrong size on UGA_Athena_Overshield_OnElim_C");
static_assert(offsetof(UGA_Athena_Overshield_OnElim_C, UberGraphFrame) == 0x000B10, "Member 'UGA_Athena_Overshield_OnElim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Overshield_OnElim_C, Row_OvershieldHealOnKillEnabled) == 0x000B18, "Member 'UGA_Athena_Overshield_OnElim_C::Row_OvershieldHealOnKillEnabled' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Overshield_OnElim_C, GE_OvershieldOnElim) == 0x000B40, "Member 'UGA_Athena_Overshield_OnElim_C::GE_OvershieldOnElim' has a wrong offset!");

}

