#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_PushCannon_Launched

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_PushCannon_Launched.GA_Athena_PushCannon_Launched_C
// 0x01C0 (0x0CD0 - 0x0B10)
class UGA_Athena_PushCannon_Launched_C : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawnAthena*                  PlayerPawn;                                        // 0x0B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 BuildingDestroyGE;                                 // 0x0B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         JumpHitActors;                                     // 0x0B28(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class AActor*                                 HitActor;                                          // 0x0B38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      DestroyObjectTypes;                                // 0x0B40(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         CapsuleRadius;                                     // 0x0B50(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         CapsuleHalfHeight;                                 // 0x0B78(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         TraceFrames;                                       // 0x0BA0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           BuildingDestroyTImer;                              // 0x0BC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bLaunchAreaClear;                                  // 0x0BD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD1[0x7];                                      // 0x0BD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           LaunchAreaClearedTimer;                            // 0x0BD8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bLostVelocity;                                     // 0x0BE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE1[0x7];                                      // 0x0BE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TimeoutTimer;                                      // 0x0BE8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         EnemyLaunchVelocity;                               // 0x0BF0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         LaunchAreaClearDuration;                           // 0x0C18(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         SelfVerticalLaunchVelocity;                        // 0x0C40(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         TimeoutDuration;                                   // 0x0C68(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UFortAbilitySystemComponent*            AbilitySystem;                                     // 0x0C90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  BlockedAbilityTags;                                // 0x0C98(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           ImpactCue;                                         // 0x0CB8(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CBC[0x4];                                      // 0x0CBC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CameraMode;                                        // 0x0CC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CachedCapsuleHalfHeight;                           // 0x0CC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Added_715F2B30452EBB839367119D3A1B6445();
	void Added_74E690AA4209E56B6BDC5280CEF22793();
	void Added_A033A6444327E99E70C51D9018F18A99();
	void Added_AA4435524A5F25B2A1B6A3A7C2AC4A51();
	void Added_F869432243D6BCC62CC6ECA789CE3790();
	void Cancelled_C23371DD49EDDDD9B7E2DBBD6D21F80F(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void CheckForInvalidState();
	void DestroyBuilding(TArray<struct FHitResult>& BuildingActor, bool DestroySingleBuilding);
	void DoExplosionAndKnockback();
	void EventOnHit(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void EventOnLanded(const struct FHitResult& Hit);
	void EventReceived_132DF0F04DF553962D727EAABF3CBB6B(const struct FGameplayEventData& Payload);
	void EventReceived_C1807F4F442EEEDB13429195080B6F67(const struct FGameplayEventData& Payload);
	void EventReceived_D675E5FB4FE04EAA900E2382B2BEC6D4(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_Athena_PushCannon_Launched(int32 EntryPoint);
	void FailedToActivatePassiveAbility();
	void HandleCollision(const struct FVector& Normal);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void ResetCollision();
	void SetLaunchAreaCleared();
	void ShrinkCollision(class ACharacter* PlayerPawn_0);
	void Targeted_C23371DD49EDDDD9B7E2DBBD6D21F80F(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void TimeoutEndAbility();
	void Trace_ON();
	void WatchForEndEvents();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_PushCannon_Launched_C">();
	}
	static class UGA_Athena_PushCannon_Launched_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_PushCannon_Launched_C>();
	}
};
static_assert(alignof(UGA_Athena_PushCannon_Launched_C) == 0x000008, "Wrong alignment on UGA_Athena_PushCannon_Launched_C");
static_assert(sizeof(UGA_Athena_PushCannon_Launched_C) == 0x000CD0, "Wrong size on UGA_Athena_PushCannon_Launched_C");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, UberGraphFrame) == 0x000B10, "Member 'UGA_Athena_PushCannon_Launched_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, PlayerPawn) == 0x000B18, "Member 'UGA_Athena_PushCannon_Launched_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, BuildingDestroyGE) == 0x000B20, "Member 'UGA_Athena_PushCannon_Launched_C::BuildingDestroyGE' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, JumpHitActors) == 0x000B28, "Member 'UGA_Athena_PushCannon_Launched_C::JumpHitActors' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, HitActor) == 0x000B38, "Member 'UGA_Athena_PushCannon_Launched_C::HitActor' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, DestroyObjectTypes) == 0x000B40, "Member 'UGA_Athena_PushCannon_Launched_C::DestroyObjectTypes' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, CapsuleRadius) == 0x000B50, "Member 'UGA_Athena_PushCannon_Launched_C::CapsuleRadius' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, CapsuleHalfHeight) == 0x000B78, "Member 'UGA_Athena_PushCannon_Launched_C::CapsuleHalfHeight' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, TraceFrames) == 0x000BA0, "Member 'UGA_Athena_PushCannon_Launched_C::TraceFrames' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, BuildingDestroyTImer) == 0x000BC8, "Member 'UGA_Athena_PushCannon_Launched_C::BuildingDestroyTImer' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, bLaunchAreaClear) == 0x000BD0, "Member 'UGA_Athena_PushCannon_Launched_C::bLaunchAreaClear' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, LaunchAreaClearedTimer) == 0x000BD8, "Member 'UGA_Athena_PushCannon_Launched_C::LaunchAreaClearedTimer' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, bLostVelocity) == 0x000BE0, "Member 'UGA_Athena_PushCannon_Launched_C::bLostVelocity' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, TimeoutTimer) == 0x000BE8, "Member 'UGA_Athena_PushCannon_Launched_C::TimeoutTimer' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, EnemyLaunchVelocity) == 0x000BF0, "Member 'UGA_Athena_PushCannon_Launched_C::EnemyLaunchVelocity' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, LaunchAreaClearDuration) == 0x000C18, "Member 'UGA_Athena_PushCannon_Launched_C::LaunchAreaClearDuration' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, SelfVerticalLaunchVelocity) == 0x000C40, "Member 'UGA_Athena_PushCannon_Launched_C::SelfVerticalLaunchVelocity' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, TimeoutDuration) == 0x000C68, "Member 'UGA_Athena_PushCannon_Launched_C::TimeoutDuration' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, AbilitySystem) == 0x000C90, "Member 'UGA_Athena_PushCannon_Launched_C::AbilitySystem' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, BlockedAbilityTags) == 0x000C98, "Member 'UGA_Athena_PushCannon_Launched_C::BlockedAbilityTags' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, ImpactCue) == 0x000CB8, "Member 'UGA_Athena_PushCannon_Launched_C::ImpactCue' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, CameraMode) == 0x000CC0, "Member 'UGA_Athena_PushCannon_Launched_C::CameraMode' has a wrong offset!");
static_assert(offsetof(UGA_Athena_PushCannon_Launched_C, CachedCapsuleHalfHeight) == 0x000CC8, "Member 'UGA_Athena_PushCannon_Launched_C::CachedCapsuleHalfHeight' has a wrong offset!");

}

