#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_PushCannon_Launched

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_PushCannon_Launched.GA_Athena_PushCannon_Launched_C.Cancelled_C23371DD49EDDDD9B7E2DBBD6D21F80F
// 0x0030 (0x0030 - 0x0000)
struct GA_Athena_PushCannon_Launched_C_Cancelled_C23371DD49EDDDD9B7E2DBBD6D21F80F final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_PushCannon_Launched_C_Cancelled_C23371DD49EDDDD9B7E2DBBD6D21F80F) == 0x000008, "Wrong alignment on GA_Athena_PushCannon_Launched_C_Cancelled_C23371DD49EDDDD9B7E2DBBD6D21F80F");
static_assert(sizeof(GA_Athena_PushCannon_Launched_C_Cancelled_C23371DD49EDDDD9B7E2DBBD6D21F80F) == 0x000030, "Wrong size on GA_Athena_PushCannon_Launched_C_Cancelled_C23371DD49EDDDD9B7E2DBBD6D21F80F");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_Cancelled_C23371DD49EDDDD9B7E2DBBD6D21F80F, TargetData) == 0x000000, "Member 'GA_Athena_PushCannon_Launched_C_Cancelled_C23371DD49EDDDD9B7E2DBBD6D21F80F::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_Cancelled_C23371DD49EDDDD9B7E2DBBD6D21F80F, ApplicationTag) == 0x000028, "Member 'GA_Athena_PushCannon_Launched_C_Cancelled_C23371DD49EDDDD9B7E2DBBD6D21F80F::ApplicationTag' has a wrong offset!");

// Function GA_Athena_PushCannon_Launched.GA_Athena_PushCannon_Launched_C.DestroyBuilding
// 0x0278 (0x0278 - 0x0000)
struct GA_Athena_PushCannon_Launched_C_DestroyBuilding final
{
public:
	TArray<struct FHitResult>                     BuildingActor;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          DestroySingleBuilding;                             // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BuildingPieceDestroyed;                            // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0028(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E6[0x2];                                      // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01E8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAthenaBarrierObjective*                K2Node_DynamicCast_AsAthena_Barrier_Objective;     // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckActorHasTags_bDidActorHaveTags; // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_222[0x6];                                      // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0230(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AAthenaCreativeRift*                    K2Node_DynamicCast_AsAthena_Creative_Rift;         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAthena_Prop_ParentBuildingContainerBlueprint_C* K2Node_DynamicCast_AsAthena_Prop_Parent_Building_Container_Blueprint; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingProp*                          K2Node_DynamicCast_AsBuilding_Prop;                // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_PushCannon_Launched_C_DestroyBuilding) == 0x000008, "Wrong alignment on GA_Athena_PushCannon_Launched_C_DestroyBuilding");
static_assert(sizeof(GA_Athena_PushCannon_Launched_C_DestroyBuilding) == 0x000278, "Wrong size on GA_Athena_PushCannon_Launched_C_DestroyBuilding");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, BuildingActor) == 0x000000, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::BuildingActor' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, DestroySingleBuilding) == 0x000010, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::DestroySingleBuilding' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, BuildingPieceDestroyed) == 0x000011, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::BuildingPieceDestroyed' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_Array_Length_ReturnValue_1) == 0x000018, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, Temp_bool_True_if_break_was_hit_Variable) == 0x00001C, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_Greater_IntInt_ReturnValue) == 0x00001D, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_Not_PreBool_ReturnValue) == 0x00001E, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, Temp_int_Array_Index_Variable) == 0x000020, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_Array_Get_Item) == 0x000028, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BreakHitResult_bBlockingHit) == 0x000108, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BreakHitResult_bInitialOverlap) == 0x000109, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BreakHitResult_Time) == 0x00010C, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BreakHitResult_Distance) == 0x000110, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BreakHitResult_Location) == 0x000118, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BreakHitResult_ImpactPoint) == 0x000130, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BreakHitResult_Normal) == 0x000148, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BreakHitResult_ImpactNormal) == 0x000160, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BreakHitResult_PhysMat) == 0x000178, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BreakHitResult_HitActor) == 0x000180, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BreakHitResult_HitComponent) == 0x000188, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BreakHitResult_HitBoneName) == 0x000190, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BreakHitResult_BoneName) == 0x000194, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BreakHitResult_HitItem) == 0x000198, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BreakHitResult_ElementIndex) == 0x00019C, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BreakHitResult_FaceIndex) == 0x0001A0, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BreakHitResult_TraceStart) == 0x0001A8, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BreakHitResult_TraceEnd) == 0x0001C0, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, Temp_int_Loop_Counter_Variable) == 0x0001D8, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_Less_IntInt_ReturnValue) == 0x0001DC, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_Add_IntInt_ReturnValue) == 0x0001E0, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BooleanAND_ReturnValue) == 0x0001E4, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BooleanAND_ReturnValue_1) == 0x0001E5, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, K2Node_CreateDelegate_OutputDelegate) == 0x0001E8, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BooleanAND_ReturnValue_2) == 0x0001F4, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001F8, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000200, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000208, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_Array_Add_ReturnValue) == 0x000210, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, K2Node_DynamicCast_AsAthena_Barrier_Objective) == 0x000218, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::K2Node_DynamicCast_AsAthena_Barrier_Objective' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, K2Node_DynamicCast_bSuccess) == 0x000220, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_Athena_CheckActorHasTags_bDidActorHaveTags) == 0x000221, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_Athena_CheckActorHasTags_bDidActorHaveTags' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000228, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000230, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, K2Node_DynamicCast_AsAthena_Creative_Rift) == 0x000238, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::K2Node_DynamicCast_AsAthena_Creative_Rift' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, K2Node_DynamicCast_bSuccess_1) == 0x000240, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, K2Node_DynamicCast_AsBuilding_Actor) == 0x000248, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, K2Node_DynamicCast_bSuccess_2) == 0x000250, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, K2Node_DynamicCast_AsAthena_Prop_Parent_Building_Container_Blueprint) == 0x000258, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::K2Node_DynamicCast_AsAthena_Prop_Parent_Building_Container_Blueprint' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, K2Node_DynamicCast_bSuccess_3) == 0x000260, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, K2Node_DynamicCast_AsBuilding_Prop) == 0x000268, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::K2Node_DynamicCast_AsBuilding_Prop' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_DestroyBuilding, K2Node_DynamicCast_bSuccess_4) == 0x000270, "Member 'GA_Athena_PushCannon_Launched_C_DestroyBuilding::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");

// Function GA_Athena_PushCannon_Launched.GA_Athena_PushCannon_Launched_C.EventOnHit
// 0x0108 (0x0108 - 0x0000)
struct GA_Athena_PushCannon_Launched_C_EventOnHit final
{
public:
	class AActor*                                 SelfActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0010(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0028(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GA_Athena_PushCannon_Launched_C_EventOnHit) == 0x000008, "Wrong alignment on GA_Athena_PushCannon_Launched_C_EventOnHit");
static_assert(sizeof(GA_Athena_PushCannon_Launched_C_EventOnHit) == 0x000108, "Wrong size on GA_Athena_PushCannon_Launched_C_EventOnHit");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_EventOnHit, SelfActor) == 0x000000, "Member 'GA_Athena_PushCannon_Launched_C_EventOnHit::SelfActor' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_EventOnHit, OtherActor) == 0x000008, "Member 'GA_Athena_PushCannon_Launched_C_EventOnHit::OtherActor' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_EventOnHit, NormalImpulse) == 0x000010, "Member 'GA_Athena_PushCannon_Launched_C_EventOnHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_EventOnHit, Hit) == 0x000028, "Member 'GA_Athena_PushCannon_Launched_C_EventOnHit::Hit' has a wrong offset!");

// Function GA_Athena_PushCannon_Launched.GA_Athena_PushCannon_Launched_C.EventOnLanded
// 0x00E0 (0x00E0 - 0x0000)
struct GA_Athena_PushCannon_Launched_C_EventOnLanded final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GA_Athena_PushCannon_Launched_C_EventOnLanded) == 0x000008, "Wrong alignment on GA_Athena_PushCannon_Launched_C_EventOnLanded");
static_assert(sizeof(GA_Athena_PushCannon_Launched_C_EventOnLanded) == 0x0000E0, "Wrong size on GA_Athena_PushCannon_Launched_C_EventOnLanded");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_EventOnLanded, Hit) == 0x000000, "Member 'GA_Athena_PushCannon_Launched_C_EventOnLanded::Hit' has a wrong offset!");

// Function GA_Athena_PushCannon_Launched.GA_Athena_PushCannon_Launched_C.EventReceived_132DF0F04DF553962D727EAABF3CBB6B
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_PushCannon_Launched_C_EventReceived_132DF0F04DF553962D727EAABF3CBB6B final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Athena_PushCannon_Launched_C_EventReceived_132DF0F04DF553962D727EAABF3CBB6B) == 0x000008, "Wrong alignment on GA_Athena_PushCannon_Launched_C_EventReceived_132DF0F04DF553962D727EAABF3CBB6B");
static_assert(sizeof(GA_Athena_PushCannon_Launched_C_EventReceived_132DF0F04DF553962D727EAABF3CBB6B) == 0x0000B0, "Wrong size on GA_Athena_PushCannon_Launched_C_EventReceived_132DF0F04DF553962D727EAABF3CBB6B");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_EventReceived_132DF0F04DF553962D727EAABF3CBB6B, Payload) == 0x000000, "Member 'GA_Athena_PushCannon_Launched_C_EventReceived_132DF0F04DF553962D727EAABF3CBB6B::Payload' has a wrong offset!");

// Function GA_Athena_PushCannon_Launched.GA_Athena_PushCannon_Launched_C.EventReceived_C1807F4F442EEEDB13429195080B6F67
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_PushCannon_Launched_C_EventReceived_C1807F4F442EEEDB13429195080B6F67 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Athena_PushCannon_Launched_C_EventReceived_C1807F4F442EEEDB13429195080B6F67) == 0x000008, "Wrong alignment on GA_Athena_PushCannon_Launched_C_EventReceived_C1807F4F442EEEDB13429195080B6F67");
static_assert(sizeof(GA_Athena_PushCannon_Launched_C_EventReceived_C1807F4F442EEEDB13429195080B6F67) == 0x0000B0, "Wrong size on GA_Athena_PushCannon_Launched_C_EventReceived_C1807F4F442EEEDB13429195080B6F67");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_EventReceived_C1807F4F442EEEDB13429195080B6F67, Payload) == 0x000000, "Member 'GA_Athena_PushCannon_Launched_C_EventReceived_C1807F4F442EEEDB13429195080B6F67::Payload' has a wrong offset!");

// Function GA_Athena_PushCannon_Launched.GA_Athena_PushCannon_Launched_C.EventReceived_D675E5FB4FE04EAA900E2382B2BEC6D4
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_PushCannon_Launched_C_EventReceived_D675E5FB4FE04EAA900E2382B2BEC6D4 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Athena_PushCannon_Launched_C_EventReceived_D675E5FB4FE04EAA900E2382B2BEC6D4) == 0x000008, "Wrong alignment on GA_Athena_PushCannon_Launched_C_EventReceived_D675E5FB4FE04EAA900E2382B2BEC6D4");
static_assert(sizeof(GA_Athena_PushCannon_Launched_C_EventReceived_D675E5FB4FE04EAA900E2382B2BEC6D4) == 0x0000B0, "Wrong size on GA_Athena_PushCannon_Launched_C_EventReceived_D675E5FB4FE04EAA900E2382B2BEC6D4");
static_assert(offsetof(GA_Athena_PushCannon_Launched_C_EventReceived_D675E5FB4FE04EAA900E2382B2BEC6D4, Payload) == 0x000000, "Member 'GA_Athena_PushCannon_Launched_C_EventReceived_D675E5FB4FE04EAA900E2382B2BEC6D4::Payload' has a wrong offset!");

// Function GA_Athena_PushCannon_Launched.GA_Athena_PushCannon_Launched_C.ExecuteUbergraph_GA_Athena_PushCannon_Launched
// 0x0BB8 (0x0BB8 - 0x0000)
struct GA_Athena_PushCannon_Launched_C_ExecuteUbergraph_GA_Athena_PushCannon_Launched final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_2;                      // 0x0008(0x00B0)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;              // 0x00B8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00C8(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0184(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0198(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x01A8(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable_1;                            // 0x0258(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0314(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_1;         // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0328(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_2;         // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0340(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34D[0x3];                                      // 0x034D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0350(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable_2;                            // 0x0400(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_2;          // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B9[0x3];                                      // 0x04B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x04BC(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x04C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x04D0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_3;         // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x04E8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x04F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F5[0x3];                                      // 0x04F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_4;         // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x3];                                      // 0x0501(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0520(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            K2Node_DynamicCast_AsFort_Ability_System_Component; // 0x0528(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0531(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_532[0x2];                                      // 0x0532(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0540(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0550(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0568(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0570(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0588(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594[0x4];                                      // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_SelfActor;                      // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_NormalImpulse;                  // 0x05A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_Hit_1;                          // 0x05C0(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x06A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A2[0x2];                                      // 0x06A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x06A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x06A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6AC[0x4];                                      // 0x06AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x06B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x06C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x06E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x06F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0720(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0728(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x072C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0730(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0734(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0738(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73C[0x4];                                      // 0x073C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0740(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0758(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena_1;    // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_779[0x3];                                      // 0x0779(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGlobalEnvironmentGameplayEffectToActor_ReturnValue; // 0x077C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0784(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x0790(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, struct FHitResult& Hit)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x079C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x07A8(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x07D0(0x0004)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D4[0x4];                                      // 0x07D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x07D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x07F0(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate_14;           // 0x08D0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x08DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x08DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8DE[0x2];                                      // 0x08DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x08E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x08E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x08E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0900(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0918(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0930(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0948(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0950(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0958(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0960(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName_1;                // 0x0964(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0968(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x096C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0970(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_974[0x4];                                      // 0x0974(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0978(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0990(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate_15;           // 0x09A8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate_16;           // 0x09B4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x09C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_3;                            // 0x09C8(0x0028)()
	TArray<class AActor*>                         CallFunc_GetActorsFromTargetData_ReturnValue;      // 0x09F0(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0A00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A01[0x7];                                      // 0x0A01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0A08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena_2;    // 0x0A10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0A18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A19[0x7];                                      // 0x0A19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0A20(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0A38(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3C[0x4];                                      // 0x0A3C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0A40(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0A58(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0A70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_17;           // 0x0A74(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0A80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A81[0x3];                                      // 0x0A81(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0A84(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_18;           // 0x0A88(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0A94(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0A98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x0A9C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0AA0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0AB8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0AD0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0AE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
