#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Player_Ragdoll

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.ExecuteUbergraph_GA_Athena_Player_Ragdoll
// 0x0100 (0x0100 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_11;                   // 0x0004(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_10;                   // 0x0014(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_9;                    // 0x0024(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_8;                    // 0x0034(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0038(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_7;                    // 0x0044(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0048(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_6;                    // 0x0054(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0058(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0064(0x0004)(NoDestructor, HasGetValueTypeHash)
	class UFortAbilityTask_PlayMontageWaitNotify* CallFunc_PlayMontageAndWaitNotify_ReturnValue;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_5;                    // 0x0074(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0078(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_4;                    // 0x0084(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0088(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_3;                    // 0x0094(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0098(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_2;                    // 0x00A4(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x00A8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_1;                    // 0x00B4(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x00B8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag;                      // 0x00C4(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x00C8(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x00D4(0x0004)(NoDestructor, HasGetValueTypeHash)
	class UFortAbilityTask_PlayMontageWaitNotify* CallFunc_PlayMontageAndWaitNotify_ReturnValue_1;   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x00E4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll) == 0x000008, "Wrong alignment on GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll) == 0x000100, "Wrong size on GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, EntryPoint) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_11) == 0x000004, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_11' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_10) == 0x000014, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_10' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_9) == 0x000024, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_9' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_8) == 0x000034, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_8' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_3) == 0x000038, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_7) == 0x000044, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_7' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_4) == 0x000048, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_6) == 0x000054, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_5) == 0x000058, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, Temp_struct_Variable) == 0x000064, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, CallFunc_PlayMontageAndWaitNotify_ReturnValue) == 0x000068, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::CallFunc_PlayMontageAndWaitNotify_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_5) == 0x000074, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_6) == 0x000078, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_4) == 0x000084, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_7) == 0x000088, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_3) == 0x000094, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_8) == 0x000098, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_2) == 0x0000A4, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_9) == 0x0000A8, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag_1) == 0x0000B4, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_10) == 0x0000B8, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CustomEvent_NotifyTag) == 0x0000C4, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CustomEvent_NotifyTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_11) == 0x0000C8, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, Temp_struct_Variable_1) == 0x0000D4, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, CallFunc_PlayMontageAndWaitNotify_ReturnValue_1) == 0x0000D8, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::CallFunc_PlayMontageAndWaitNotify_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, CallFunc_IsValid_ReturnValue_1) == 0x0000E0, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_CreateDelegate_OutputDelegate_12) == 0x0000E4, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x0000F0, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, CallFunc_IsValid_ReturnValue_2) == 0x0000F8, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll, K2Node_Event_bWasCancelled) == 0x0000F9, "Member 'GA_Athena_Player_Ragdoll_C_ExecuteUbergraph_GA_Athena_Player_Ragdoll::K2Node_Event_bWasCancelled' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Athena_Player_Ragdoll_C_K2_OnEndAbility");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Athena_Player_Ragdoll_C_K2_OnEndAbility");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnBlendOut_14A1224A4375D017D9C6A49E475BE1FD
// 0x0004 (0x0004 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnBlendOut_14A1224A4375D017D9C6A49E475BE1FD final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnBlendOut_14A1224A4375D017D9C6A49E475BE1FD) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnBlendOut_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnBlendOut_14A1224A4375D017D9C6A49E475BE1FD) == 0x000004, "Wrong size on GA_Athena_Player_Ragdoll_C_OnBlendOut_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnBlendOut_14A1224A4375D017D9C6A49E475BE1FD, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnBlendOut_14A1224A4375D017D9C6A49E475BE1FD::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnBlendOut_461EDAFF4994509313085790267AF56D
// 0x0004 (0x0004 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnBlendOut_461EDAFF4994509313085790267AF56D final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnBlendOut_461EDAFF4994509313085790267AF56D) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnBlendOut_461EDAFF4994509313085790267AF56D");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnBlendOut_461EDAFF4994509313085790267AF56D) == 0x000004, "Wrong size on GA_Athena_Player_Ragdoll_C_OnBlendOut_461EDAFF4994509313085790267AF56D");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnBlendOut_461EDAFF4994509313085790267AF56D, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnBlendOut_461EDAFF4994509313085790267AF56D::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnCancelled_14A1224A4375D017D9C6A49E475BE1FD
// 0x0004 (0x0004 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnCancelled_14A1224A4375D017D9C6A49E475BE1FD final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnCancelled_14A1224A4375D017D9C6A49E475BE1FD) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnCancelled_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnCancelled_14A1224A4375D017D9C6A49E475BE1FD) == 0x000004, "Wrong size on GA_Athena_Player_Ragdoll_C_OnCancelled_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnCancelled_14A1224A4375D017D9C6A49E475BE1FD, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnCancelled_14A1224A4375D017D9C6A49E475BE1FD::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnCancelled_461EDAFF4994509313085790267AF56D
// 0x0004 (0x0004 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnCancelled_461EDAFF4994509313085790267AF56D final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnCancelled_461EDAFF4994509313085790267AF56D) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnCancelled_461EDAFF4994509313085790267AF56D");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnCancelled_461EDAFF4994509313085790267AF56D) == 0x000004, "Wrong size on GA_Athena_Player_Ragdoll_C_OnCancelled_461EDAFF4994509313085790267AF56D");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnCancelled_461EDAFF4994509313085790267AF56D, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnCancelled_461EDAFF4994509313085790267AF56D::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnCompleted_14A1224A4375D017D9C6A49E475BE1FD
// 0x0004 (0x0004 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnCompleted_14A1224A4375D017D9C6A49E475BE1FD final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnCompleted_14A1224A4375D017D9C6A49E475BE1FD) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnCompleted_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnCompleted_14A1224A4375D017D9C6A49E475BE1FD) == 0x000004, "Wrong size on GA_Athena_Player_Ragdoll_C_OnCompleted_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnCompleted_14A1224A4375D017D9C6A49E475BE1FD, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnCompleted_14A1224A4375D017D9C6A49E475BE1FD::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnCompleted_461EDAFF4994509313085790267AF56D
// 0x0004 (0x0004 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnCompleted_461EDAFF4994509313085790267AF56D final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnCompleted_461EDAFF4994509313085790267AF56D) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnCompleted_461EDAFF4994509313085790267AF56D");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnCompleted_461EDAFF4994509313085790267AF56D) == 0x000004, "Wrong size on GA_Athena_Player_Ragdoll_C_OnCompleted_461EDAFF4994509313085790267AF56D");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnCompleted_461EDAFF4994509313085790267AF56D, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnCompleted_461EDAFF4994509313085790267AF56D::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnInterrupted_14A1224A4375D017D9C6A49E475BE1FD
// 0x0004 (0x0004 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnInterrupted_14A1224A4375D017D9C6A49E475BE1FD final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnInterrupted_14A1224A4375D017D9C6A49E475BE1FD) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnInterrupted_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnInterrupted_14A1224A4375D017D9C6A49E475BE1FD) == 0x000004, "Wrong size on GA_Athena_Player_Ragdoll_C_OnInterrupted_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnInterrupted_14A1224A4375D017D9C6A49E475BE1FD, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnInterrupted_14A1224A4375D017D9C6A49E475BE1FD::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnInterrupted_461EDAFF4994509313085790267AF56D
// 0x0004 (0x0004 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnInterrupted_461EDAFF4994509313085790267AF56D final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnInterrupted_461EDAFF4994509313085790267AF56D) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnInterrupted_461EDAFF4994509313085790267AF56D");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnInterrupted_461EDAFF4994509313085790267AF56D) == 0x000004, "Wrong size on GA_Athena_Player_Ragdoll_C_OnInterrupted_461EDAFF4994509313085790267AF56D");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnInterrupted_461EDAFF4994509313085790267AF56D, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnInterrupted_461EDAFF4994509313085790267AF56D::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnNotifyBegin_14A1224A4375D017D9C6A49E475BE1FD
// 0x0004 (0x0004 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnNotifyBegin_14A1224A4375D017D9C6A49E475BE1FD final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnNotifyBegin_14A1224A4375D017D9C6A49E475BE1FD) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnNotifyBegin_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnNotifyBegin_14A1224A4375D017D9C6A49E475BE1FD) == 0x000004, "Wrong size on GA_Athena_Player_Ragdoll_C_OnNotifyBegin_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnNotifyBegin_14A1224A4375D017D9C6A49E475BE1FD, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnNotifyBegin_14A1224A4375D017D9C6A49E475BE1FD::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnNotifyBegin_461EDAFF4994509313085790267AF56D
// 0x0004 (0x0004 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnNotifyBegin_461EDAFF4994509313085790267AF56D final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnNotifyBegin_461EDAFF4994509313085790267AF56D) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnNotifyBegin_461EDAFF4994509313085790267AF56D");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnNotifyBegin_461EDAFF4994509313085790267AF56D) == 0x000004, "Wrong size on GA_Athena_Player_Ragdoll_C_OnNotifyBegin_461EDAFF4994509313085790267AF56D");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnNotifyBegin_461EDAFF4994509313085790267AF56D, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnNotifyBegin_461EDAFF4994509313085790267AF56D::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnNotifyEnd_14A1224A4375D017D9C6A49E475BE1FD
// 0x0004 (0x0004 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnNotifyEnd_14A1224A4375D017D9C6A49E475BE1FD final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnNotifyEnd_14A1224A4375D017D9C6A49E475BE1FD) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnNotifyEnd_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnNotifyEnd_14A1224A4375D017D9C6A49E475BE1FD) == 0x000004, "Wrong size on GA_Athena_Player_Ragdoll_C_OnNotifyEnd_14A1224A4375D017D9C6A49E475BE1FD");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnNotifyEnd_14A1224A4375D017D9C6A49E475BE1FD, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnNotifyEnd_14A1224A4375D017D9C6A49E475BE1FD::NotifyTag' has a wrong offset!");

// Function GA_Athena_Player_Ragdoll.GA_Athena_Player_Ragdoll_C.OnNotifyEnd_461EDAFF4994509313085790267AF56D
// 0x0004 (0x0004 - 0x0000)
struct GA_Athena_Player_Ragdoll_C_OnNotifyEnd_461EDAFF4994509313085790267AF56D final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Player_Ragdoll_C_OnNotifyEnd_461EDAFF4994509313085790267AF56D) == 0x000004, "Wrong alignment on GA_Athena_Player_Ragdoll_C_OnNotifyEnd_461EDAFF4994509313085790267AF56D");
static_assert(sizeof(GA_Athena_Player_Ragdoll_C_OnNotifyEnd_461EDAFF4994509313085790267AF56D) == 0x000004, "Wrong size on GA_Athena_Player_Ragdoll_C_OnNotifyEnd_461EDAFF4994509313085790267AF56D");
static_assert(offsetof(GA_Athena_Player_Ragdoll_C_OnNotifyEnd_461EDAFF4994509313085790267AF56D, NotifyTag) == 0x000000, "Member 'GA_Athena_Player_Ragdoll_C_OnNotifyEnd_461EDAFF4994509313085790267AF56D::NotifyTag' has a wrong offset!");

}

