#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Creative_PossessProp

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Creative_PossessProp.GA_Creative_PossessProp_C.Triggered_88ECC3F345024013A849AC979F41174B
// 0x0030 (0x0030 - 0x0000)
struct GA_Creative_PossessProp_C_Triggered_88ECC3F345024013A849AC979F41174B final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Creative_PossessProp_C_Triggered_88ECC3F345024013A849AC979F41174B) == 0x000008, "Wrong alignment on GA_Creative_PossessProp_C_Triggered_88ECC3F345024013A849AC979F41174B");
static_assert(sizeof(GA_Creative_PossessProp_C_Triggered_88ECC3F345024013A849AC979F41174B) == 0x000030, "Wrong size on GA_Creative_PossessProp_C_Triggered_88ECC3F345024013A849AC979F41174B");
static_assert(offsetof(GA_Creative_PossessProp_C_Triggered_88ECC3F345024013A849AC979F41174B, TargetData) == 0x000000, "Member 'GA_Creative_PossessProp_C_Triggered_88ECC3F345024013A849AC979F41174B::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_Triggered_88ECC3F345024013A849AC979F41174B, ApplicationTag) == 0x000028, "Member 'GA_Creative_PossessProp_C_Triggered_88ECC3F345024013A849AC979F41174B::ApplicationTag' has a wrong offset!");

// Function GA_Creative_PossessProp.GA_Creative_PossessProp_C.StopDance
// 0x0010 (0x0010 - 0x0000)
struct GA_Creative_PossessProp_C_StopDance final
{
public:
	float                                         StaminaRegenRate;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Creative_PossessProp_C_StopDance) == 0x000008, "Wrong alignment on GA_Creative_PossessProp_C_StopDance");
static_assert(sizeof(GA_Creative_PossessProp_C_StopDance) == 0x000010, "Wrong size on GA_Creative_PossessProp_C_StopDance");
static_assert(offsetof(GA_Creative_PossessProp_C_StopDance, StaminaRegenRate) == 0x000000, "Member 'GA_Creative_PossessProp_C_StopDance::StaminaRegenRate' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_StopDance, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'GA_Creative_PossessProp_C_StopDance::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");

// Function GA_Creative_PossessProp.GA_Creative_PossessProp_C.SpawnActorToAttach
// 0x03D0 (0x03D0 - 0x0000)
struct GA_Creative_PossessProp_C_SpawnActorToAttach final
{
public:
	struct FTransform                             NewTransform;                                      // 0x0000(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0098(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B0(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0100(0x0050)(HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x0160(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0178(0x0050)(HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x01C8(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x02A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x02B8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x02D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x02E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0310(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0348(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ACreative_Player_Prop_C*                K2Node_DynamicCast_AsCreative_Player_Prop;         // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0370(0x0060)(IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Creative_PossessProp_C_SpawnActorToAttach) == 0x000010, "Wrong alignment on GA_Creative_PossessProp_C_SpawnActorToAttach");
static_assert(sizeof(GA_Creative_PossessProp_C_SpawnActorToAttach) == 0x0003D0, "Wrong size on GA_Creative_PossessProp_C_SpawnActorToAttach");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, NewTransform) == 0x000000, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::NewTransform' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, CallFunc_GetDisplayName_ReturnValue) == 0x000060, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, CallFunc_GetDisplayName_ReturnValue_1) == 0x000070, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000098, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, K2Node_MakeStruct_FormatArgumentData) == 0x0000B0, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, K2Node_MakeStruct_FormatArgumentData_1) == 0x000100, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, CallFunc_GetObjectName_ReturnValue) == 0x000150, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, CallFunc_Conv_StringToText_ReturnValue_2) == 0x000160, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, K2Node_MakeStruct_FormatArgumentData_2) == 0x000178, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x0001C8, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, K2Node_MakeArray_Array) == 0x0002A8, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, CallFunc_Format_ReturnValue) == 0x0002B8, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, CallFunc_Conv_TextToString_ReturnValue) == 0x0002D0, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, CallFunc_GetActorScale3D_ReturnValue) == 0x0002E0, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002F8, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000310, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000328, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, CallFunc_BreakRotator_Roll) == 0x000330, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, CallFunc_BreakRotator_Pitch) == 0x000334, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, CallFunc_BreakRotator_Yaw) == 0x000338, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00033C, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, CallFunc_FinishSpawningActor_ReturnValue) == 0x000340, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, CallFunc_MakeRotator_ReturnValue) == 0x000348, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, K2Node_DynamicCast_AsCreative_Player_Prop) == 0x000360, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::K2Node_DynamicCast_AsCreative_Player_Prop' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, K2Node_DynamicCast_bSuccess) == 0x000368, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SpawnActorToAttach, CallFunc_MakeTransform_ReturnValue) == 0x000370, "Member 'GA_Creative_PossessProp_C_SpawnActorToAttach::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");

// Function GA_Creative_PossessProp.GA_Creative_PossessProp_C.SetMaxStamina
// 0x0038 (0x0038 - 0x0000)
struct GA_Creative_PossessProp_C_SetMaxStamina final
{
public:
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0000(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0028(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_Creative_PossessProp_C_SetMaxStamina) == 0x000008, "Wrong alignment on GA_Creative_PossessProp_C_SetMaxStamina");
static_assert(sizeof(GA_Creative_PossessProp_C_SetMaxStamina) == 0x000038, "Wrong size on GA_Creative_PossessProp_C_SetMaxStamina");
static_assert(offsetof(GA_Creative_PossessProp_C_SetMaxStamina, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000000, "Member 'GA_Creative_PossessProp_C_SetMaxStamina::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SetMaxStamina, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000028, "Member 'GA_Creative_PossessProp_C_SetMaxStamina::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

// Function GA_Creative_PossessProp.GA_Creative_PossessProp_C.SelectPropToPossess
// 0x0048 (0x0048 - 0x0000)
struct GA_Creative_PossessProp_C_SelectPropToPossess final
{
public:
	class AActor*                                 SelectedProp_0;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetCurrentSourceObject_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_CreativePropSelector_Athena_C*       K2Node_DynamicCast_AsB_Creative_Prop_Selector_Athena; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetSelectedActors_SelectedActors;         // 0x0020(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Creative_PossessProp_C_SelectPropToPossess) == 0x000008, "Wrong alignment on GA_Creative_PossessProp_C_SelectPropToPossess");
static_assert(sizeof(GA_Creative_PossessProp_C_SelectPropToPossess) == 0x000048, "Wrong size on GA_Creative_PossessProp_C_SelectPropToPossess");
static_assert(offsetof(GA_Creative_PossessProp_C_SelectPropToPossess, SelectedProp_0) == 0x000000, "Member 'GA_Creative_PossessProp_C_SelectPropToPossess::SelectedProp_0' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SelectPropToPossess, CallFunc_GetCurrentSourceObject_ReturnValue) == 0x000008, "Member 'GA_Creative_PossessProp_C_SelectPropToPossess::CallFunc_GetCurrentSourceObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SelectPropToPossess, K2Node_DynamicCast_AsB_Creative_Prop_Selector_Athena) == 0x000010, "Member 'GA_Creative_PossessProp_C_SelectPropToPossess::K2Node_DynamicCast_AsB_Creative_Prop_Selector_Athena' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SelectPropToPossess, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GA_Creative_PossessProp_C_SelectPropToPossess::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SelectPropToPossess, CallFunc_GetSelectedActors_SelectedActors) == 0x000020, "Member 'GA_Creative_PossessProp_C_SelectPropToPossess::CallFunc_GetSelectedActors_SelectedActors' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SelectPropToPossess, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GA_Creative_PossessProp_C_SelectPropToPossess::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SelectPropToPossess, CallFunc_Array_Get_Item) == 0x000038, "Member 'GA_Creative_PossessProp_C_SelectPropToPossess::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SelectPropToPossess, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'GA_Creative_PossessProp_C_SelectPropToPossess::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_SelectPropToPossess, CallFunc_Greater_IntInt_ReturnValue) == 0x000044, "Member 'GA_Creative_PossessProp_C_SelectPropToPossess::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function GA_Creative_PossessProp.GA_Creative_PossessProp_C.RemoveStaminaRegen
// 0x0010 (0x0010 - 0x0000)
struct GA_Creative_PossessProp_C_RemoveStaminaRegen final
{
public:
	float                                         StaminaRegenRate;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Creative_PossessProp_C_RemoveStaminaRegen) == 0x000008, "Wrong alignment on GA_Creative_PossessProp_C_RemoveStaminaRegen");
static_assert(sizeof(GA_Creative_PossessProp_C_RemoveStaminaRegen) == 0x000010, "Wrong size on GA_Creative_PossessProp_C_RemoveStaminaRegen");
static_assert(offsetof(GA_Creative_PossessProp_C_RemoveStaminaRegen, StaminaRegenRate) == 0x000000, "Member 'GA_Creative_PossessProp_C_RemoveStaminaRegen::StaminaRegenRate' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_RemoveStaminaRegen, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'GA_Creative_PossessProp_C_RemoveStaminaRegen::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");

// Function GA_Creative_PossessProp.GA_Creative_PossessProp_C.RemoveStaminaDrain
// 0x0010 (0x0010 - 0x0000)
struct GA_Creative_PossessProp_C_RemoveStaminaDrain final
{
public:
	float                                         StaminaRegenRate;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Creative_PossessProp_C_RemoveStaminaDrain) == 0x000008, "Wrong alignment on GA_Creative_PossessProp_C_RemoveStaminaDrain");
static_assert(sizeof(GA_Creative_PossessProp_C_RemoveStaminaDrain) == 0x000010, "Wrong size on GA_Creative_PossessProp_C_RemoveStaminaDrain");
static_assert(offsetof(GA_Creative_PossessProp_C_RemoveStaminaDrain, StaminaRegenRate) == 0x000000, "Member 'GA_Creative_PossessProp_C_RemoveStaminaDrain::StaminaRegenRate' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_RemoveStaminaDrain, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000008, "Member 'GA_Creative_PossessProp_C_RemoveStaminaDrain::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");

// Function GA_Creative_PossessProp.GA_Creative_PossessProp_C.RemoveHealthDrain
// 0x0008 (0x0008 - 0x0000)
struct GA_Creative_PossessProp_C_RemoveHealthDrain final
{
public:
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Creative_PossessProp_C_RemoveHealthDrain) == 0x000008, "Wrong alignment on GA_Creative_PossessProp_C_RemoveHealthDrain");
static_assert(sizeof(GA_Creative_PossessProp_C_RemoveHealthDrain) == 0x000008, "Wrong size on GA_Creative_PossessProp_C_RemoveHealthDrain");
static_assert(offsetof(GA_Creative_PossessProp_C_RemoveHealthDrain, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000000, "Member 'GA_Creative_PossessProp_C_RemoveHealthDrain::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");

// Function GA_Creative_PossessProp.GA_Creative_PossessProp_C.PropStaminaRegen
// 0x0068 (0x0068 - 0x0000)
struct GA_Creative_PossessProp_C_PropStaminaRegen final
{
public:
	float                                         DrainAmount;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0008(0x0028)()
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0038(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0048(0x0010)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0058(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_Creative_PossessProp_C_PropStaminaRegen) == 0x000008, "Wrong alignment on GA_Creative_PossessProp_C_PropStaminaRegen");
static_assert(sizeof(GA_Creative_PossessProp_C_PropStaminaRegen) == 0x000068, "Wrong size on GA_Creative_PossessProp_C_PropStaminaRegen");
static_assert(offsetof(GA_Creative_PossessProp_C_PropStaminaRegen, DrainAmount) == 0x000000, "Member 'GA_Creative_PossessProp_C_PropStaminaRegen::DrainAmount' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PropStaminaRegen, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000008, "Member 'GA_Creative_PossessProp_C_PropStaminaRegen::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PropStaminaRegen, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000030, "Member 'GA_Creative_PossessProp_C_PropStaminaRegen::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PropStaminaRegen, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000038, "Member 'GA_Creative_PossessProp_C_PropStaminaRegen::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PropStaminaRegen, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000048, "Member 'GA_Creative_PossessProp_C_PropStaminaRegen::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PropStaminaRegen, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000058, "Member 'GA_Creative_PossessProp_C_PropStaminaRegen::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");

// Function GA_Creative_PossessProp.GA_Creative_PossessProp_C.PropStaminaDrain
// 0x0068 (0x0068 - 0x0000)
struct GA_Creative_PossessProp_C_PropStaminaDrain final
{
public:
	float                                         DrainAmount;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0008(0x0028)()
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0038(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0048(0x0010)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0058(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_Creative_PossessProp_C_PropStaminaDrain) == 0x000008, "Wrong alignment on GA_Creative_PossessProp_C_PropStaminaDrain");
static_assert(sizeof(GA_Creative_PossessProp_C_PropStaminaDrain) == 0x000068, "Wrong size on GA_Creative_PossessProp_C_PropStaminaDrain");
static_assert(offsetof(GA_Creative_PossessProp_C_PropStaminaDrain, DrainAmount) == 0x000000, "Member 'GA_Creative_PossessProp_C_PropStaminaDrain::DrainAmount' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PropStaminaDrain, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000008, "Member 'GA_Creative_PossessProp_C_PropStaminaDrain::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PropStaminaDrain, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000030, "Member 'GA_Creative_PossessProp_C_PropStaminaDrain::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PropStaminaDrain, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000038, "Member 'GA_Creative_PossessProp_C_PropStaminaDrain::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PropStaminaDrain, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000048, "Member 'GA_Creative_PossessProp_C_PropStaminaDrain::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PropStaminaDrain, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000058, "Member 'GA_Creative_PossessProp_C_PropStaminaDrain::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");

// Function GA_Creative_PossessProp.GA_Creative_PossessProp_C.PropHealthRegen
// 0x0068 (0x0068 - 0x0000)
struct GA_Creative_PossessProp_C_PropHealthRegen final
{
public:
	float                                         HealIncrement;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0008(0x0028)()
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0038(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0048(0x0010)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0058(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_Creative_PossessProp_C_PropHealthRegen) == 0x000008, "Wrong alignment on GA_Creative_PossessProp_C_PropHealthRegen");
static_assert(sizeof(GA_Creative_PossessProp_C_PropHealthRegen) == 0x000068, "Wrong size on GA_Creative_PossessProp_C_PropHealthRegen");
static_assert(offsetof(GA_Creative_PossessProp_C_PropHealthRegen, HealIncrement) == 0x000000, "Member 'GA_Creative_PossessProp_C_PropHealthRegen::HealIncrement' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PropHealthRegen, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000008, "Member 'GA_Creative_PossessProp_C_PropHealthRegen::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PropHealthRegen, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000030, "Member 'GA_Creative_PossessProp_C_PropHealthRegen::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PropHealthRegen, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000038, "Member 'GA_Creative_PossessProp_C_PropHealthRegen::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PropHealthRegen, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000048, "Member 'GA_Creative_PossessProp_C_PropHealthRegen::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PropHealthRegen, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000058, "Member 'GA_Creative_PossessProp_C_PropHealthRegen::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");

// Function GA_Creative_PossessProp.GA_Creative_PossessProp_C.PropHealthDrain
// 0x0068 (0x0068 - 0x0000)
struct GA_Creative_PossessProp_C_PropHealthDrain final
{
public:
	float                                         DamageIncrement;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0008(0x0028)()
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0038(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0048(0x0010)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0058(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_Creative_PossessProp_C_PropHealthDrain) == 0x000008, "Wrong alignment on GA_Creative_PossessProp_C_PropHealthDrain");
static_assert(sizeof(GA_Creative_PossessProp_C_PropHealthDrain) == 0x000068, "Wrong size on GA_Creative_PossessProp_C_PropHealthDrain");
static_assert(offsetof(GA_Creative_PossessProp_C_PropHealthDrain, DamageIncrement) == 0x000000, "Member 'GA_Creative_PossessProp_C_PropHealthDrain::DamageIncrement' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PropHealthDrain, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000008, "Member 'GA_Creative_PossessProp_C_PropHealthDrain::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PropHealthDrain, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000030, "Member 'GA_Creative_PossessProp_C_PropHealthDrain::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PropHealthDrain, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000038, "Member 'GA_Creative_PossessProp_C_PropHealthDrain::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PropHealthDrain, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000048, "Member 'GA_Creative_PossessProp_C_PropHealthDrain::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PropHealthDrain, CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000058, "Member 'GA_Creative_PossessProp_C_PropHealthDrain::CallFunc_K2_ApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");

// Function GA_Creative_PossessProp.GA_Creative_PossessProp_C.PrintStaminaValue
// 0x0018 (0x0018 - 0x0000)
struct GA_Creative_PossessProp_C_PrintStaminaValue final
{
public:
	float                                         CallFunc_GetStamina_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Creative_PossessProp_C_PrintStaminaValue) == 0x000008, "Wrong alignment on GA_Creative_PossessProp_C_PrintStaminaValue");
static_assert(sizeof(GA_Creative_PossessProp_C_PrintStaminaValue) == 0x000018, "Wrong size on GA_Creative_PossessProp_C_PrintStaminaValue");
static_assert(offsetof(GA_Creative_PossessProp_C_PrintStaminaValue, CallFunc_GetStamina_ReturnValue) == 0x000000, "Member 'GA_Creative_PossessProp_C_PrintStaminaValue::CallFunc_GetStamina_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_PrintStaminaValue, CallFunc_Conv_FloatToString_ReturnValue) == 0x000008, "Member 'GA_Creative_PossessProp_C_PrintStaminaValue::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");

// Function GA_Creative_PossessProp.GA_Creative_PossessProp_C.OnAttachedPropDied
// 0x0060 (0x0060 - 0x0000)
struct GA_Creative_PossessProp_C_OnAttachedPropDied final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0040(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Momentum;                                          // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Creative_PossessProp_C_OnAttachedPropDied) == 0x000008, "Wrong alignment on GA_Creative_PossessProp_C_OnAttachedPropDied");
static_assert(sizeof(GA_Creative_PossessProp_C_OnAttachedPropDied) == 0x000060, "Wrong size on GA_Creative_PossessProp_C_OnAttachedPropDied");
static_assert(offsetof(GA_Creative_PossessProp_C_OnAttachedPropDied, DamagedActor) == 0x000000, "Member 'GA_Creative_PossessProp_C_OnAttachedPropDied::DamagedActor' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_OnAttachedPropDied, Damage) == 0x000008, "Member 'GA_Creative_PossessProp_C_OnAttachedPropDied::Damage' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_OnAttachedPropDied, InstigatedBy) == 0x000010, "Member 'GA_Creative_PossessProp_C_OnAttachedPropDied::InstigatedBy' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_OnAttachedPropDied, DamageCauser) == 0x000018, "Member 'GA_Creative_PossessProp_C_OnAttachedPropDied::DamageCauser' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_OnAttachedPropDied, HitLocation) == 0x000020, "Member 'GA_Creative_PossessProp_C_OnAttachedPropDied::HitLocation' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_OnAttachedPropDied, FHitComponent) == 0x000038, "Member 'GA_Creative_PossessProp_C_OnAttachedPropDied::FHitComponent' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_OnAttachedPropDied, BoneName) == 0x000040, "Member 'GA_Creative_PossessProp_C_OnAttachedPropDied::BoneName' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_OnAttachedPropDied, Momentum) == 0x000048, "Member 'GA_Creative_PossessProp_C_OnAttachedPropDied::Momentum' has a wrong offset!");

// Function GA_Creative_PossessProp.GA_Creative_PossessProp_C.OnAttachedPropDestroyed
// 0x0008 (0x0008 - 0x0000)
struct GA_Creative_PossessProp_C_OnAttachedPropDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Creative_PossessProp_C_OnAttachedPropDestroyed) == 0x000008, "Wrong alignment on GA_Creative_PossessProp_C_OnAttachedPropDestroyed");
static_assert(sizeof(GA_Creative_PossessProp_C_OnAttachedPropDestroyed) == 0x000008, "Wrong size on GA_Creative_PossessProp_C_OnAttachedPropDestroyed");
static_assert(offsetof(GA_Creative_PossessProp_C_OnAttachedPropDestroyed, DestroyedActor) == 0x000000, "Member 'GA_Creative_PossessProp_C_OnAttachedPropDestroyed::DestroyedActor' has a wrong offset!");

// Function GA_Creative_PossessProp.GA_Creative_PossessProp_C.K2_OnEndAbility
// 0x0148 (0x0148 - 0x0000)
struct GA_Creative_PossessProp_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetCurrentSourceObject_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_GameplayTag_ReturnValue;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetCurrentSourceObject_ReturnValue_1;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0028(0x00D0)(ContainsInstancedReference)
	class AActor*                                 K2Node_DynamicCast_AsActor_1;                      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetActivatingAbilityComponent_ReturnValue; // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate;              // 0x011C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0128(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetActivatingAbilityComponent_ReturnValue_1; // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Creative_PossessProp_C_K2_OnEndAbility) == 0x000008, "Wrong alignment on GA_Creative_PossessProp_C_K2_OnEndAbility");
static_assert(sizeof(GA_Creative_PossessProp_C_K2_OnEndAbility) == 0x000148, "Wrong size on GA_Creative_PossessProp_C_K2_OnEndAbility");
static_assert(offsetof(GA_Creative_PossessProp_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Creative_PossessProp_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_K2_OnEndAbility, CallFunc_GetCurrentSourceObject_ReturnValue) == 0x000008, "Member 'GA_Creative_PossessProp_C_K2_OnEndAbility::CallFunc_GetCurrentSourceObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_K2_OnEndAbility, K2Node_DynamicCast_AsActor) == 0x000010, "Member 'GA_Creative_PossessProp_C_K2_OnEndAbility::K2Node_DynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_K2_OnEndAbility, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GA_Creative_PossessProp_C_K2_OnEndAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_K2_OnEndAbility, CallFunc_NotEqual_GameplayTag_ReturnValue) == 0x000019, "Member 'GA_Creative_PossessProp_C_K2_OnEndAbility::CallFunc_NotEqual_GameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_K2_OnEndAbility, CallFunc_GetCurrentSourceObject_ReturnValue_1) == 0x000020, "Member 'GA_Creative_PossessProp_C_K2_OnEndAbility::CallFunc_GetCurrentSourceObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_K2_OnEndAbility, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000028, "Member 'GA_Creative_PossessProp_C_K2_OnEndAbility::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_K2_OnEndAbility, K2Node_DynamicCast_AsActor_1) == 0x0000F8, "Member 'GA_Creative_PossessProp_C_K2_OnEndAbility::K2Node_DynamicCast_AsActor_1' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_K2_OnEndAbility, K2Node_DynamicCast_bSuccess_1) == 0x000100, "Member 'GA_Creative_PossessProp_C_K2_OnEndAbility::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_K2_OnEndAbility, CallFunc_GetActivatingAbilityComponent_ReturnValue) == 0x000108, "Member 'GA_Creative_PossessProp_C_K2_OnEndAbility::CallFunc_GetActivatingAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_K2_OnEndAbility, K2Node_DynamicCast_AsBuilding_Actor) == 0x000110, "Member 'GA_Creative_PossessProp_C_K2_OnEndAbility::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_K2_OnEndAbility, K2Node_DynamicCast_bSuccess_2) == 0x000118, "Member 'GA_Creative_PossessProp_C_K2_OnEndAbility::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_K2_OnEndAbility, CallFunc_IsValid_ReturnValue) == 0x000119, "Member 'GA_Creative_PossessProp_C_K2_OnEndAbility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_K2_OnEndAbility, K2Node_CreateDelegate_OutputDelegate) == 0x00011C, "Member 'GA_Creative_PossessProp_C_K2_OnEndAbility::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_K2_OnEndAbility, K2Node_CreateDelegate_OutputDelegate_1) == 0x000128, "Member 'GA_Creative_PossessProp_C_K2_OnEndAbility::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_K2_OnEndAbility, CallFunc_GetActivatingAbilityComponent_ReturnValue_1) == 0x000138, "Member 'GA_Creative_PossessProp_C_K2_OnEndAbility::CallFunc_GetActivatingAbilityComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_K2_OnEndAbility, CallFunc_IsServer_ReturnValue) == 0x000140, "Member 'GA_Creative_PossessProp_C_K2_OnEndAbility::CallFunc_IsServer_ReturnValue' has a wrong offset!");

// Function GA_Creative_PossessProp.GA_Creative_PossessProp_C.HealDrainDamage
// 0x0050 (0x0050 - 0x0000)
struct GA_Creative_PossessProp_C_HealDrainDamage final
{
public:
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0000(0x0028)()
	class AB_CreativePropSelector_Athena_C*       K2Node_DynamicCast_AsB_Creative_Prop_Selector_Athena; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0040(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_Creative_PossessProp_C_HealDrainDamage) == 0x000008, "Wrong alignment on GA_Creative_PossessProp_C_HealDrainDamage");
static_assert(sizeof(GA_Creative_PossessProp_C_HealDrainDamage) == 0x000050, "Wrong size on GA_Creative_PossessProp_C_HealDrainDamage");
static_assert(offsetof(GA_Creative_PossessProp_C_HealDrainDamage, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000000, "Member 'GA_Creative_PossessProp_C_HealDrainDamage::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_HealDrainDamage, K2Node_DynamicCast_AsB_Creative_Prop_Selector_Athena) == 0x000028, "Member 'GA_Creative_PossessProp_C_HealDrainDamage::K2Node_DynamicCast_AsB_Creative_Prop_Selector_Athena' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_HealDrainDamage, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GA_Creative_PossessProp_C_HealDrainDamage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_HealDrainDamage, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000034, "Member 'GA_Creative_PossessProp_C_HealDrainDamage::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_HealDrainDamage, CallFunc_FTrunc_ReturnValue) == 0x000038, "Member 'GA_Creative_PossessProp_C_HealDrainDamage::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_HealDrainDamage, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'GA_Creative_PossessProp_C_HealDrainDamage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_C_HealDrainDamage, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000040, "Member 'GA_Creative_PossessProp_C_HealDrainDamage::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

// Function GA_Creative_PossessProp.GA_Creative_PossessProp_C.ExecuteUbergraph_GA_Creative_PossessProp
// 0x0568 (0x0568 - 0x0000)
struct GA_Creative_PossessProp_C_ExecuteUbergraph_GA_Creative_PossessProp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0008(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0030(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0034(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x0038(0x0028)()
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0064(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetCurrentSourceObject_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_DynamicCast_AsActor;                        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0090(0x0048)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00E8(0x0028)()
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0110(0x00D0)(ContainsInstancedReference)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x01E0(0x0010)(ReferenceParm)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     CallFunc_ServerOnExitVehicle_ReturnValue;          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x020A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x020B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
