#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Creative_PossessProp_Server

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Creative_PossessProp_Server.GA_Creative_PossessProp_Server_C.ExecuteUbergraph_GA_Creative_PossessProp_Server
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            CallFunc_GetActivatingAbilityComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryActivateAbilityByClass_ReturnValue;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0018(0x0048)(ContainsInstancedReference)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x006C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0078(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00A0(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server) == 0x000008, "Wrong alignment on GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server");
static_assert(sizeof(GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server) == 0x0000B0, "Wrong size on GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server");
static_assert(offsetof(GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server, EntryPoint) == 0x000000, "Member 'GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server, CallFunc_GetActivatingAbilityComponent_ReturnValue) == 0x000008, "Member 'GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server::CallFunc_GetActivatingAbilityComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server, CallFunc_K2_CommitAbility_ReturnValue) == 0x000010, "Member 'GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server, CallFunc_TryActivateAbilityByClass_ReturnValue) == 0x000011, "Member 'GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server::CallFunc_TryActivateAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server, CallFunc_GetActorInfo_ReturnValue) == 0x000018, "Member 'GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000060, "Member 'GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x00006C, "Member 'GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000078, "Member 'GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000A0, "Member 'GA_Creative_PossessProp_Server_C_ExecuteUbergraph_GA_Creative_PossessProp_Server::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");

}

