#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Creative_PossessProp

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Creative_PossessProp.GA_Creative_PossessProp_C
// 0x00A8 (0x0C08 - 0x0B60)
class UGA_Creative_PossessProp_C final : public UFortGameplayAbility_PossessProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B60(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APlayerPawn_Athena_C*                   PlayerPawnAthena;                                  // 0x0B68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 SelectedProp;                                      // 0x0B70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACreative_Player_Prop_C*                SpawnedProp;                                       // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           PossessPropTag;                                    // 0x0B80(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         MontageDuration;                                   // 0x0B84(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EquippingCue;                                      // 0x0B88(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8C[0x4];                                      // 0x0B8C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  PossessedPropPlacedTag;                            // 0x0B90(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         DrainDamagePercentage;                             // 0x0BB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealthRegenPercentage;                             // 0x0BB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VelocityThreshold;                                 // 0x0BB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DrainIncrement;                                    // 0x0BBC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CreativePlayerPropClass;                           // 0x0BC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimMontagePlayRate;                               // 0x0BC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DoEnterAnimation;                                  // 0x0BCC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BCD[0x3];                                      // 0x0BCD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimPlayLength;                                    // 0x0BD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD4[0x4];                                      // 0x0BD4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_PossessWithNoAnim;                              // 0x0BD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PreventCancelDisguiseBlockTags;                    // 0x0BE0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bAppliedCancelDisguiseBlockTags;                   // 0x0C00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C01[0x3];                                      // 0x0C01(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           UnpossessPropTag;                                  // 0x0C04(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Triggered_88ECC3F345024013A849AC979F41174B(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void StopDance(float StaminaRegenRate);
	void StaminaDrain();
	void SpawnActorToAttach();
	void SetMaxStamina();
	void SelectPropToPossess(class AActor** SelectedProp_0);
	void ResetDance();
	void RemoveStaminaRegen(float StaminaRegenRate);
	void RemoveStaminaDrain(float StaminaRegenRate);
	void RemoveHealthDrain();
	void PropStaminaRegen(float DrainAmount);
	void PropStaminaDrain(float DrainAmount);
	void PropHealthRegen(float HealIncrement);
	void PropHealthDrain(float DamageIncrement);
	void PrintStaminaValue();
	void OnAttachedPropDied(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void OnAttachedPropDestroyed(class AActor* DestroyedActor);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void HealthChangeBasedOnMovement();
	void HealDrainDamage();
	void ExecuteUbergraph_GA_Creative_PossessProp(int32 EntryPoint);
	void Completed_88ECC3F345024013A849AC979F41174B(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Clear_Possessed_Prop();
	void Cancelled_88ECC3F345024013A849AC979F41174B(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void ApplyCancelDisguiseBlockTags();

	void GetPropHuntSettings(class ABP_PropPossessorConfigProp_C** Prop_Hunt_Settings) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Creative_PossessProp_C">();
	}
	static class UGA_Creative_PossessProp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Creative_PossessProp_C>();
	}
};
static_assert(alignof(UGA_Creative_PossessProp_C) == 0x000008, "Wrong alignment on UGA_Creative_PossessProp_C");
static_assert(sizeof(UGA_Creative_PossessProp_C) == 0x000C08, "Wrong size on UGA_Creative_PossessProp_C");
static_assert(offsetof(UGA_Creative_PossessProp_C, UberGraphFrame) == 0x000B60, "Member 'UGA_Creative_PossessProp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Creative_PossessProp_C, PlayerPawnAthena) == 0x000B68, "Member 'UGA_Creative_PossessProp_C::PlayerPawnAthena' has a wrong offset!");
static_assert(offsetof(UGA_Creative_PossessProp_C, SelectedProp) == 0x000B70, "Member 'UGA_Creative_PossessProp_C::SelectedProp' has a wrong offset!");
static_assert(offsetof(UGA_Creative_PossessProp_C, SpawnedProp) == 0x000B78, "Member 'UGA_Creative_PossessProp_C::SpawnedProp' has a wrong offset!");
static_assert(offsetof(UGA_Creative_PossessProp_C, PossessPropTag) == 0x000B80, "Member 'UGA_Creative_PossessProp_C::PossessPropTag' has a wrong offset!");
static_assert(offsetof(UGA_Creative_PossessProp_C, MontageDuration) == 0x000B84, "Member 'UGA_Creative_PossessProp_C::MontageDuration' has a wrong offset!");
static_assert(offsetof(UGA_Creative_PossessProp_C, EquippingCue) == 0x000B88, "Member 'UGA_Creative_PossessProp_C::EquippingCue' has a wrong offset!");
static_assert(offsetof(UGA_Creative_PossessProp_C, PossessedPropPlacedTag) == 0x000B90, "Member 'UGA_Creative_PossessProp_C::PossessedPropPlacedTag' has a wrong offset!");
static_assert(offsetof(UGA_Creative_PossessProp_C, DrainDamagePercentage) == 0x000BB0, "Member 'UGA_Creative_PossessProp_C::DrainDamagePercentage' has a wrong offset!");
static_assert(offsetof(UGA_Creative_PossessProp_C, HealthRegenPercentage) == 0x000BB4, "Member 'UGA_Creative_PossessProp_C::HealthRegenPercentage' has a wrong offset!");
static_assert(offsetof(UGA_Creative_PossessProp_C, VelocityThreshold) == 0x000BB8, "Member 'UGA_Creative_PossessProp_C::VelocityThreshold' has a wrong offset!");
static_assert(offsetof(UGA_Creative_PossessProp_C, DrainIncrement) == 0x000BBC, "Member 'UGA_Creative_PossessProp_C::DrainIncrement' has a wrong offset!");
static_assert(offsetof(UGA_Creative_PossessProp_C, CreativePlayerPropClass) == 0x000BC0, "Member 'UGA_Creative_PossessProp_C::CreativePlayerPropClass' has a wrong offset!");
static_assert(offsetof(UGA_Creative_PossessProp_C, AnimMontagePlayRate) == 0x000BC8, "Member 'UGA_Creative_PossessProp_C::AnimMontagePlayRate' has a wrong offset!");
static_assert(offsetof(UGA_Creative_PossessProp_C, DoEnterAnimation) == 0x000BCC, "Member 'UGA_Creative_PossessProp_C::DoEnterAnimation' has a wrong offset!");
static_assert(offsetof(UGA_Creative_PossessProp_C, AnimPlayLength) == 0x000BD0, "Member 'UGA_Creative_PossessProp_C::AnimPlayLength' has a wrong offset!");
static_assert(offsetof(UGA_Creative_PossessProp_C, GE_PossessWithNoAnim) == 0x000BD8, "Member 'UGA_Creative_PossessProp_C::GE_PossessWithNoAnim' has a wrong offset!");
static_assert(offsetof(UGA_Creative_PossessProp_C, PreventCancelDisguiseBlockTags) == 0x000BE0, "Member 'UGA_Creative_PossessProp_C::PreventCancelDisguiseBlockTags' has a wrong offset!");
static_assert(offsetof(UGA_Creative_PossessProp_C, bAppliedCancelDisguiseBlockTags) == 0x000C00, "Member 'UGA_Creative_PossessProp_C::bAppliedCancelDisguiseBlockTags' has a wrong offset!");
static_assert(offsetof(UGA_Creative_PossessProp_C, UnpossessPropTag) == 0x000C04, "Member 'UGA_Creative_PossessProp_C::UnpossessPropTag' has a wrong offset!");

}

