#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DanceGrenade_Stun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_DanceGrenade_Stun.GA_DanceGrenade_Stun_C
// 0x0020 (0x0B30 - 0x0B10)
class UGA_DanceGrenade_Stun_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           AnimMontage;                                       // 0x0B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldUseSharedAnim;                               // 0x0B20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B21[0x3];                                      // 0x0B21(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DanceGrenadeHolsterId;                             // 0x0B24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkydiving;                                       // 0x0B28(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void FailedToActivatePassiveAbility();
	void ExecuteUbergraph_GA_DanceGrenade_Stun(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_DanceGrenade_Stun_C">();
	}
	static class UGA_DanceGrenade_Stun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_DanceGrenade_Stun_C>();
	}
};
static_assert(alignof(UGA_DanceGrenade_Stun_C) == 0x000008, "Wrong alignment on UGA_DanceGrenade_Stun_C");
static_assert(sizeof(UGA_DanceGrenade_Stun_C) == 0x000B30, "Wrong size on UGA_DanceGrenade_Stun_C");
static_assert(offsetof(UGA_DanceGrenade_Stun_C, UberGraphFrame) == 0x000B10, "Member 'UGA_DanceGrenade_Stun_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_DanceGrenade_Stun_C, AnimMontage) == 0x000B18, "Member 'UGA_DanceGrenade_Stun_C::AnimMontage' has a wrong offset!");
static_assert(offsetof(UGA_DanceGrenade_Stun_C, ShouldUseSharedAnim) == 0x000B20, "Member 'UGA_DanceGrenade_Stun_C::ShouldUseSharedAnim' has a wrong offset!");
static_assert(offsetof(UGA_DanceGrenade_Stun_C, DanceGrenadeHolsterId) == 0x000B24, "Member 'UGA_DanceGrenade_Stun_C::DanceGrenadeHolsterId' has a wrong offset!");
static_assert(offsetof(UGA_DanceGrenade_Stun_C, IsSkydiving) == 0x000B28, "Member 'UGA_DanceGrenade_Stun_C::IsSkydiving' has a wrong offset!");

}

