#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Launched_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Launched_Parent.GA_Launched_Parent_C.ApplyVisualFeedback
// 0x0001 (0x0001 - 0x0000)
struct GA_Launched_Parent_C_ApplyVisualFeedback final
{
public:
	bool                                          bEndAbility;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Launched_Parent_C_ApplyVisualFeedback) == 0x000001, "Wrong alignment on GA_Launched_Parent_C_ApplyVisualFeedback");
static_assert(sizeof(GA_Launched_Parent_C_ApplyVisualFeedback) == 0x000001, "Wrong size on GA_Launched_Parent_C_ApplyVisualFeedback");
static_assert(offsetof(GA_Launched_Parent_C_ApplyVisualFeedback, bEndAbility) == 0x000000, "Member 'GA_Launched_Parent_C_ApplyVisualFeedback::bEndAbility' has a wrong offset!");

// Function GA_Launched_Parent.GA_Launched_Parent_C.AttemptLaunchFortPawn
// 0x0008 (0x0008 - 0x0000)
struct GA_Launched_Parent_C_AttemptLaunchFortPawn final
{
public:
	class AFortPawn*                              FortPawn;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Launched_Parent_C_AttemptLaunchFortPawn) == 0x000008, "Wrong alignment on GA_Launched_Parent_C_AttemptLaunchFortPawn");
static_assert(sizeof(GA_Launched_Parent_C_AttemptLaunchFortPawn) == 0x000008, "Wrong size on GA_Launched_Parent_C_AttemptLaunchFortPawn");
static_assert(offsetof(GA_Launched_Parent_C_AttemptLaunchFortPawn, FortPawn) == 0x000000, "Member 'GA_Launched_Parent_C_AttemptLaunchFortPawn::FortPawn' has a wrong offset!");

// Function GA_Launched_Parent.GA_Launched_Parent_C.AttemptLaunchVehicle
// 0x0008 (0x0008 - 0x0000)
struct GA_Launched_Parent_C_AttemptLaunchVehicle final
{
public:
	class AFortAthenaVehicle*                     Vehicle;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Launched_Parent_C_AttemptLaunchVehicle) == 0x000008, "Wrong alignment on GA_Launched_Parent_C_AttemptLaunchVehicle");
static_assert(sizeof(GA_Launched_Parent_C_AttemptLaunchVehicle) == 0x000008, "Wrong size on GA_Launched_Parent_C_AttemptLaunchVehicle");
static_assert(offsetof(GA_Launched_Parent_C_AttemptLaunchVehicle, Vehicle) == 0x000000, "Member 'GA_Launched_Parent_C_AttemptLaunchVehicle::Vehicle' has a wrong offset!");

// Function GA_Launched_Parent.GA_Launched_Parent_C.ExecuteUbergraph_GA_Launched_Parent
// 0x03D0 (0x03D0 - 0x0000)
struct GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetSourceObject_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetFortActorFromInfo_Actor;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFortActorFromInfo_Valid;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABGA_DirectionalLaunchParent_C*         K2Node_DynamicCast_AsBGA_Directional_Launch_Parent; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_CustomEvent_FortPawn;                       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     K2Node_CustomEvent_Vehicle;                        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EMovementMode NewMovementMode)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B0(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x00BC(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_1;               // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C6[0x2];                                       // 0x00C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetSourceObject_ReturnValue_1;            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x0100(0x00E0)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABGA_DirectionalLaunchParent_C*         K2Node_DynamicCast_AsBGA_Directional_Launch_Parent_1; // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Get_Launch_Toward_Launch_Target_Angle_ReturnValue; // 0x01F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerDeployEnabled_ReturnValue;        // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0210(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue_1;       // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetFortActorFromInfo_Actor_1;             // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFortActorFromInfo_Valid_1;             // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              CallFunc_IsPlayerBeingLaunched_AsFort_Pawn;        // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerBeingLaunched_Valid;              // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVehicleBeingLaunched_Valid;             // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_292[0x6];                                      // 0x0292(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaVehicle*                     CallFunc_IsVehicleBeingLaunched_AsFort_Athena_Vehicle; // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 K2Node_CustomEvent_NewMovementMode;                // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x02A4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetFortActorFromInfo_Actor_2;             // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFortActorFromInfo_Valid_2;             // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEndAbility;                    // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CB[0x1];                                      // 0x02CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x02D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x02D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue_2;               // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 Temp_byte_Variable;                                // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E3[0x5];                                      // 0x02E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitMovementModeChange*    CallFunc_CreateWaitMovementModeChange_ReturnValue; // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x02F4(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetFortActorFromInfo_Actor_3;             // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFortActorFromInfo_Valid_3;             // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x030C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_2;           // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue; // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetFortActorFromInfo_Actor_4;             // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFortActorFromInfo_Valid_4;             // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue;   // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_342[0x6];                                      // 0x0342(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_3;           // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetFortActorFromInfo_Actor_5;             // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFortActorFromInfo_Valid_5;             // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x0368(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue_1; // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RemoveActiveGameplayEffect_ReturnValue_2; // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_372[0x6];                                      // 0x0372(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_4;           // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AActor>                     CallFunc_GetInterfaceClass_ReturnValue;            // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_3;  // 0x0390(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetFortActorFromInfo_Actor_6;             // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetFortActorFromInfo_Valid_6;             // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A1[0x3];                                      // 0x03A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2; // 0x03A4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_5;           // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_4;  // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithAppliedTags_ReturnValue; // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent) == 0x000008, "Wrong alignment on GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent");
static_assert(sizeof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent) == 0x0003D0, "Wrong size on GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, EntryPoint) == 0x000000, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetSourceObject_ReturnValue) == 0x000010, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetSourceObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetFortActorFromInfo_Actor) == 0x000018, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetFortActorFromInfo_Actor' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetFortActorFromInfo_Valid) == 0x000020, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetFortActorFromInfo_Valid' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_DynamicCast_AsBGA_Directional_Launch_Parent) == 0x000028, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_DynamicCast_AsBGA_Directional_Launch_Parent' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000038, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetValueAtLevel_ReturnValue) == 0x000050, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000058, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000070, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000080, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_CustomEvent_FortPawn) == 0x000088, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_CustomEvent_FortPawn' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000090, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_DynamicCast_AsFort_AIPawn) == 0x000098, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_CustomEvent_Vehicle) == 0x0000A8, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_CustomEvent_Vehicle' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B0, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x0000BC, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_IsValidClass_ReturnValue) == 0x0000C4, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_IsValidClass_ReturnValue_1) == 0x0000C5, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_IsValidClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x0000C8, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000CC, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000D0, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x0000E8, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000F0, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetSourceObject_ReturnValue_1) == 0x0000F8, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetSourceObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_CustomEvent_Hit) == 0x000100, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_DynamicCast_AsBGA_Directional_Launch_Parent_1) == 0x0001E0, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_DynamicCast_AsBGA_Directional_Launch_Parent_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_DynamicCast_bSuccess_3) == 0x0001E8, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_IsValid_ReturnValue_1) == 0x0001E9, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_Get_Launch_Toward_Launch_Target_Angle_ReturnValue) == 0x0001F0, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_Get_Launch_Toward_Launch_Target_Angle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_IsPlayerDeployEnabled_ReturnValue) == 0x000208, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_IsPlayerDeployEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x000210, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_Conv_RotatorToVector_ReturnValue_1) == 0x000228, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_Conv_RotatorToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x000240, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_SelectVector_ReturnValue) == 0x000248, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetFortActorFromInfo_Actor_1) == 0x000260, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetFortActorFromInfo_Actor_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetFortActorFromInfo_Valid_1) == 0x000268, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetFortActorFromInfo_Valid_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000270, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_IsPlayerBeingLaunched_AsFort_Pawn) == 0x000288, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_IsPlayerBeingLaunched_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_IsPlayerBeingLaunched_Valid) == 0x000290, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_IsPlayerBeingLaunched_Valid' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_IsVehicleBeingLaunched_Valid) == 0x000291, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_IsVehicleBeingLaunched_Valid' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_IsVehicleBeingLaunched_AsFort_Athena_Vehicle) == 0x000298, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_IsVehicleBeingLaunched_AsFort_Athena_Vehicle' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_CustomEvent_NewMovementMode) == 0x0002A0, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_CustomEvent_NewMovementMode' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002A4, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetFortActorFromInfo_Actor_2) == 0x0002B0, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetFortActorFromInfo_Actor_2' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetFortActorFromInfo_Valid_2) == 0x0002B8, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetFortActorFromInfo_Valid_2' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x0002C0, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_DynamicCast_bSuccess_4) == 0x0002C8, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_CustomEvent_bEndAbility) == 0x0002C9, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_CustomEvent_bEndAbility' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_Event_bWasCancelled) == 0x0002CA, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetValueAtLevel_ReturnValue_4) == 0x0002CC, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetValueAtLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0002D0, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1) == 0x0002D8, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_IsValidClass_ReturnValue_2) == 0x0002E0, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_IsValidClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, Temp_byte_Variable) == 0x0002E1, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_IsServer_ReturnValue) == 0x0002E2, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_CreateWaitMovementModeChange_ReturnValue) == 0x0002E8, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_CreateWaitMovementModeChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_IsValid_ReturnValue_2) == 0x0002F0, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002F4, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetFortActorFromInfo_Actor_3) == 0x000300, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetFortActorFromInfo_Actor_3' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetFortActorFromInfo_Valid_3) == 0x000308, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetFortActorFromInfo_Valid_3' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_CreateDelegate_OutputDelegate_4) == 0x00030C, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_DynamicCast_AsFort_Player_Pawn_2) == 0x000318, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_DynamicCast_AsFort_Player_Pawn_2' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_DynamicCast_bSuccess_5) == 0x000320, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000328, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue) == 0x000330, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_RemoveActiveEffectsWithGrantedTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_IsValid_ReturnValue_3) == 0x000334, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetFortActorFromInfo_Actor_4) == 0x000338, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetFortActorFromInfo_Actor_4' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetFortActorFromInfo_Valid_4) == 0x000340, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetFortActorFromInfo_Valid_4' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_RemoveActiveGameplayEffect_ReturnValue) == 0x000341, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_RemoveActiveGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_DynamicCast_AsFort_Player_Pawn_3) == 0x000348, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_DynamicCast_AsFort_Player_Pawn_3' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_DynamicCast_bSuccess_6) == 0x000350, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetFortActorFromInfo_Actor_5) == 0x000358, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetFortActorFromInfo_Actor_5' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetFortActorFromInfo_Valid_5) == 0x000360, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetFortActorFromInfo_Valid_5' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetAbilitySystemComponent_ReturnValue_2) == 0x000368, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_RemoveActiveGameplayEffect_ReturnValue_1) == 0x000370, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_RemoveActiveGameplayEffect_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_RemoveActiveGameplayEffect_ReturnValue_2) == 0x000371, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_RemoveActiveGameplayEffect_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_DynamicCast_AsFort_Player_Pawn_4) == 0x000378, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_DynamicCast_AsFort_Player_Pawn_4' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_DynamicCast_bSuccess_7) == 0x000380, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetInterfaceClass_ReturnValue) == 0x000388, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetInterfaceClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetAbilitySystemComponent_ReturnValue_3) == 0x000390, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetAbilitySystemComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetFortActorFromInfo_Actor_6) == 0x000398, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetFortActorFromInfo_Actor_6' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetFortActorFromInfo_Valid_6) == 0x0003A0, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetFortActorFromInfo_Valid_6' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2) == 0x0003A4, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_DynamicCast_AsFort_Player_Pawn_5) == 0x0003B0, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_DynamicCast_AsFort_Player_Pawn_5' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, K2Node_DynamicCast_bSuccess_8) == 0x0003B8, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_GetAbilitySystemComponent_ReturnValue_4) == 0x0003C0, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_GetAbilitySystemComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent, CallFunc_RemoveActiveEffectsWithAppliedTags_ReturnValue) == 0x0003C8, "Member 'GA_Launched_Parent_C_ExecuteUbergraph_GA_Launched_Parent::CallFunc_RemoveActiveEffectsWithAppliedTags_ReturnValue' has a wrong offset!");

// Function GA_Launched_Parent.GA_Launched_Parent_C.Get Launch Toward Launch Target Angle
// 0x00E0 (0x00E0 - 0x0000)
struct GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Launcher;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HorizontalOnly;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle) == 0x000008, "Wrong alignment on GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle");
static_assert(sizeof(GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle) == 0x0000E0, "Wrong size on GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle");
static_assert(offsetof(GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle, Target) == 0x000000, "Member 'GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle::Target' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle, Launcher) == 0x000008, "Member 'GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle::Launcher' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle, HorizontalOnly) == 0x000010, "Member 'GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle::HorizontalOnly' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle, ReturnValue) == 0x000018, "Member 'GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000030, "Member 'GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000048, "Member 'GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle, CallFunc_BreakVector_X) == 0x000060, "Member 'GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle, CallFunc_BreakVector_Y) == 0x000064, "Member 'GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle, CallFunc_BreakVector_Z) == 0x000068, "Member 'GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle, CallFunc_BreakVector_X_1) == 0x00006C, "Member 'GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle, CallFunc_BreakVector_Y_1) == 0x000070, "Member 'GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle, CallFunc_BreakVector_Z_1) == 0x000074, "Member 'GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle, CallFunc_SelectFloat_ReturnValue) == 0x000078, "Member 'GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle, CallFunc_SelectFloat_ReturnValue_1) == 0x00007C, "Member 'GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle, CallFunc_MakeVector_ReturnValue) == 0x000080, "Member 'GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle, CallFunc_MakeVector_ReturnValue_1) == 0x000098, "Member 'GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000B0, "Member 'GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle, CallFunc_Normal_ReturnValue) == 0x0000C8, "Member 'GA_Launched_Parent_C_Get_Launch_Toward_Launch_Target_Angle::CallFunc_Normal_ReturnValue' has a wrong offset!");

// Function GA_Launched_Parent.GA_Launched_Parent_C.GetFortActorFromInfo
// 0x0020 (0x0020 - 0x0000)
struct GA_Launched_Parent_C_GetFortActorFromInfo final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Valid;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Launched_Parent_C_GetFortActorFromInfo) == 0x000008, "Wrong alignment on GA_Launched_Parent_C_GetFortActorFromInfo");
static_assert(sizeof(GA_Launched_Parent_C_GetFortActorFromInfo) == 0x000020, "Wrong size on GA_Launched_Parent_C_GetFortActorFromInfo");
static_assert(offsetof(GA_Launched_Parent_C_GetFortActorFromInfo, Actor) == 0x000000, "Member 'GA_Launched_Parent_C_GetFortActorFromInfo::Actor' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_GetFortActorFromInfo, Valid) == 0x000008, "Member 'GA_Launched_Parent_C_GetFortActorFromInfo::Valid' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_GetFortActorFromInfo, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000010, "Member 'GA_Launched_Parent_C_GetFortActorFromInfo::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Launched_Parent_C_GetFortActorFromInfo, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'GA_Launched_Parent_C_GetFortActorFromInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GA_Launched_Parent.GA_Launched_Parent_C.GetSourceObject
// 0x0028 (0x0028 - 0x0000)
struct GA_Launched_Parent_C_GetSourceObject final
{
public:
