#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_MoveTool_PlayAnimation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_MoveTool_PlayAnimation.GA_MoveTool_PlayAnimation_C.ExecuteUbergraph_GA_MoveTool_PlayAnimation
// 0x0068 (0x0068 - 0x0000)
struct GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x001C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0028(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation) == 0x000008, "Wrong alignment on GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation");
static_assert(sizeof(GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation) == 0x000068, "Wrong size on GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation");
static_assert(offsetof(GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation, EntryPoint) == 0x000000, "Member 'GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation, K2Node_CreateDelegate_OutputDelegate_2) == 0x00001C, "Member 'GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation, K2Node_CreateDelegate_OutputDelegate_3) == 0x000028, "Member 'GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation, CallFunc_K2_CommitAbility_ReturnValue) == 0x000034, "Member 'GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000038, "Member 'GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000040, "Member 'GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'GA_MoveTool_PlayAnimation_C_ExecuteUbergraph_GA_MoveTool_PlayAnimation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

