#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_NPC_Converted_Teleport

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_NPC_Converted_Teleport.GA_NPC_Converted_Teleport_C
// 0x0048 (0x0B58 - 0x0B10)
class UGA_NPC_Converted_Teleport_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   TeleportLocationBBKeyName;                         // 0x0B18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Converted_Teleport_Start;                       // 0x0B1C(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Converted_Teleport_End;                         // 0x0B20(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B24[0x4];                                      // 0x0B24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PawnLocationBeforeTeleport;                        // 0x0B28(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               PawnRotationBeforeTeleport;                        // 0x0B40(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnTeleportSuccess_Multicast(const struct FVector& PawnLocationBeforeTeleport_0, const struct FRotator& PawnRotationBeforeTeleport_0, const struct FVector& PawnLocationAfterTeleport, struct FRotator& PawnRotationAfterTeleport);
	void K2_ActivateAbility();
	void ExecuteUbergraph_GA_NPC_Converted_Teleport(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_NPC_Converted_Teleport_C">();
	}
	static class UGA_NPC_Converted_Teleport_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_NPC_Converted_Teleport_C>();
	}
};
static_assert(alignof(UGA_NPC_Converted_Teleport_C) == 0x000008, "Wrong alignment on UGA_NPC_Converted_Teleport_C");
static_assert(sizeof(UGA_NPC_Converted_Teleport_C) == 0x000B58, "Wrong size on UGA_NPC_Converted_Teleport_C");
static_assert(offsetof(UGA_NPC_Converted_Teleport_C, UberGraphFrame) == 0x000B10, "Member 'UGA_NPC_Converted_Teleport_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_NPC_Converted_Teleport_C, TeleportLocationBBKeyName) == 0x000B18, "Member 'UGA_NPC_Converted_Teleport_C::TeleportLocationBBKeyName' has a wrong offset!");
static_assert(offsetof(UGA_NPC_Converted_Teleport_C, GC_Converted_Teleport_Start) == 0x000B1C, "Member 'UGA_NPC_Converted_Teleport_C::GC_Converted_Teleport_Start' has a wrong offset!");
static_assert(offsetof(UGA_NPC_Converted_Teleport_C, GC_Converted_Teleport_End) == 0x000B20, "Member 'UGA_NPC_Converted_Teleport_C::GC_Converted_Teleport_End' has a wrong offset!");
static_assert(offsetof(UGA_NPC_Converted_Teleport_C, PawnLocationBeforeTeleport) == 0x000B28, "Member 'UGA_NPC_Converted_Teleport_C::PawnLocationBeforeTeleport' has a wrong offset!");
static_assert(offsetof(UGA_NPC_Converted_Teleport_C, PawnRotationBeforeTeleport) == 0x000B40, "Member 'UGA_NPC_Converted_Teleport_C::PawnRotationBeforeTeleport' has a wrong offset!");

}

