#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_NPC_Converted_Teleport

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_NPC_Converted_Teleport.GA_NPC_Converted_Teleport_C.OnTeleportSuccess_Multicast
// 0x0060 (0x0060 - 0x0000)
struct GA_NPC_Converted_Teleport_C_OnTeleportSuccess_Multicast final
{
public:
	struct FVector                                PawnLocationBeforeTeleport_0;                      // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               PawnRotationBeforeTeleport_0;                      // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
	struct FVector                                PawnLocationAfterTeleport;                         // 0x0030(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               PawnRotationAfterTeleport;                         // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_NPC_Converted_Teleport_C_OnTeleportSuccess_Multicast) == 0x000008, "Wrong alignment on GA_NPC_Converted_Teleport_C_OnTeleportSuccess_Multicast");
static_assert(sizeof(GA_NPC_Converted_Teleport_C_OnTeleportSuccess_Multicast) == 0x000060, "Wrong size on GA_NPC_Converted_Teleport_C_OnTeleportSuccess_Multicast");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_OnTeleportSuccess_Multicast, PawnLocationBeforeTeleport_0) == 0x000000, "Member 'GA_NPC_Converted_Teleport_C_OnTeleportSuccess_Multicast::PawnLocationBeforeTeleport_0' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_OnTeleportSuccess_Multicast, PawnRotationBeforeTeleport_0) == 0x000018, "Member 'GA_NPC_Converted_Teleport_C_OnTeleportSuccess_Multicast::PawnRotationBeforeTeleport_0' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_OnTeleportSuccess_Multicast, PawnLocationAfterTeleport) == 0x000030, "Member 'GA_NPC_Converted_Teleport_C_OnTeleportSuccess_Multicast::PawnLocationAfterTeleport' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_OnTeleportSuccess_Multicast, PawnRotationAfterTeleport) == 0x000048, "Member 'GA_NPC_Converted_Teleport_C_OnTeleportSuccess_Multicast::PawnRotationAfterTeleport' has a wrong offset!");

// Function GA_NPC_Converted_Teleport.GA_NPC_Converted_Teleport_C.ExecuteUbergraph_GA_NPC_Converted_Teleport
// 0x0120 (0x0120 - 0x0000)
struct GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_PawnLocationBeforeTeleport;     // 0x0008(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_PawnRotationBeforeTeleport;     // 0x0020(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_CustomEvent_PawnLocationAfterTeleport;      // 0x0038(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_CustomEvent_PawnRotationAfterTeleport;      // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetValueAsVector_ReturnValue;             // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidAILocation_ReturnValue;            // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TeleportPlayerPawn_ReturnValue;           // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport) == 0x000008, "Wrong alignment on GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport");
static_assert(sizeof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport) == 0x000120, "Wrong size on GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport, EntryPoint) == 0x000000, "Member 'GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport, K2Node_CustomEvent_PawnLocationBeforeTeleport) == 0x000008, "Member 'GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport::K2Node_CustomEvent_PawnLocationBeforeTeleport' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport, K2Node_CustomEvent_PawnRotationBeforeTeleport) == 0x000020, "Member 'GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport::K2Node_CustomEvent_PawnRotationBeforeTeleport' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport, K2Node_CustomEvent_PawnLocationAfterTeleport) == 0x000038, "Member 'GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport::K2Node_CustomEvent_PawnLocationAfterTeleport' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport, K2Node_CustomEvent_PawnRotationAfterTeleport) == 0x000050, "Member 'GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport::K2Node_CustomEvent_PawnRotationAfterTeleport' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000068, "Member 'GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x000070, "Member 'GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000078, "Member 'GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport, CallFunc_K2_CommitAbility_ReturnValue) == 0x000080, "Member 'GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000088, "Member 'GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000098, "Member 'GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B0, "Member 'GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x0000C8, "Member 'GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000E0, "Member 'GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport, CallFunc_GetBlackboard_ReturnValue) == 0x0000F8, "Member 'GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport, CallFunc_GetValueAsVector_ReturnValue) == 0x000100, "Member 'GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport::CallFunc_GetValueAsVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport, CallFunc_IsValidAILocation_ReturnValue) == 0x000118, "Member 'GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport::CallFunc_IsValidAILocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport, CallFunc_TeleportPlayerPawn_ReturnValue) == 0x000119, "Member 'GA_NPC_Converted_Teleport_C_ExecuteUbergraph_GA_NPC_Converted_Teleport::CallFunc_TeleportPlayerPawn_ReturnValue' has a wrong offset!");

}

