#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_PlayerCrafting

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_PlayerCrafting.GA_PlayerCrafting_C
// 0x0070 (0x0B80 - 0x0B10)
class UGA_PlayerCrafting_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           CueTag;                                            // 0x0B18(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GEH_CraftingTag;                                   // 0x0B1C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B24[0x4];                                      // 0x0B24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_CraftingTag;                                    // 0x0B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  T_PlayerCraftingActive;                            // 0x0B30(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_BlockCraftingActivation;                        // 0x0B50(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bCraftingActive;                                   // 0x0B70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B71[0x7];                                      // 0x0B71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           MontageToPlay;                                     // 0x0B78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EventReceived_57F1DCDD4D3AA3A380A3D9839BCF26BE(const struct FGameplayEventData& Payload);
	void EventReceived_DCD5956A4964EBC68CAB88B9CD2C5333(const struct FGameplayEventData& Payload);
	void EventReceived_F2D0070C459D3DA82EAB0F9C904FD8B8(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_PlayerCrafting(int32 EntryPoint);
	void HandleCraftingDone(bool bCancelled);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_OverrideFailedReason(const struct FGameplayTagContainer& FailedReason, struct FGameplayTagContainer* OverridenFailedReason);
	void OnBlendOut_DECFCC1F47BBB03F98A507BA19C95624(const struct FGameplayTag& NotifyTag);
	void OnCancelled_DECFCC1F47BBB03F98A507BA19C95624(const struct FGameplayTag& NotifyTag);
	void OnCompleted_DECFCC1F47BBB03F98A507BA19C95624(const struct FGameplayTag& NotifyTag);
	void OnInterrupted_DECFCC1F47BBB03F98A507BA19C95624(const struct FGameplayTag& NotifyTag);
	void OnNotifyBegin_DECFCC1F47BBB03F98A507BA19C95624(const struct FGameplayTag& NotifyTag);
	void OnNotifyEnd_DECFCC1F47BBB03F98A507BA19C95624(const struct FGameplayTag& NotifyTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_PlayerCrafting_C">();
	}
	static class UGA_PlayerCrafting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_PlayerCrafting_C>();
	}
};
static_assert(alignof(UGA_PlayerCrafting_C) == 0x000008, "Wrong alignment on UGA_PlayerCrafting_C");
static_assert(sizeof(UGA_PlayerCrafting_C) == 0x000B80, "Wrong size on UGA_PlayerCrafting_C");
static_assert(offsetof(UGA_PlayerCrafting_C, UberGraphFrame) == 0x000B10, "Member 'UGA_PlayerCrafting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_PlayerCrafting_C, CueTag) == 0x000B18, "Member 'UGA_PlayerCrafting_C::CueTag' has a wrong offset!");
static_assert(offsetof(UGA_PlayerCrafting_C, GEH_CraftingTag) == 0x000B1C, "Member 'UGA_PlayerCrafting_C::GEH_CraftingTag' has a wrong offset!");
static_assert(offsetof(UGA_PlayerCrafting_C, GE_CraftingTag) == 0x000B28, "Member 'UGA_PlayerCrafting_C::GE_CraftingTag' has a wrong offset!");
static_assert(offsetof(UGA_PlayerCrafting_C, T_PlayerCraftingActive) == 0x000B30, "Member 'UGA_PlayerCrafting_C::T_PlayerCraftingActive' has a wrong offset!");
static_assert(offsetof(UGA_PlayerCrafting_C, TC_BlockCraftingActivation) == 0x000B50, "Member 'UGA_PlayerCrafting_C::TC_BlockCraftingActivation' has a wrong offset!");
static_assert(offsetof(UGA_PlayerCrafting_C, bCraftingActive) == 0x000B70, "Member 'UGA_PlayerCrafting_C::bCraftingActive' has a wrong offset!");
static_assert(offsetof(UGA_PlayerCrafting_C, MontageToPlay) == 0x000B78, "Member 'UGA_PlayerCrafting_C::MontageToPlay' has a wrong offset!");

}

