#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_PlayerCrafting

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_PlayerCrafting.GA_PlayerCrafting_C.EventReceived_57F1DCDD4D3AA3A380A3D9839BCF26BE
// 0x00B0 (0x00B0 - 0x0000)
struct GA_PlayerCrafting_C_EventReceived_57F1DCDD4D3AA3A380A3D9839BCF26BE final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_PlayerCrafting_C_EventReceived_57F1DCDD4D3AA3A380A3D9839BCF26BE) == 0x000008, "Wrong alignment on GA_PlayerCrafting_C_EventReceived_57F1DCDD4D3AA3A380A3D9839BCF26BE");
static_assert(sizeof(GA_PlayerCrafting_C_EventReceived_57F1DCDD4D3AA3A380A3D9839BCF26BE) == 0x0000B0, "Wrong size on GA_PlayerCrafting_C_EventReceived_57F1DCDD4D3AA3A380A3D9839BCF26BE");
static_assert(offsetof(GA_PlayerCrafting_C_EventReceived_57F1DCDD4D3AA3A380A3D9839BCF26BE, Payload) == 0x000000, "Member 'GA_PlayerCrafting_C_EventReceived_57F1DCDD4D3AA3A380A3D9839BCF26BE::Payload' has a wrong offset!");

// Function GA_PlayerCrafting.GA_PlayerCrafting_C.EventReceived_DCD5956A4964EBC68CAB88B9CD2C5333
// 0x00B0 (0x00B0 - 0x0000)
struct GA_PlayerCrafting_C_EventReceived_DCD5956A4964EBC68CAB88B9CD2C5333 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_PlayerCrafting_C_EventReceived_DCD5956A4964EBC68CAB88B9CD2C5333) == 0x000008, "Wrong alignment on GA_PlayerCrafting_C_EventReceived_DCD5956A4964EBC68CAB88B9CD2C5333");
static_assert(sizeof(GA_PlayerCrafting_C_EventReceived_DCD5956A4964EBC68CAB88B9CD2C5333) == 0x0000B0, "Wrong size on GA_PlayerCrafting_C_EventReceived_DCD5956A4964EBC68CAB88B9CD2C5333");
static_assert(offsetof(GA_PlayerCrafting_C_EventReceived_DCD5956A4964EBC68CAB88B9CD2C5333, Payload) == 0x000000, "Member 'GA_PlayerCrafting_C_EventReceived_DCD5956A4964EBC68CAB88B9CD2C5333::Payload' has a wrong offset!");

// Function GA_PlayerCrafting.GA_PlayerCrafting_C.EventReceived_F2D0070C459D3DA82EAB0F9C904FD8B8
// 0x00B0 (0x00B0 - 0x0000)
struct GA_PlayerCrafting_C_EventReceived_F2D0070C459D3DA82EAB0F9C904FD8B8 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_PlayerCrafting_C_EventReceived_F2D0070C459D3DA82EAB0F9C904FD8B8) == 0x000008, "Wrong alignment on GA_PlayerCrafting_C_EventReceived_F2D0070C459D3DA82EAB0F9C904FD8B8");
static_assert(sizeof(GA_PlayerCrafting_C_EventReceived_F2D0070C459D3DA82EAB0F9C904FD8B8) == 0x0000B0, "Wrong size on GA_PlayerCrafting_C_EventReceived_F2D0070C459D3DA82EAB0F9C904FD8B8");
static_assert(offsetof(GA_PlayerCrafting_C_EventReceived_F2D0070C459D3DA82EAB0F9C904FD8B8, Payload) == 0x000000, "Member 'GA_PlayerCrafting_C_EventReceived_F2D0070C459D3DA82EAB0F9C904FD8B8::Payload' has a wrong offset!");

// Function GA_PlayerCrafting.GA_PlayerCrafting_C.ExecuteUbergraph_GA_PlayerCrafting
// 0x06A8 (0x06A8 - 0x0000)
struct GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitNotify* CallFunc_PlayMontageAndWaitNotify_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x0020(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00D0(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x018C(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0198(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable_1;                            // 0x0248(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0304(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_5;                    // 0x0310(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_4;                    // 0x0314(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0318(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0324(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_3;                    // 0x0330(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_2;                    // 0x0334(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0338(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0344(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_1;                    // 0x0350(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag;                      // 0x0354(0x0004)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0358(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Temp_struct_Variable_2;                            // 0x0364(0x0004)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0368(0x00B0)(ConstParm)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0419(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41A[0x6];                                      // 0x041A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0420(0x00D0)(ContainsInstancedReference)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F1[0x7];                                      // 0x04F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue;    // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0500(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x7];                                      // 0x0501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_1;  // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x3];                                      // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0514(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_2;  // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_2;          // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0531(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0532(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_533[0x5];                                      // 0x0533(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     Temp_struct_Variable_3;                            // 0x0540(0x00B0)()
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x05F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_2;                      // 0x05F8(0x00B0)()
};
static_assert(alignof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting) == 0x000008, "Wrong alignment on GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting");
static_assert(sizeof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting) == 0x0006A8, "Wrong size on GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, EntryPoint) == 0x000000, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, CallFunc_PlayMontageAndWaitNotify_ReturnValue) == 0x000008, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::CallFunc_PlayMontageAndWaitNotify_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, K2Node_CustomEvent_Payload_1) == 0x000020, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, Temp_struct_Variable) == 0x0000D0, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000180, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, CallFunc_IsValid_ReturnValue_1) == 0x000188, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, K2Node_CreateDelegate_OutputDelegate_1) == 0x00018C, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, K2Node_CustomEvent_Payload) == 0x000198, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, Temp_struct_Variable_1) == 0x000248, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x0002F8, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, CallFunc_IsValid_ReturnValue_2) == 0x000300, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, K2Node_CreateDelegate_OutputDelegate_2) == 0x000304, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, K2Node_CustomEvent_NotifyTag_5) == 0x000310, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::K2Node_CustomEvent_NotifyTag_5' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, K2Node_CustomEvent_NotifyTag_4) == 0x000314, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::K2Node_CustomEvent_NotifyTag_4' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, K2Node_CreateDelegate_OutputDelegate_3) == 0x000318, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, K2Node_CreateDelegate_OutputDelegate_4) == 0x000324, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, K2Node_CustomEvent_NotifyTag_3) == 0x000330, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::K2Node_CustomEvent_NotifyTag_3' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, K2Node_CustomEvent_NotifyTag_2) == 0x000334, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::K2Node_CustomEvent_NotifyTag_2' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, K2Node_CreateDelegate_OutputDelegate_5) == 0x000338, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, K2Node_CreateDelegate_OutputDelegate_6) == 0x000344, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, K2Node_CustomEvent_NotifyTag_1) == 0x000350, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::K2Node_CustomEvent_NotifyTag_1' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, K2Node_CustomEvent_NotifyTag) == 0x000354, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::K2Node_CustomEvent_NotifyTag' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, K2Node_CreateDelegate_OutputDelegate_7) == 0x000358, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, Temp_struct_Variable_2) == 0x000364, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, K2Node_Event_EventData) == 0x000368, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, K2Node_Event_bWasCancelled) == 0x000418, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, CallFunc_K2_CommitAbility_ReturnValue) == 0x000419, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000420, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x0004F0, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue) == 0x0004F8, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, CallFunc_IsValid_ReturnValue_3) == 0x000500, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_1) == 0x000508, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, CallFunc_IsValid_ReturnValue_4) == 0x000510, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, K2Node_CreateDelegate_OutputDelegate_8) == 0x000514, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_2) == 0x000520, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::CallFunc_GetAvatarAsFortPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, CallFunc_WaitGameplayEvent_ReturnValue_2) == 0x000528, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::CallFunc_WaitGameplayEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, CallFunc_IsValid_ReturnValue_5) == 0x000530, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, CallFunc_BooleanAND_ReturnValue) == 0x000531, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, CallFunc_IsValid_ReturnValue_6) == 0x000532, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000538, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, Temp_struct_Variable_3) == 0x000540, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x0005F0, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting, K2Node_CustomEvent_Payload_2) == 0x0005F8, "Member 'GA_PlayerCrafting_C_ExecuteUbergraph_GA_PlayerCrafting::K2Node_CustomEvent_Payload_2' has a wrong offset!");

// Function GA_PlayerCrafting.GA_PlayerCrafting_C.HandleCraftingDone
// 0x0001 (0x0001 - 0x0000)
struct GA_PlayerCrafting_C_HandleCraftingDone final
{
public:
	bool                                          bCancelled;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_PlayerCrafting_C_HandleCraftingDone) == 0x000001, "Wrong alignment on GA_PlayerCrafting_C_HandleCraftingDone");
static_assert(sizeof(GA_PlayerCrafting_C_HandleCraftingDone) == 0x000001, "Wrong size on GA_PlayerCrafting_C_HandleCraftingDone");
static_assert(offsetof(GA_PlayerCrafting_C_HandleCraftingDone, bCancelled) == 0x000000, "Member 'GA_PlayerCrafting_C_HandleCraftingDone::bCancelled' has a wrong offset!");

// Function GA_PlayerCrafting.GA_PlayerCrafting_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_PlayerCrafting_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_PlayerCrafting_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_PlayerCrafting_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_PlayerCrafting_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_PlayerCrafting_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_PlayerCrafting_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_PlayerCrafting_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_PlayerCrafting.GA_PlayerCrafting_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_PlayerCrafting_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_PlayerCrafting_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_PlayerCrafting_C_K2_OnEndAbility");
static_assert(sizeof(GA_PlayerCrafting_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_PlayerCrafting_C_K2_OnEndAbility");
static_assert(offsetof(GA_PlayerCrafting_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_PlayerCrafting_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_PlayerCrafting.GA_PlayerCrafting_C.K2_OverrideFailedReason
// 0x0040 (0x0040 - 0x0000)
struct GA_PlayerCrafting_C_K2_OverrideFailedReason final
{
public:
	struct FGameplayTagContainer                  FailedReason;                                      // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTagContainer                  OverridenFailedReason;                             // 0x0020(0x0020)(Parm, OutParm)
};
static_assert(alignof(GA_PlayerCrafting_C_K2_OverrideFailedReason) == 0x000008, "Wrong alignment on GA_PlayerCrafting_C_K2_OverrideFailedReason");
static_assert(sizeof(GA_PlayerCrafting_C_K2_OverrideFailedReason) == 0x000040, "Wrong size on GA_PlayerCrafting_C_K2_OverrideFailedReason");
static_assert(offsetof(GA_PlayerCrafting_C_K2_OverrideFailedReason, FailedReason) == 0x000000, "Member 'GA_PlayerCrafting_C_K2_OverrideFailedReason::FailedReason' has a wrong offset!");
static_assert(offsetof(GA_PlayerCrafting_C_K2_OverrideFailedReason, OverridenFailedReason) == 0x000020, "Member 'GA_PlayerCrafting_C_K2_OverrideFailedReason::OverridenFailedReason' has a wrong offset!");

// Function GA_PlayerCrafting.GA_PlayerCrafting_C.OnBlendOut_DECFCC1F47BBB03F98A507BA19C95624
// 0x0004 (0x0004 - 0x0000)
struct GA_PlayerCrafting_C_OnBlendOut_DECFCC1F47BBB03F98A507BA19C95624 final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_PlayerCrafting_C_OnBlendOut_DECFCC1F47BBB03F98A507BA19C95624) == 0x000004, "Wrong alignment on GA_PlayerCrafting_C_OnBlendOut_DECFCC1F47BBB03F98A507BA19C95624");
static_assert(sizeof(GA_PlayerCrafting_C_OnBlendOut_DECFCC1F47BBB03F98A507BA19C95624) == 0x000004, "Wrong size on GA_PlayerCrafting_C_OnBlendOut_DECFCC1F47BBB03F98A507BA19C95624");
static_assert(offsetof(GA_PlayerCrafting_C_OnBlendOut_DECFCC1F47BBB03F98A507BA19C95624, NotifyTag) == 0x000000, "Member 'GA_PlayerCrafting_C_OnBlendOut_DECFCC1F47BBB03F98A507BA19C95624::NotifyTag' has a wrong offset!");

// Function GA_PlayerCrafting.GA_PlayerCrafting_C.OnCancelled_DECFCC1F47BBB03F98A507BA19C95624
// 0x0004 (0x0004 - 0x0000)
struct GA_PlayerCrafting_C_OnCancelled_DECFCC1F47BBB03F98A507BA19C95624 final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_PlayerCrafting_C_OnCancelled_DECFCC1F47BBB03F98A507BA19C95624) == 0x000004, "Wrong alignment on GA_PlayerCrafting_C_OnCancelled_DECFCC1F47BBB03F98A507BA19C95624");
static_assert(sizeof(GA_PlayerCrafting_C_OnCancelled_DECFCC1F47BBB03F98A507BA19C95624) == 0x000004, "Wrong size on GA_PlayerCrafting_C_OnCancelled_DECFCC1F47BBB03F98A507BA19C95624");
static_assert(offsetof(GA_PlayerCrafting_C_OnCancelled_DECFCC1F47BBB03F98A507BA19C95624, NotifyTag) == 0x000000, "Member 'GA_PlayerCrafting_C_OnCancelled_DECFCC1F47BBB03F98A507BA19C95624::NotifyTag' has a wrong offset!");

// Function GA_PlayerCrafting.GA_PlayerCrafting_C.OnCompleted_DECFCC1F47BBB03F98A507BA19C95624
// 0x0004 (0x0004 - 0x0000)
struct GA_PlayerCrafting_C_OnCompleted_DECFCC1F47BBB03F98A507BA19C95624 final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_PlayerCrafting_C_OnCompleted_DECFCC1F47BBB03F98A507BA19C95624) == 0x000004, "Wrong alignment on GA_PlayerCrafting_C_OnCompleted_DECFCC1F47BBB03F98A507BA19C95624");
static_assert(sizeof(GA_PlayerCrafting_C_OnCompleted_DECFCC1F47BBB03F98A507BA19C95624) == 0x000004, "Wrong size on GA_PlayerCrafting_C_OnCompleted_DECFCC1F47BBB03F98A507BA19C95624");
static_assert(offsetof(GA_PlayerCrafting_C_OnCompleted_DECFCC1F47BBB03F98A507BA19C95624, NotifyTag) == 0x000000, "Member 'GA_PlayerCrafting_C_OnCompleted_DECFCC1F47BBB03F98A507BA19C95624::NotifyTag' has a wrong offset!");

// Function GA_PlayerCrafting.GA_PlayerCrafting_C.OnInterrupted_DECFCC1F47BBB03F98A507BA19C95624
// 0x0004 (0x0004 - 0x0000)
struct GA_PlayerCrafting_C_OnInterrupted_DECFCC1F47BBB03F98A507BA19C95624 final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_PlayerCrafting_C_OnInterrupted_DECFCC1F47BBB03F98A507BA19C95624) == 0x000004, "Wrong alignment on GA_PlayerCrafting_C_OnInterrupted_DECFCC1F47BBB03F98A507BA19C95624");
static_assert(sizeof(GA_PlayerCrafting_C_OnInterrupted_DECFCC1F47BBB03F98A507BA19C95624) == 0x000004, "Wrong size on GA_PlayerCrafting_C_OnInterrupted_DECFCC1F47BBB03F98A507BA19C95624");
static_assert(offsetof(GA_PlayerCrafting_C_OnInterrupted_DECFCC1F47BBB03F98A507BA19C95624, NotifyTag) == 0x000000, "Member 'GA_PlayerCrafting_C_OnInterrupted_DECFCC1F47BBB03F98A507BA19C95624::NotifyTag' has a wrong offset!");

// Function GA_PlayerCrafting.GA_PlayerCrafting_C.OnNotifyBegin_DECFCC1F47BBB03F98A507BA19C95624
// 0x0004 (0x0004 - 0x0000)
struct GA_PlayerCrafting_C_OnNotifyBegin_DECFCC1F47BBB03F98A507BA19C95624 final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_PlayerCrafting_C_OnNotifyBegin_DECFCC1F47BBB03F98A507BA19C95624) == 0x000004, "Wrong alignment on GA_PlayerCrafting_C_OnNotifyBegin_DECFCC1F47BBB03F98A507BA19C95624");
static_assert(sizeof(GA_PlayerCrafting_C_OnNotifyBegin_DECFCC1F47BBB03F98A507BA19C95624) == 0x000004, "Wrong size on GA_PlayerCrafting_C_OnNotifyBegin_DECFCC1F47BBB03F98A507BA19C95624");
static_assert(offsetof(GA_PlayerCrafting_C_OnNotifyBegin_DECFCC1F47BBB03F98A507BA19C95624, NotifyTag) == 0x000000, "Member 'GA_PlayerCrafting_C_OnNotifyBegin_DECFCC1F47BBB03F98A507BA19C95624::NotifyTag' has a wrong offset!");

// Function GA_PlayerCrafting.GA_PlayerCrafting_C.OnNotifyEnd_DECFCC1F47BBB03F98A507BA19C95624
// 0x0004 (0x0004 - 0x0000)
struct GA_PlayerCrafting_C_OnNotifyEnd_DECFCC1F47BBB03F98A507BA19C95624 final
{
public:
	struct FGameplayTag                           NotifyTag;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_PlayerCrafting_C_OnNotifyEnd_DECFCC1F47BBB03F98A507BA19C95624) == 0x000004, "Wrong alignment on GA_PlayerCrafting_C_OnNotifyEnd_DECFCC1F47BBB03F98A507BA19C95624");
static_assert(sizeof(GA_PlayerCrafting_C_OnNotifyEnd_DECFCC1F47BBB03F98A507BA19C95624) == 0x000004, "Wrong size on GA_PlayerCrafting_C_OnNotifyEnd_DECFCC1F47BBB03F98A507BA19C95624");
static_assert(offsetof(GA_PlayerCrafting_C_OnNotifyEnd_DECFCC1F47BBB03F98A507BA19C95624, NotifyTag) == 0x000000, "Member 'GA_PlayerCrafting_C_OnNotifyEnd_DECFCC1F47BBB03F98A507BA19C95624::NotifyTag' has a wrong offset!");

}

