#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Resolve_MountedCannon_Redeploy

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Resolve_MountedCannon_Redeploy.GA_Resolve_MountedCannon_Redeploy_C.AttemptLaunchFortPawn
// 0x0008 (0x0008 - 0x0000)
struct GA_Resolve_MountedCannon_Redeploy_C_AttemptLaunchFortPawn final
{
public:
	class AFortPawn*                              FortPawn;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Resolve_MountedCannon_Redeploy_C_AttemptLaunchFortPawn) == 0x000008, "Wrong alignment on GA_Resolve_MountedCannon_Redeploy_C_AttemptLaunchFortPawn");
static_assert(sizeof(GA_Resolve_MountedCannon_Redeploy_C_AttemptLaunchFortPawn) == 0x000008, "Wrong size on GA_Resolve_MountedCannon_Redeploy_C_AttemptLaunchFortPawn");
static_assert(offsetof(GA_Resolve_MountedCannon_Redeploy_C_AttemptLaunchFortPawn, FortPawn) == 0x000000, "Member 'GA_Resolve_MountedCannon_Redeploy_C_AttemptLaunchFortPawn::FortPawn' has a wrong offset!");

// Function GA_Resolve_MountedCannon_Redeploy.GA_Resolve_MountedCannon_Redeploy_C.ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy
// 0x0038 (0x0038 - 0x0000)
struct GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_FortPawn;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetSourceObject_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AB_Resolve_MountedCannonAthena_C*       K2Node_DynamicCast_AsB_Resolve_Mounted_Cannon_Athena; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy) == 0x000008, "Wrong alignment on GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy");
static_assert(sizeof(GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy) == 0x000038, "Wrong size on GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy");
static_assert(offsetof(GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy, EntryPoint) == 0x000000, "Member 'GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy, CallFunc_IsValidClass_ReturnValue) == 0x000004, "Member 'GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy, K2Node_Event_FortPawn) == 0x000008, "Member 'GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy::K2Node_Event_FortPawn' has a wrong offset!");
static_assert(offsetof(GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy, CallFunc_GetSourceObject_ReturnValue) == 0x000018, "Member 'GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy::CallFunc_GetSourceObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000020, "Member 'GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy, K2Node_DynamicCast_AsB_Resolve_Mounted_Cannon_Athena) == 0x000028, "Member 'GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy::K2Node_DynamicCast_AsB_Resolve_Mounted_Cannon_Athena' has a wrong offset!");
static_assert(offsetof(GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'GA_Resolve_MountedCannon_Redeploy_C_ExecuteUbergraph_GA_Resolve_MountedCannon_Redeploy::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

