#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_Tandem_KnockbackPlayers

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAB_Tandem_KnockbackPlayers.GAB_Tandem_KnockbackPlayers_C
// 0x0090 (0x0BA0 - 0x0B10)
class UGAB_Tandem_KnockbackPlayers_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FScalableFloat                         Velocity;                                          // 0x0B18(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         VelocityZExtra;                                    // 0x0B40(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         DestroyDistance;                                   // 0x0B68(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<EObjectTypeQuery>                      DestroyObjectTypes;                                // 0x0B90(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Targeted_E01D2C354A3A954C36CE74A5D07FC56B(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void ExecuteUbergraph_GAB_Tandem_KnockbackPlayers(int32 EntryPoint);
	void Cancelled_E01D2C354A3A954C36CE74A5D07FC56B(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_Tandem_KnockbackPlayers_C">();
	}
	static class UGAB_Tandem_KnockbackPlayers_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_Tandem_KnockbackPlayers_C>();
	}
};
static_assert(alignof(UGAB_Tandem_KnockbackPlayers_C) == 0x000008, "Wrong alignment on UGAB_Tandem_KnockbackPlayers_C");
static_assert(sizeof(UGAB_Tandem_KnockbackPlayers_C) == 0x000BA0, "Wrong size on UGAB_Tandem_KnockbackPlayers_C");
static_assert(offsetof(UGAB_Tandem_KnockbackPlayers_C, UberGraphFrame) == 0x000B10, "Member 'UGAB_Tandem_KnockbackPlayers_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGAB_Tandem_KnockbackPlayers_C, Velocity) == 0x000B18, "Member 'UGAB_Tandem_KnockbackPlayers_C::Velocity' has a wrong offset!");
static_assert(offsetof(UGAB_Tandem_KnockbackPlayers_C, VelocityZExtra) == 0x000B40, "Member 'UGAB_Tandem_KnockbackPlayers_C::VelocityZExtra' has a wrong offset!");
static_assert(offsetof(UGAB_Tandem_KnockbackPlayers_C, DestroyDistance) == 0x000B68, "Member 'UGAB_Tandem_KnockbackPlayers_C::DestroyDistance' has a wrong offset!");
static_assert(offsetof(UGAB_Tandem_KnockbackPlayers_C, DestroyObjectTypes) == 0x000B90, "Member 'UGAB_Tandem_KnockbackPlayers_C::DestroyObjectTypes' has a wrong offset!");

}

