#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Athena_SandSurface

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Athena_SandSurface.GCNL_Athena_SandSurface_C.ExecuteUbergraph_GCNL_Athena_SandSurface
// 0x0128 (0x0128 - 0x0000)
struct GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0010(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              K2Node_Event_ParticleComponents;                   // 0x00E0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x00F0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UNiagaraComponent*                      CallFunc_Array_Get_Item;                           // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnLocalPlayersTeam_Return_Value;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPlayingReplay_ReturnValue;           // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortReplaySpectatorAthena*             K2Node_DynamicCast_AsFort_Replay_Spectator_Athena; // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface) == 0x000008, "Wrong alignment on GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface");
static_assert(sizeof(GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface) == 0x000128, "Wrong size on GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface");
static_assert(offsetof(GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface, EntryPoint) == 0x000000, "Member 'GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface, CallFunc_IsMobilePlatform_ReturnValue) == 0x000004, "Member 'GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface, K2Node_Event_MyTarget) == 0x000008, "Member 'GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface, K2Node_Event_Parameters) == 0x000010, "Member 'GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface, K2Node_Event_ParticleComponents) == 0x0000E0, "Member 'GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface, K2Node_Event_AudioComponents) == 0x0000F0, "Member 'GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface, CallFunc_Array_Get_Item) == 0x000100, "Member 'GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface, CallFunc_OnLocalPlayersTeam_Return_Value) == 0x000108, "Member 'GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface::CallFunc_OnLocalPlayersTeam_Return_Value' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface, CallFunc_GetIsPlayingReplay_ReturnValue) == 0x000109, "Member 'GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface::CallFunc_GetIsPlayingReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000110, "Member 'GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface, K2Node_DynamicCast_AsFort_Replay_Spectator_Athena) == 0x000118, "Member 'GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface::K2Node_DynamicCast_AsFort_Replay_Spectator_Athena' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface, K2Node_DynamicCast_bSuccess) == 0x000120, "Member 'GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface, CallFunc_IsValid_ReturnValue) == 0x000121, "Member 'GCNL_Athena_SandSurface_C_ExecuteUbergraph_GCNL_Athena_SandSurface::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function GCNL_Athena_SandSurface.GCNL_Athena_SandSurface_C.OnLoopingStartNiagara
// 0x00F8 (0x00F8 - 0x0000)
struct GCNL_Athena_SandSurface_C_OnLoopingStartNiagara final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UNiagaraComponent*>              ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCNL_Athena_SandSurface_C_OnLoopingStartNiagara) == 0x000008, "Wrong alignment on GCNL_Athena_SandSurface_C_OnLoopingStartNiagara");
static_assert(sizeof(GCNL_Athena_SandSurface_C_OnLoopingStartNiagara) == 0x0000F8, "Wrong size on GCNL_Athena_SandSurface_C_OnLoopingStartNiagara");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnLoopingStartNiagara, MyTarget) == 0x000000, "Member 'GCNL_Athena_SandSurface_C_OnLoopingStartNiagara::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnLoopingStartNiagara, Parameters) == 0x000008, "Member 'GCNL_Athena_SandSurface_C_OnLoopingStartNiagara::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnLoopingStartNiagara, ParticleComponents) == 0x0000D8, "Member 'GCNL_Athena_SandSurface_C_OnLoopingStartNiagara::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnLoopingStartNiagara, AudioComponents) == 0x0000E8, "Member 'GCNL_Athena_SandSurface_C_OnLoopingStartNiagara::AudioComponents' has a wrong offset!");

// Function GCNL_Athena_SandSurface.GCNL_Athena_SandSurface_C.OnPlayerFootstep
// 0x0220 (0x0220 - 0x0000)
struct GCNL_Athena_SandSurface_C_OnPlayerFootstep final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0030(0x0060)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x0090(0x0060)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_SelectTransform_ReturnValue;              // 0x00F0(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0180(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x01C0(0x0020)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector4>                       K2Node_MakeArray_Array;                            // 0x01F8(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Athena_SandSurface_C_OnPlayerFootstep) == 0x000010, "Wrong alignment on GCNL_Athena_SandSurface_C_OnPlayerFootstep");
static_assert(sizeof(GCNL_Athena_SandSurface_C_OnPlayerFootstep) == 0x000220, "Wrong size on GCNL_Athena_SandSurface_C_OnPlayerFootstep");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnPlayerFootstep, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GCNL_Athena_SandSurface_C_OnPlayerFootstep::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnPlayerFootstep, CallFunc_GetViewTarget_ReturnValue) == 0x000008, "Member 'GCNL_Athena_SandSurface_C_OnPlayerFootstep::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnPlayerFootstep, CallFunc_OnSameTeam_ReturnValue) == 0x000010, "Member 'GCNL_Athena_SandSurface_C_OnPlayerFootstep::CallFunc_OnSameTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnPlayerFootstep, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'GCNL_Athena_SandSurface_C_OnPlayerFootstep::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnPlayerFootstep, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000012, "Member 'GCNL_Athena_SandSurface_C_OnPlayerFootstep::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnPlayerFootstep, CallFunc_GetVelocity_ReturnValue) == 0x000018, "Member 'GCNL_Athena_SandSurface_C_OnPlayerFootstep::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnPlayerFootstep, CallFunc_GetSocketTransform_ReturnValue) == 0x000030, "Member 'GCNL_Athena_SandSurface_C_OnPlayerFootstep::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnPlayerFootstep, CallFunc_GetSocketTransform_ReturnValue_1) == 0x000090, "Member 'GCNL_Athena_SandSurface_C_OnPlayerFootstep::CallFunc_GetSocketTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnPlayerFootstep, CallFunc_SelectTransform_ReturnValue) == 0x0000F0, "Member 'GCNL_Athena_SandSurface_C_OnPlayerFootstep::CallFunc_SelectTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnPlayerFootstep, CallFunc_BreakTransform_Location) == 0x000150, "Member 'GCNL_Athena_SandSurface_C_OnPlayerFootstep::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnPlayerFootstep, CallFunc_BreakTransform_Rotation) == 0x000168, "Member 'GCNL_Athena_SandSurface_C_OnPlayerFootstep::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnPlayerFootstep, CallFunc_BreakTransform_Scale) == 0x000180, "Member 'GCNL_Athena_SandSurface_C_OnPlayerFootstep::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnPlayerFootstep, CallFunc_BreakVector_X) == 0x000198, "Member 'GCNL_Athena_SandSurface_C_OnPlayerFootstep::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnPlayerFootstep, CallFunc_BreakVector_Y) == 0x00019C, "Member 'GCNL_Athena_SandSurface_C_OnPlayerFootstep::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnPlayerFootstep, CallFunc_BreakVector_Z) == 0x0001A0, "Member 'GCNL_Athena_SandSurface_C_OnPlayerFootstep::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnPlayerFootstep, CallFunc_GetForwardVector_ReturnValue) == 0x0001A8, "Member 'GCNL_Athena_SandSurface_C_OnPlayerFootstep::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnPlayerFootstep, CallFunc_MakeVector4_ReturnValue) == 0x0001C0, "Member 'GCNL_Athena_SandSurface_C_OnPlayerFootstep::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnPlayerFootstep, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0001E0, "Member 'GCNL_Athena_SandSurface_C_OnPlayerFootstep::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnPlayerFootstep, K2Node_MakeArray_Array) == 0x0001F8, "Member 'GCNL_Athena_SandSurface_C_OnPlayerFootstep::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(GCNL_Athena_SandSurface_C_OnPlayerFootstep, CallFunc_SelectVector_ReturnValue) == 0x000208, "Member 'GCNL_Athena_SandSurface_C_OnPlayerFootstep::CallFunc_SelectVector_ReturnValue' has a wrong offset!");

}

