#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_AthenaAI_NonParticipant_AlertState

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GCNL_AthenaAI_NonParticipant_AlertState.GCNL_AthenaAI_NonParticipant_AlertState_C.OnApplication
// 0x0108 (0x0108 - 0x0000)
struct GCNL_AthenaAI_NonParticipant_AlertState_C_OnApplication final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00D8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00E8(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    BurstCameraShakeInstance;                          // 0x00F8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x0100(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_AthenaAI_NonParticipant_AlertState_C_OnApplication) == 0x000008, "Wrong alignment on GCNL_AthenaAI_NonParticipant_AlertState_C_OnApplication");
static_assert(sizeof(GCNL_AthenaAI_NonParticipant_AlertState_C_OnApplication) == 0x000108, "Wrong size on GCNL_AthenaAI_NonParticipant_AlertState_C_OnApplication");
static_assert(offsetof(GCNL_AthenaAI_NonParticipant_AlertState_C_OnApplication, MyTarget) == 0x000000, "Member 'GCNL_AthenaAI_NonParticipant_AlertState_C_OnApplication::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_AthenaAI_NonParticipant_AlertState_C_OnApplication, Parameters) == 0x000008, "Member 'GCNL_AthenaAI_NonParticipant_AlertState_C_OnApplication::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_AthenaAI_NonParticipant_AlertState_C_OnApplication, ParticleComponents) == 0x0000D8, "Member 'GCNL_AthenaAI_NonParticipant_AlertState_C_OnApplication::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_AthenaAI_NonParticipant_AlertState_C_OnApplication, AudioComponents) == 0x0000E8, "Member 'GCNL_AthenaAI_NonParticipant_AlertState_C_OnApplication::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_AthenaAI_NonParticipant_AlertState_C_OnApplication, BurstCameraShakeInstance) == 0x0000F8, "Member 'GCNL_AthenaAI_NonParticipant_AlertState_C_OnApplication::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_AthenaAI_NonParticipant_AlertState_C_OnApplication, BurstDecalInstance) == 0x000100, "Member 'GCNL_AthenaAI_NonParticipant_AlertState_C_OnApplication::BurstDecalInstance' has a wrong offset!");

// Function GCNL_AthenaAI_NonParticipant_AlertState.GCNL_AthenaAI_NonParticipant_AlertState_C.ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState
// 0x0118 (0x0118 - 0x0000)
struct GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x0018(0x00D0)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x00E8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x00F8(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UMatineeCameraShake*                    K2Node_Event_BurstCameraShakeInstance;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState) == 0x000008, "Wrong alignment on GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState");
static_assert(sizeof(GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState) == 0x000118, "Wrong size on GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState");
static_assert(offsetof(GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState, EntryPoint) == 0x000000, "Member 'GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000008, "Member 'GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState, K2Node_Event_MyTarget) == 0x000010, "Member 'GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState, K2Node_Event_Parameters) == 0x000018, "Member 'GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState, K2Node_Event_ParticleComponents) == 0x0000E8, "Member 'GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState, K2Node_Event_AudioComponents) == 0x0000F8, "Member 'GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState, K2Node_Event_BurstCameraShakeInstance) == 0x000108, "Member 'GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState, K2Node_Event_BurstDecalInstance) == 0x000110, "Member 'GCNL_AthenaAI_NonParticipant_AlertState_C_ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState::K2Node_Event_BurstDecalInstance' has a wrong offset!");

}

