#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_AthenaAI_NonParticipant_AlertState

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_AthenaAI_NonParticipant_AlertState.GCNL_AthenaAI_NonParticipant_AlertState_C
// 0x0040 (0x0A20 - 0x09E0)
class AGCNL_AthenaAI_NonParticipant_AlertState_C final : public AFortGameplayCueNotifyAthena_AIAlertState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FLinearColor                           IconColorAlert;                                    // 0x09E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           IconColorThreatend;                                // 0x09F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimationLength;                                   // 0x0A08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           IconColorAlertInner;                               // 0x0A0C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnApplication(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UMatineeCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void ExecuteUbergraph_GCNL_AthenaAI_NonParticipant_AlertState(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_AthenaAI_NonParticipant_AlertState_C">();
	}
	static class AGCNL_AthenaAI_NonParticipant_AlertState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_AthenaAI_NonParticipant_AlertState_C>();
	}
};
static_assert(alignof(AGCNL_AthenaAI_NonParticipant_AlertState_C) == 0x000010, "Wrong alignment on AGCNL_AthenaAI_NonParticipant_AlertState_C");
static_assert(sizeof(AGCNL_AthenaAI_NonParticipant_AlertState_C) == 0x000A20, "Wrong size on AGCNL_AthenaAI_NonParticipant_AlertState_C");
static_assert(offsetof(AGCNL_AthenaAI_NonParticipant_AlertState_C, UberGraphFrame) == 0x0009E0, "Member 'AGCNL_AthenaAI_NonParticipant_AlertState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_AthenaAI_NonParticipant_AlertState_C, IconColorAlert) == 0x0009E8, "Member 'AGCNL_AthenaAI_NonParticipant_AlertState_C::IconColorAlert' has a wrong offset!");
static_assert(offsetof(AGCNL_AthenaAI_NonParticipant_AlertState_C, IconColorThreatend) == 0x0009F8, "Member 'AGCNL_AthenaAI_NonParticipant_AlertState_C::IconColorThreatend' has a wrong offset!");
static_assert(offsetof(AGCNL_AthenaAI_NonParticipant_AlertState_C, AnimationLength) == 0x000A08, "Member 'AGCNL_AthenaAI_NonParticipant_AlertState_C::AnimationLength' has a wrong offset!");
static_assert(offsetof(AGCNL_AthenaAI_NonParticipant_AlertState_C, IconColorAlertInner) == 0x000A0C, "Member 'AGCNL_AthenaAI_NonParticipant_AlertState_C::IconColorAlertInner' has a wrong offset!");

}

