#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Bunker_Man_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function M_MED_Bunker_Man_AnimBP.M_MED_Bunker_Man_AnimBP_C.ExecuteUbergraph_M_MED_Bunker_Man_AnimBP
// 0x00E0 (0x00E0 - 0x0000)
struct M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetDeltaTransformFromRefPose_ReturnValue; // 0x0010(0x0060)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP) == 0x000010, "Wrong alignment on M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP");
static_assert(sizeof(M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP) == 0x0000E0, "Wrong size on M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP");
static_assert(offsetof(M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP, EntryPoint) == 0x000000, "Member 'M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x000008, "Member 'M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP, CallFunc_GetDeltaTransformFromRefPose_ReturnValue) == 0x000010, "Member 'M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP::CallFunc_GetDeltaTransformFromRefPose_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP, K2Node_Event_DeltaTimeX) == 0x000070, "Member 'M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP, CallFunc_BreakTransform_Location) == 0x000078, "Member 'M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP, CallFunc_BreakTransform_Rotation) == 0x000090, "Member 'M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP, CallFunc_BreakTransform_Scale) == 0x0000A8, "Member 'M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP, CallFunc_BreakRotator_Roll) == 0x0000C0, "Member 'M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP, CallFunc_BreakRotator_Pitch) == 0x0000C4, "Member 'M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP, CallFunc_BreakRotator_Yaw) == 0x0000C8, "Member 'M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP, CallFunc_MapRangeClamped_ReturnValue) == 0x0000CC, "Member 'M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP, CallFunc_MapRangeClamped_ReturnValue_1) == 0x0000D0, "Member 'M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000D4, "Member 'M_MED_Bunker_Man_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_AnimBP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function M_MED_Bunker_Man_AnimBP.M_MED_Bunker_Man_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct M_MED_Bunker_Man_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Bunker_Man_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on M_MED_Bunker_Man_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(M_MED_Bunker_Man_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on M_MED_Bunker_Man_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(M_MED_Bunker_Man_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'M_MED_Bunker_Man_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function M_MED_Bunker_Man_AnimBP.M_MED_Bunker_Man_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct M_MED_Bunker_Man_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(M_MED_Bunker_Man_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on M_MED_Bunker_Man_AnimBP_C_AnimGraph");
static_assert(sizeof(M_MED_Bunker_Man_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on M_MED_Bunker_Man_AnimBP_C_AnimGraph");
static_assert(offsetof(M_MED_Bunker_Man_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'M_MED_Bunker_Man_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

