#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_The_Origin_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_The_Origin_FaceAcc_AnimBP.M_MED_The_Origin_FaceAcc_AnimBP_C
// 0x1C00 (0x2290 - 0x0690)
class UM_MED_The_Origin_FaceAcc_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0698(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A0(0x0008)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x06A8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x07D0(0x0128)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x08F8(0x0108)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0A00(0x00E0)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x0AE0(0x0108)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0BE8(0x0100)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0CE8(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_1;                  // 0x0D08(0x0180)(ContainsInstancedReference)
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0E88(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0FB0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0FD0(0x0128)()
	uint8                                         Pad_10F8[0x8];                                     // 0x10F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x1100(0x0980)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1A80(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1AA8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1AC8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x1AE8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1C10(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1D38(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1E60(0x0128)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x1F88(0x0180)(ContainsInstancedReference)
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x2108(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2230(0x0020)()
	struct FVector                                float_movement;                                    // 0x2250(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 skel_mesh;                                         // 0x2268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Body_Mesh;                                         // 0x2270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Arm_L_rot;                                         // 0x2278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Arm_R_rot;                                         // 0x227C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Bow;                                               // 0x2280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2281[0x3];                                     // 0x2281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Arm_R_rot_2;                                       // 0x2284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_M_MED_The_Origin_FaceAcc_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_The_Origin_FaceAcc_AnimBP_C">();
	}
	static class UM_MED_The_Origin_FaceAcc_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_The_Origin_FaceAcc_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_The_Origin_FaceAcc_AnimBP_C) == 0x000010, "Wrong alignment on UM_MED_The_Origin_FaceAcc_AnimBP_C");
static_assert(sizeof(UM_MED_The_Origin_FaceAcc_AnimBP_C) == 0x002290, "Wrong size on UM_MED_The_Origin_FaceAcc_AnimBP_C");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, UberGraphFrame) == 0x000690, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000698, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimBlueprintExtension_Base) == 0x0006A0, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_8) == 0x0006A8, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_7) == 0x0007D0, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_Constraint_1) == 0x0008F8, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x000A00, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_Constraint) == 0x000AE0, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x000BE8, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x000CE8, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh_1) == 0x000D08, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh_1' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_6) == 0x000E88, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x000FB0, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_5) == 0x000FD0, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_RigidBody) == 0x001100, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x001A80, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x001AA8, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x001AC8, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_4) == 0x001AE8, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x001C10, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x001D38, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x001E60, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x001F88, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone) == 0x002108, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, AnimGraphNode_Root) == 0x002230, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, float_movement) == 0x002250, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::float_movement' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, skel_mesh) == 0x002268, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::skel_mesh' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, Body_Mesh) == 0x002270, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::Body_Mesh' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, Arm_L_rot) == 0x002278, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::Arm_L_rot' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, Arm_R_rot) == 0x00227C, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::Arm_R_rot' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, Bow) == 0x002280, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::Bow' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_FaceAcc_AnimBP_C, Arm_R_rot_2) == 0x002284, "Member 'UM_MED_The_Origin_FaceAcc_AnimBP_C::Arm_R_rot_2' has a wrong offset!");

}

