#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_The_Origin_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "M_MED_The_Origin_AnimBP_structs.hpp"
#include "ControlRig_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_The_Origin_AnimBP.M_MED_The_Origin_AnimBP_C
// 0x2370 (0x2A00 - 0x0690)
class UM_MED_The_Origin_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct M_MED_The_Origin_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0698(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_69A[0x6];                                      // 0x069A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x06A0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A8(0x0008)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x06B0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x07D8(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x0900(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x0920(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_6;                        // 0x0940(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0A48(0x0048)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_5;                        // 0x0A90(0x0108)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_1;                  // 0x0B98(0x0180)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0D18(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x0D38(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0D58(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0E80(0x0128)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x0FA8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x10B0(0x0108)()
	uint8                                         Pad_11B8[0x8];                                     // 0x11B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_3;                            // 0x11C0(0x0240)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_2;                            // 0x1400(0x0240)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x1640(0x0180)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x17C0(0x0020)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_1;                            // 0x17E0(0x0240)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x1A20(0x0240)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x1C60(0x0128)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x1D88(0x0458)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x21E0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2200(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x2220(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x2328(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x2430(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x2538(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x2660(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x2788(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x28B0(0x0128)()
	class USkeletalMeshComponent*                 skel_mesh;                                         // 0x29D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Arm_L_rot;                                         // 0x29E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Arm_R_rot;                                         // 0x29E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Rifle;                                             // 0x29E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          shoulder_corrective;                               // 0x29E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29EA[0x2];                                     // 0x29EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Arm_R_rot_2;                                       // 0x29EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Pistol;                                            // 0x29F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29F1[0x3];                                     // 0x29F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Arm_R_rot_3;                                       // 0x29F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Pickaxe;                                           // 0x29F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_The_Origin_AnimBP_AnimGraphNode_Constraint_2DE05114484678398056D0B43B470958();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_The_Origin_AnimBP_AnimGraphNode_Constraint_464BC96844AEAF3E30C035989596FA12();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_The_Origin_AnimBP_AnimGraphNode_Constraint_B6078793442EB9EFFC10E2AF47A958A2();
	void ExecuteUbergraph_M_MED_The_Origin_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_The_Origin_AnimBP_C">();
	}
	static class UM_MED_The_Origin_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_The_Origin_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_The_Origin_AnimBP_C) == 0x000010, "Wrong alignment on UM_MED_The_Origin_AnimBP_C");
static_assert(sizeof(UM_MED_The_Origin_AnimBP_C) == 0x002A00, "Wrong size on UM_MED_The_Origin_AnimBP_C");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, UberGraphFrame) == 0x000690, "Member 'UM_MED_The_Origin_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, __AnimBlueprintMutables) == 0x000698, "Member 'UM_MED_The_Origin_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x0006A0, "Member 'UM_MED_The_Origin_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimBlueprintExtension_Base) == 0x0006A8, "Member 'UM_MED_The_Origin_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_ModifyBone_8) == 0x0006B0, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_ModifyBone_7) == 0x0007D8, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_LocalToComponentSpace_2) == 0x000900, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x000920, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_Constraint_6) == 0x000940, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_Constraint_6' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x000A48, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_Constraint_5) == 0x000A90, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_Constraint_5' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_CopyPoseFromMesh_1) == 0x000B98, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_CopyPoseFromMesh_1' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x000D18, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x000D38, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_ModifyBone_6) == 0x000D58, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_ModifyBone_5) == 0x000E80, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_Constraint_4) == 0x000FA8, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_Constraint_4' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_Constraint_3) == 0x0010B0, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_LookAt_3) == 0x0011C0, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_LookAt_3' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_LookAt_2) == 0x001400, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_LookAt_2' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x001640, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_Root) == 0x0017C0, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_LookAt_1) == 0x0017E0, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_LookAt_1' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_LookAt) == 0x001A20, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_ModifyBone_4) == 0x001C60, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_ControlRig) == 0x001D88, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0021E0, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x002200, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_Constraint_2) == 0x002220, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_Constraint_1) == 0x002328, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_Constraint) == 0x002430, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x002538, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x002660, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x002788, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, AnimGraphNode_ModifyBone) == 0x0028B0, "Member 'UM_MED_The_Origin_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, skel_mesh) == 0x0029D8, "Member 'UM_MED_The_Origin_AnimBP_C::skel_mesh' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, Arm_L_rot) == 0x0029E0, "Member 'UM_MED_The_Origin_AnimBP_C::Arm_L_rot' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, Arm_R_rot) == 0x0029E4, "Member 'UM_MED_The_Origin_AnimBP_C::Arm_R_rot' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, Rifle) == 0x0029E8, "Member 'UM_MED_The_Origin_AnimBP_C::Rifle' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, shoulder_corrective) == 0x0029E9, "Member 'UM_MED_The_Origin_AnimBP_C::shoulder_corrective' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, Arm_R_rot_2) == 0x0029EC, "Member 'UM_MED_The_Origin_AnimBP_C::Arm_R_rot_2' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, Pistol) == 0x0029F0, "Member 'UM_MED_The_Origin_AnimBP_C::Pistol' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, Arm_R_rot_3) == 0x0029F4, "Member 'UM_MED_The_Origin_AnimBP_C::Arm_R_rot_3' has a wrong offset!");
static_assert(offsetof(UM_MED_The_Origin_AnimBP_C, Pickaxe) == 0x0029F8, "Member 'UM_MED_The_Origin_AnimBP_C::Pickaxe' has a wrong offset!");

}

