#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Flapjack_Wrangler_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function M_MED_Flapjack_Wrangler_AnimBP.M_MED_Flapjack_Wrangler_AnimBP_C.ExecuteUbergraph_M_MED_Flapjack_Wrangler_AnimBP
// 0x0040 (0x0040 - 0x0000)
struct M_MED_Flapjack_Wrangler_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Flapjack_Wrangler_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_AnimBP) == 0x000008, "Wrong alignment on M_MED_Flapjack_Wrangler_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_AnimBP");
static_assert(sizeof(M_MED_Flapjack_Wrangler_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_AnimBP) == 0x000040, "Wrong size on M_MED_Flapjack_Wrangler_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_AnimBP");
static_assert(offsetof(M_MED_Flapjack_Wrangler_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_AnimBP, EntryPoint) == 0x000000, "Member 'M_MED_Flapjack_Wrangler_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_AnimBP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'M_MED_Flapjack_Wrangler_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_AnimBP, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000008, "Member 'M_MED_Flapjack_Wrangler_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_AnimBP::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_AnimBP, CallFunc_BooleanOR_ReturnValue) == 0x000020, "Member 'M_MED_Flapjack_Wrangler_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_AnimBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_AnimBP, CallFunc_BooleanOR_ReturnValue_1) == 0x000021, "Member 'M_MED_Flapjack_Wrangler_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_AnimBP::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_AnimBP, CallFunc_SelectVector_ReturnValue) == 0x000028, "Member 'M_MED_Flapjack_Wrangler_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_AnimBP::CallFunc_SelectVector_ReturnValue' has a wrong offset!");

// Function M_MED_Flapjack_Wrangler_AnimBP.M_MED_Flapjack_Wrangler_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct M_MED_Flapjack_Wrangler_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Flapjack_Wrangler_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on M_MED_Flapjack_Wrangler_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(M_MED_Flapjack_Wrangler_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on M_MED_Flapjack_Wrangler_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(M_MED_Flapjack_Wrangler_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'M_MED_Flapjack_Wrangler_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function M_MED_Flapjack_Wrangler_AnimBP.M_MED_Flapjack_Wrangler_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct M_MED_Flapjack_Wrangler_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(M_MED_Flapjack_Wrangler_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on M_MED_Flapjack_Wrangler_AnimBP_C_AnimGraph");
static_assert(sizeof(M_MED_Flapjack_Wrangler_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on M_MED_Flapjack_Wrangler_AnimBP_C_AnimGraph");
static_assert(offsetof(M_MED_Flapjack_Wrangler_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'M_MED_Flapjack_Wrangler_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

