#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Bunker_Man_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function M_MED_Bunker_Man_FaceAcc_AnimBP.M_MED_Bunker_Man_FaceAcc_AnimBP_C.ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP
// 0x0210 (0x0210 - 0x0000)
struct M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetDeltaTransformFromRefPose_ReturnValue; // 0x0010(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue;   // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_2;            // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_3;            // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1; // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102[0xE];                                      // 0x0102(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetDeltaTransformFromRefPose_ReturnValue_1; // 0x0110(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_4;            // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_5;            // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0206(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0207(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP) == 0x000010, "Wrong alignment on M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP");
static_assert(sizeof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP) == 0x000210, "Wrong size on M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, EntryPoint) == 0x000000, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x000008, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_GetDeltaTransformFromRefPose_ReturnValue) == 0x000010, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_GetDeltaTransformFromRefPose_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_BreakTransform_Location) == 0x000070, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_BreakTransform_Rotation) == 0x000088, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_BreakTransform_Scale) == 0x0000A0, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_GetSkeletalMeshForPartType_ReturnValue) == 0x0000B8, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_GetSkeletalMeshForPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_BreakRotator_Roll) == 0x0000C0, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_BreakRotator_Pitch) == 0x0000C4, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_BreakRotator_Yaw) == 0x0000C8, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_MapRangeClamped_ReturnValue) == 0x0000CC, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_MapRangeClamped_ReturnValue_1) == 0x0000D0, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000D4, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_MapRangeClamped_ReturnValue_2) == 0x0000D8, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_MapRangeClamped_ReturnValue_3) == 0x0000DC, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_MapRangeClamped_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000E0, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1) == 0x0000E8, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x0000F0, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x0000F8, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_IsValid_ReturnValue) == 0x000101, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_GetDeltaTransformFromRefPose_ReturnValue_1) == 0x000110, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_GetDeltaTransformFromRefPose_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_BreakTransform_Location_1) == 0x000170, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_BreakTransform_Rotation_1) == 0x000188, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_BreakTransform_Scale_1) == 0x0001A0, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_BreakRotator_Roll_1) == 0x0001B8, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_BreakRotator_Pitch_1) == 0x0001BC, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_BreakRotator_Yaw_1) == 0x0001C0, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001C8, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_MapRangeClamped_ReturnValue_4) == 0x0001E0, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_MapRangeClamped_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0001E8, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_MapRangeClamped_ReturnValue_5) == 0x000200, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_MapRangeClamped_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000204, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_Greater_IntInt_ReturnValue) == 0x000205, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x000206, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP, CallFunc_BooleanOR_ReturnValue) == 0x000207, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_ExecuteUbergraph_M_MED_Bunker_Man_FaceAcc_AnimBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function M_MED_Bunker_Man_FaceAcc_AnimBP.M_MED_Bunker_Man_FaceAcc_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct M_MED_Bunker_Man_FaceAcc_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on M_MED_Bunker_Man_FaceAcc_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on M_MED_Bunker_Man_FaceAcc_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function M_MED_Bunker_Man_FaceAcc_AnimBP.M_MED_Bunker_Man_FaceAcc_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct M_MED_Bunker_Man_FaceAcc_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on M_MED_Bunker_Man_FaceAcc_AnimBP_C_AnimGraph");
static_assert(sizeof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on M_MED_Bunker_Man_FaceAcc_AnimBP_C_AnimGraph");
static_assert(offsetof(M_MED_Bunker_Man_FaceAcc_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'M_MED_Bunker_Man_FaceAcc_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

