#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Farmer_Body_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Farmer_Body_AnimBP.M_MED_Farmer_Body_AnimBP_C
// 0x71B0 (0x7840 - 0x0690)
class UM_MED_Farmer_Body_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0698(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x06C8(0x0180)(ContainsInstancedReference)
	uint8                                         Pad_848[0x8];                                      // 0x0848(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_18;                     // 0x0850(0x0510)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0D60(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_17;                     // 0x0D80(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_16;                     // 0x1290(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_15;                     // 0x17A0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_14;                     // 0x1CB0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_13;                     // 0x21C0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_12;                     // 0x26D0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_11;                     // 0x2BE0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_10;                     // 0x30F0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_9;                      // 0x3600(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8;                      // 0x3B10(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x4020(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x4530(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x4A40(0x0510)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x4F50(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x4F70(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x5480(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x5990(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x5EA0(0x0510)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_14;                       // 0x63B0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_13;                       // 0x64B8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_12;                       // 0x65C0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_11;                       // 0x66C8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_10;                       // 0x67D0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_9;                        // 0x68D8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_8;                        // 0x69E0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_7;                        // 0x6AE8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_6;                        // 0x6BF0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_5;                        // 0x6CF8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_4;                        // 0x6E00(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x6F08(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x7010(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x7118(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x7220(0x0108)()
	uint8                                         Pad_7328[0x8];                                     // 0x7328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x7330(0x0510)()

public:
	void ExecuteUbergraph_M_MED_Farmer_Body_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Farmer_Body_AnimBP_C">();
	}
	static class UM_MED_Farmer_Body_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Farmer_Body_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_Farmer_Body_AnimBP_C) == 0x000010, "Wrong alignment on UM_MED_Farmer_Body_AnimBP_C");
static_assert(sizeof(UM_MED_Farmer_Body_AnimBP_C) == 0x007840, "Wrong size on UM_MED_Farmer_Body_AnimBP_C");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, UberGraphFrame) == 0x000690, "Member 'UM_MED_Farmer_Body_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000698, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimBlueprintExtension_Base) == 0x0006A0, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0006C8, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_AnimDynamics_18) == 0x000850, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_AnimDynamics_18' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000D60, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_AnimDynamics_17) == 0x000D80, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_AnimDynamics_17' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_AnimDynamics_16) == 0x001290, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_AnimDynamics_16' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_AnimDynamics_15) == 0x0017A0, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_AnimDynamics_15' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_AnimDynamics_14) == 0x001CB0, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_AnimDynamics_14' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_AnimDynamics_13) == 0x0021C0, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_AnimDynamics_13' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_AnimDynamics_12) == 0x0026D0, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_AnimDynamics_12' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_AnimDynamics_11) == 0x002BE0, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_AnimDynamics_11' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_AnimDynamics_10) == 0x0030F0, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_AnimDynamics_10' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_AnimDynamics_9) == 0x003600, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_AnimDynamics_9' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_AnimDynamics_8) == 0x003B10, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_AnimDynamics_8' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_AnimDynamics_7) == 0x004020, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_AnimDynamics_6) == 0x004530, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_AnimDynamics_5) == 0x004A40, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x004F50, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x004F70, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x005480, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x005990, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x005EA0, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_Constraint_14) == 0x0063B0, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_Constraint_14' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_Constraint_13) == 0x0064B8, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_Constraint_13' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_Constraint_12) == 0x0065C0, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_Constraint_12' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_Constraint_11) == 0x0066C8, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_Constraint_11' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_Constraint_10) == 0x0067D0, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_Constraint_10' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_Constraint_9) == 0x0068D8, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_Constraint_9' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_Constraint_8) == 0x0069E0, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_Constraint_8' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_Constraint_7) == 0x006AE8, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_Constraint_7' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_Constraint_6) == 0x006BF0, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_Constraint_6' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_Constraint_5) == 0x006CF8, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_Constraint_5' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_Constraint_4) == 0x006E00, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_Constraint_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_Constraint_3) == 0x006F08, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_Constraint_2) == 0x007010, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_Constraint_1) == 0x007118, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_Constraint) == 0x007220, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UM_MED_Farmer_Body_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x007330, "Member 'UM_MED_Farmer_Body_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");

}

