#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Base_Commando_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct M_MED_Base_Commando_AnimBlueprint.M_MED_Base_Commando_AnimBlueprint_C.AnimBlueprintGeneratedMutableData
// 0x0000 (0x0001 - 0x0001)
struct M_MED_Base_Commando_AnimBlueprint::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
};
static_assert(alignof(M_MED_Base_Commando_AnimBlueprint::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on M_MED_Base_Commando_AnimBlueprint::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(M_MED_Base_Commando_AnimBlueprint::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong size on M_MED_Base_Commando_AnimBlueprint::FAnimBlueprintGeneratedMutableData");

// ScriptStruct M_MED_Base_Commando_AnimBlueprint.M_MED_Base_Commando_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// 0x00BF (0x00C0 - 0x0001)
struct M_MED_Base_Commando_AnimBlueprint::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_43;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_44;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_45;                               // 0x0010(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0028(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00A8(0x0018)()
};
static_assert(alignof(M_MED_Base_Commando_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on M_MED_Base_Commando_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(M_MED_Base_Commando_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x0000C0, "Wrong size on M_MED_Base_Commando_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(M_MED_Base_Commando_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_43) == 0x000004, "Member 'M_MED_Base_Commando_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_43' has a wrong offset!");
static_assert(offsetof(M_MED_Base_Commando_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_44) == 0x000008, "Member 'M_MED_Base_Commando_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_44' has a wrong offset!");
static_assert(offsetof(M_MED_Base_Commando_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_45) == 0x000010, "Member 'M_MED_Base_Commando_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_45' has a wrong offset!");
static_assert(offsetof(M_MED_Base_Commando_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000028, "Member 'M_MED_Base_Commando_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(M_MED_Base_Commando_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000A8, "Member 'M_MED_Base_Commando_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

