#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Banana_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Banana_Skeleton_AnimBlueprint.M_MED_Banana_Skeleton_AnimBlueprint_C
// 0x1BF0 (0x2290 - 0x06A0)
class UM_MED_Banana_Skeleton_AnimBlueprint_C final : public UCustomCharacterPartAnimInstance_BananaBody
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x06A8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06B0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06B8(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x06D8(0x0180)(ContainsInstancedReference)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0858(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0958(0x0028)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x0980(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x0A88(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x0B90(0x0020)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x0BB0(0x0980)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x1530(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1550(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1678(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1698(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x16B8(0x0128)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x17E0(0x0980)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x2160(0x0128)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_M_MED_Banana_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Banana_Skeleton_AnimBlueprint_C">();
	}
	static class UM_MED_Banana_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Banana_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UM_MED_Banana_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UM_MED_Banana_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UM_MED_Banana_Skeleton_AnimBlueprint_C) == 0x002290, "Wrong size on UM_MED_Banana_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UM_MED_Banana_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0006A0, "Member 'UM_MED_Banana_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x0006A8, "Member 'UM_MED_Banana_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_Base) == 0x0006B0, "Member 'UM_MED_Banana_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0006B8, "Member 'UM_MED_Banana_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Skeleton_AnimBlueprint_C, AnimGraphNode_CopyPoseFromMesh) == 0x0006D8, "Member 'UM_MED_Banana_Skeleton_AnimBlueprint_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Skeleton_AnimBlueprint_C, AnimGraphNode_SaveCachedPose) == 0x000858, "Member 'UM_MED_Banana_Skeleton_AnimBlueprint_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose) == 0x000958, "Member 'UM_MED_Banana_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Skeleton_AnimBlueprint_C, AnimGraphNode_Constraint_1) == 0x000980, "Member 'UM_MED_Banana_Skeleton_AnimBlueprint_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Skeleton_AnimBlueprint_C, AnimGraphNode_Constraint) == 0x000A88, "Member 'UM_MED_Banana_Skeleton_AnimBlueprint_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace_1) == 0x000B90, "Member 'UM_MED_Banana_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Skeleton_AnimBlueprint_C, AnimGraphNode_RigidBody_1) == 0x000BB0, "Member 'UM_MED_Banana_Skeleton_AnimBlueprint_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x001530, "Member 'UM_MED_Banana_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_2) == 0x001550, "Member 'UM_MED_Banana_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x001678, "Member 'UM_MED_Banana_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x001698, "Member 'UM_MED_Banana_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone_1) == 0x0016B8, "Member 'UM_MED_Banana_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Skeleton_AnimBlueprint_C, AnimGraphNode_RigidBody) == 0x0017E0, "Member 'UM_MED_Banana_Skeleton_AnimBlueprint_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone) == 0x002160, "Member 'UM_MED_Banana_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone' has a wrong offset!");

}

