#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Bunker_Man_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Bunker_Man_AnimBP.M_MED_Bunker_Man_AnimBP_C
// 0x17B0 (0x1E40 - 0x0690)
class UM_MED_Bunker_Man_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0698(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x06C8(0x0180)(ContainsInstancedReference)
	uint8                                         Pad_848[0x8];                                      // 0x0848(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x0850(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x0D60(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x1270(0x0510)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1780(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x17A0(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_3;                        // 0x17C0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x18C8(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x19D0(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x1AD8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1BE0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1D08(0x0128)()
	float                                         head_down_alpha;                                   // 0x1E30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         head_up_alpha;                                     // 0x1E34(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_M_MED_Bunker_Man_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Bunker_Man_AnimBP_C">();
	}
	static class UM_MED_Bunker_Man_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Bunker_Man_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_Bunker_Man_AnimBP_C) == 0x000010, "Wrong alignment on UM_MED_Bunker_Man_AnimBP_C");
static_assert(sizeof(UM_MED_Bunker_Man_AnimBP_C) == 0x001E40, "Wrong size on UM_MED_Bunker_Man_AnimBP_C");
static_assert(offsetof(UM_MED_Bunker_Man_AnimBP_C, UberGraphFrame) == 0x000690, "Member 'UM_MED_Bunker_Man_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Bunker_Man_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000698, "Member 'UM_MED_Bunker_Man_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UM_MED_Bunker_Man_AnimBP_C, AnimBlueprintExtension_Base) == 0x0006A0, "Member 'UM_MED_Bunker_Man_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UM_MED_Bunker_Man_AnimBP_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UM_MED_Bunker_Man_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Bunker_Man_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0006C8, "Member 'UM_MED_Bunker_Man_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Bunker_Man_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x000850, "Member 'UM_MED_Bunker_Man_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Bunker_Man_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x000D60, "Member 'UM_MED_Bunker_Man_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Bunker_Man_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x001270, "Member 'UM_MED_Bunker_Man_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UM_MED_Bunker_Man_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x001780, "Member 'UM_MED_Bunker_Man_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Bunker_Man_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0017A0, "Member 'UM_MED_Bunker_Man_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Bunker_Man_AnimBP_C, AnimGraphNode_Constraint_3) == 0x0017C0, "Member 'UM_MED_Bunker_Man_AnimBP_C::AnimGraphNode_Constraint_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Bunker_Man_AnimBP_C, AnimGraphNode_Constraint_2) == 0x0018C8, "Member 'UM_MED_Bunker_Man_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Bunker_Man_AnimBP_C, AnimGraphNode_Constraint_1) == 0x0019D0, "Member 'UM_MED_Bunker_Man_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Bunker_Man_AnimBP_C, AnimGraphNode_Constraint) == 0x001AD8, "Member 'UM_MED_Bunker_Man_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UM_MED_Bunker_Man_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x001BE0, "Member 'UM_MED_Bunker_Man_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Bunker_Man_AnimBP_C, AnimGraphNode_ModifyBone) == 0x001D08, "Member 'UM_MED_Bunker_Man_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UM_MED_Bunker_Man_AnimBP_C, head_down_alpha) == 0x001E30, "Member 'UM_MED_Bunker_Man_AnimBP_C::head_down_alpha' has a wrong offset!");
static_assert(offsetof(UM_MED_Bunker_Man_AnimBP_C, head_up_alpha) == 0x001E34, "Member 'UM_MED_Bunker_Man_AnimBP_C::head_up_alpha' has a wrong offset!");

}

