#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Street_Demon_FaceAcc_AnimBp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Street_Demon_FaceAcc_AnimBp.M_MED_Street_Demon_FaceAcc_AnimBp_C
// 0x01C0 (0x0850 - 0x0690)
class UM_MED_Street_Demon_FaceAcc_AnimBp_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0698(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x06C8(0x0180)(ContainsInstancedReference)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_M_MED_Street_Demon_FaceAcc_AnimBp(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Street_Demon_FaceAcc_AnimBp_C">();
	}
	static class UM_MED_Street_Demon_FaceAcc_AnimBp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Street_Demon_FaceAcc_AnimBp_C>();
	}
};
static_assert(alignof(UM_MED_Street_Demon_FaceAcc_AnimBp_C) == 0x000010, "Wrong alignment on UM_MED_Street_Demon_FaceAcc_AnimBp_C");
static_assert(sizeof(UM_MED_Street_Demon_FaceAcc_AnimBp_C) == 0x000850, "Wrong size on UM_MED_Street_Demon_FaceAcc_AnimBp_C");
static_assert(offsetof(UM_MED_Street_Demon_FaceAcc_AnimBp_C, UberGraphFrame) == 0x000690, "Member 'UM_MED_Street_Demon_FaceAcc_AnimBp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Street_Demon_FaceAcc_AnimBp_C, AnimBlueprintExtension_PropertyAccess) == 0x000698, "Member 'UM_MED_Street_Demon_FaceAcc_AnimBp_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UM_MED_Street_Demon_FaceAcc_AnimBp_C, AnimBlueprintExtension_Base) == 0x0006A0, "Member 'UM_MED_Street_Demon_FaceAcc_AnimBp_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UM_MED_Street_Demon_FaceAcc_AnimBp_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UM_MED_Street_Demon_FaceAcc_AnimBp_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Street_Demon_FaceAcc_AnimBp_C, AnimGraphNode_CopyPoseFromMesh) == 0x0006C8, "Member 'UM_MED_Street_Demon_FaceAcc_AnimBp_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");

}

