#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Graffiti_Body_02_AnimBlueprint

#include "Basic.hpp"

#include "M_MED_Graffiti_Body_02_AnimBlueprint_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Graffiti_Body_02_AnimBlueprint.M_MED_Graffiti_Body_02_AnimBlueprint_C
// 0x18E0 (0x1F70 - 0x0690)
class UM_MED_Graffiti_Body_02_AnimBlueprint_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0698(0x0003)(HasGetValueTypeHash)
	uint8                                         Pad_69B[0x5];                                      // 0x069B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x06A0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A8(0x0008)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x06B0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x06D0(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x0718(0x0128)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x0840(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x0948(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x0968(0x0128)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x0A90(0x0510)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x0FA0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x0FC0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x10E8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x1210(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x1338(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x1460(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x1480(0x0180)(ContainsInstancedReference)
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x1600(0x0128)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1728(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x1770(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1790(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x17B0(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x17D0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x17F0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1918(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1A40(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1B68(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1C90(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1CB0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x1CD8(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1DD8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1E00(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1E28(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1F28(0x0028)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x1F50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GetPlayerListUsesCustomCharacterParts;             // 0x1F58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F59[0x3];                                     // 0x1F59(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         head_rot_back;                                     // 0x1F5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ads_rotate_back;                                   // 0x1F60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Head_Rot_Forward;                                  // 0x1F64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ADS_Rot_Forward;                                   // 0x1F68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         headSpineRot;                                      // 0x1F6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Graffiti_Body_02_AnimBlueprint_C">();
	}
	static class UM_MED_Graffiti_Body_02_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Graffiti_Body_02_AnimBlueprint_C>();
	}
};
static_assert(alignof(UM_MED_Graffiti_Body_02_AnimBlueprint_C) == 0x000010, "Wrong alignment on UM_MED_Graffiti_Body_02_AnimBlueprint_C");
static_assert(sizeof(UM_MED_Graffiti_Body_02_AnimBlueprint_C) == 0x001F70, "Wrong size on UM_MED_Graffiti_Body_02_AnimBlueprint_C");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, UberGraphFrame) == 0x000690, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, __AnimBlueprintMutables) == 0x000698, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x0006A0, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimBlueprintExtension_Base) == 0x0006A8, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace_3) == 0x0006B0, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_BlendListByBool_1) == 0x0006D0, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_ModifyBone_10) == 0x000718, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_ModifyBone_10' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_Constraint) == 0x000840, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x000948, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_ModifyBone_9) == 0x000968, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_AnimDynamics) == 0x000A90, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace_3) == 0x000FA0, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_ModifyBone_8) == 0x000FC0, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_ModifyBone_7) == 0x0010E8, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_ModifyBone_6) == 0x001210, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_ModifyBone_5) == 0x001338, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace_2) == 0x001460, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_CopyPoseFromMesh) == 0x001480, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_ModifyBone_4) == 0x001600, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_BlendListByBool) == 0x001728, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x001770, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x001790, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace_1) == 0x0017B0, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x0017D0, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_ModifyBone_3) == 0x0017F0, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_ModifyBone_2) == 0x001918, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_ModifyBone_1) == 0x001A40, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_ModifyBone) == 0x001B68, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_Root) == 0x001C90, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_UseCachedPose_3) == 0x001CB0, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_SaveCachedPose_1) == 0x001CD8, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_UseCachedPose_2) == 0x001DD8, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_UseCachedPose_1) == 0x001E00, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_SaveCachedPose) == 0x001E28, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, AnimGraphNode_UseCachedPose) == 0x001F28, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, MeshToCopy) == 0x001F50, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::MeshToCopy' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, GetPlayerListUsesCustomCharacterParts) == 0x001F58, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::GetPlayerListUsesCustomCharacterParts' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, head_rot_back) == 0x001F5C, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::head_rot_back' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, ads_rotate_back) == 0x001F60, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::ads_rotate_back' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, Head_Rot_Forward) == 0x001F64, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::Head_Rot_Forward' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, ADS_Rot_Forward) == 0x001F68, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::ADS_Rot_Forward' has a wrong offset!");
static_assert(offsetof(UM_MED_Graffiti_Body_02_AnimBlueprint_C, headSpineRot) == 0x001F6C, "Member 'UM_MED_Graffiti_Body_02_AnimBlueprint_C::headSpineRot' has a wrong offset!");

}

