#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint.M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C.ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint
// 0x0160 (0x0160 - 0x0000)
struct M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetPartSkeletalMeshComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetMIDForSkeletalMeshComponent_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetSkeletalMeshForPartType_ReturnValue;   // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetDeltaTransformFromRefPose_ReturnValue; // 0x0060(0x0060)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_2;            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint) == 0x000010, "Wrong alignment on M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint");
static_assert(sizeof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint) == 0x000160, "Wrong size on M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_GetPartSkeletalMeshComponent_ReturnValue) == 0x000008, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_GetPartSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000010, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_GetMIDForSkeletalMeshComponent_ReturnValue) == 0x000018, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_GetMIDForSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000028, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_GetSkeletalMeshForPartType_ReturnValue) == 0x000038, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_GetSkeletalMeshForPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_GetCurveValue_ReturnValue) == 0x000040, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_Round_ReturnValue) == 0x000044, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_MapRangeClamped_ReturnValue) == 0x000048, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00004C, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000050, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000054, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x000058, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_GetDeltaTransformFromRefPose_ReturnValue) == 0x000060, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_GetDeltaTransformFromRefPose_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000C0, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_BreakTransform_Location) == 0x0000C8, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_BreakTransform_Rotation) == 0x0000E0, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_BreakTransform_Scale) == 0x0000F8, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_BreakRotator_Roll) == 0x000110, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_BreakRotator_Pitch) == 0x000114, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_BreakRotator_Yaw) == 0x000118, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_MapRangeClamped_ReturnValue_1) == 0x00011C, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_MapRangeClamped_ReturnValue_2) == 0x000120, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_MakeRotator_ReturnValue) == 0x000128, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint, CallFunc_MakeVector_ReturnValue) == 0x000140, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint.M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint.M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000020, "Wrong size on M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_AnimGraph, InPose) == 0x000000, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

