#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Banana_FaceAcc_Head_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct M_MED_Banana_FaceAcc_Head_AnimBP.M_MED_Banana_FaceAcc_Head_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00FF (0x0100 - 0x0001)
struct M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_34;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_35;                                 // 0x0008(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_36;                                // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_37;                               // 0x0010(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_38;                                // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_39;                             // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_40;                                 // 0x0048(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_41;                                 // 0x0049(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_42;                                 // 0x004A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_43;                                 // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_44;                               // 0x0050(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0068(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00E8(0x0018)()
};
static_assert(alignof(M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000100, "Wrong size on M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_34) == 0x000004, "Member 'M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_34' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_35) == 0x000008, "Member 'M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_35' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_36) == 0x00000C, "Member 'M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_36' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_37) == 0x000010, "Member 'M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_37' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_38) == 0x00003C, "Member 'M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_38' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_39) == 0x000040, "Member 'M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_39' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_40) == 0x000048, "Member 'M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_40' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_41) == 0x000049, "Member 'M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_41' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_42) == 0x00004A, "Member 'M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_42' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_43) == 0x00004C, "Member 'M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_43' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_44) == 0x000050, "Member 'M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_44' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000068, "Member 'M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000E8, "Member 'M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct M_MED_Banana_FaceAcc_Head_AnimBP.M_MED_Banana_FaceAcc_Head_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0000 (0x0001 - 0x0001)
struct M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
};
static_assert(alignof(M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong size on M_MED_Banana_FaceAcc_Head_AnimBP::FAnimBlueprintGeneratedMutableData");

}

