#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP

#include "Basic.hpp"

#include "M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP.M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C
// 0x1FE0 (0x2670 - 0x0690)
class UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0698(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_6A4[0x4];                                      // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x06A8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06B0(0x0008)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x06B8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x06D8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0800(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0928(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0A50(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0B78(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0CA0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0DC8(0x0128)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x0EF0(0x0040)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x0F30(0x0980)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x18B0(0x0980)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2230(0x0100)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2330(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x2350(0x0180)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x24D0(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x24F0(0x00E0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x25D0(0x0040)()
	struct FRotator                               head_rot;                                          // 0x2610(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Neck_01_Rot;                                       // 0x2628(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Neck_02_Rot;                                       // 0x2640(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class USkeletalMeshComponent*                 skel_mesh;                                         // 0x2658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         isCustomEmotePlaying;                              // 0x2660(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         customEmotePosition;                               // 0x2664(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_AnimGraphNode_ModifyBone_D81C4DC742DCB4E5F698A6A32E938E54();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_AnimGraphNode_ModifyBone_620325A94DBA225832E2448068C4E175();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_AnimGraphNode_ModifyBone_56C2E96040483FE3B76797A0C1942376();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintPostEvaluateAnimation();
	void BlueprintInitializeAnimation();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C">();
	}
	static class UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C) == 0x000010, "Wrong alignment on UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C");
static_assert(sizeof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C) == 0x002670, "Wrong size on UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, UberGraphFrame) == 0x000690, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, __AnimBlueprintMutables) == 0x000698, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x0006A8, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, AnimBlueprintExtension_Base) == 0x0006B0, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0006B8, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, AnimGraphNode_ModifyBone_6) == 0x0006D8, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, AnimGraphNode_ModifyBone_5) == 0x000800, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, AnimGraphNode_ModifyBone_4) == 0x000928, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x000A50, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x000B78, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x000CA0, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000DC8, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, AnimGraphNode_SequenceEvaluator_1) == 0x000EF0, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::AnimGraphNode_SequenceEvaluator_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, AnimGraphNode_RigidBody_1) == 0x000F30, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, AnimGraphNode_RigidBody) == 0x0018B0, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x002230, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x002330, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x002350, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, AnimGraphNode_Root) == 0x0024D0, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x0024F0, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, AnimGraphNode_SequenceEvaluator) == 0x0025D0, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::AnimGraphNode_SequenceEvaluator' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, head_rot) == 0x002610, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::head_rot' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, Neck_01_Rot) == 0x002628, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::Neck_01_Rot' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, Neck_02_Rot) == 0x002640, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::Neck_02_Rot' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, skel_mesh) == 0x002658, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::skel_mesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, isCustomEmotePlaying) == 0x002660, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::isCustomEmotePlaying' has a wrong offset!");
static_assert(offsetof(UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C, customEmotePosition) == 0x002664, "Member 'UM_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C::customEmotePosition' has a wrong offset!");

}

