#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint.M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C
// 0x2620 (0x2CB0 - 0x0690)
class UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0698(0x0004)(HasGetValueTypeHash)
	uint8                                         Pad_69C[0x4];                                      // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x06A0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06B0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x06D0(0x00C0)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_2;                         // 0x0790(0x0980)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x1110(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x1130(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1150(0x0048)()
	uint8                                         Pad_1198[0x8];                                     // 0x1198(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x11A0(0x0980)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x1B20(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x1B40(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x1B60(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1C60(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1C88(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1CB0(0x0048)()
	uint8                                         Pad_1CF8[0x8];                                     // 0x1CF8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x1D00(0x0980)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x2680(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x26A0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x26C0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x26E8(0x0040)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x2728(0x0180)(ContainsInstancedReference)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x28A8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x28F0(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x29D0(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2AD0(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x2AF8(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2C20(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2C40(0x0020)()
	bool                                          IsInAir;                                           // 0x2C60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsADS;                                             // 0x2C61(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C62[0x6];                                     // 0x2C62(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 head_skelmesh;                                     // 0x2C68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isValidHead;                                       // 0x2C70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C71[0x7];                                     // 0x2C71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               backpack_rotate;                                   // 0x2C78(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                backpack_translation;                              // 0x2C90(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnEndTargeting();
	void OnBeginTargeting();
	void ExecuteUbergraph_M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintInitializeAnimation();
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C">();
	}
	static class UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C) == 0x002CB0, "Wrong size on UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000690, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, __AnimBlueprintMutables) == 0x000698, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x0006A0, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_Base) == 0x0006A8, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0006B0, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_SubInput) == 0x0006D0, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_RigidBody_2) == 0x000790, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_RigidBody_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace_3) == 0x001110, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace_3) == 0x001130, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_BlendListByBool_2) == 0x001150, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_RigidBody_1) == 0x0011A0, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace_2) == 0x001B20, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x001B40, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_SaveCachedPose_1) == 0x001B60, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose_3) == 0x001C60, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose_2) == 0x001C88, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_BlendListByBool_1) == 0x001CB0, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_RigidBody) == 0x001D00, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace_1) == 0x002680, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x0026A0, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose_1) == 0x0026C0, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_SequencePlayer) == 0x0026E8, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_CopyPoseFromMesh) == 0x002728, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_BlendListByBool) == 0x0028A8, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_LayeredBoneBlend) == 0x0028F0, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_SaveCachedPose) == 0x0029D0, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_UseCachedPose) == 0x002AD0, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone) == 0x002AF8, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x002C20, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x002C40, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, IsInAir) == 0x002C60, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::IsInAir' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, IsADS) == 0x002C61, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::IsADS' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, head_skelmesh) == 0x002C68, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::head_skelmesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, isValidHead) == 0x002C70, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::isValidHead' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, backpack_rotate) == 0x002C78, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::backpack_rotate' has a wrong offset!");
static_assert(offsetof(UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C, backpack_translation) == 0x002C90, "Member 'UM_MED_Banana_Smoothie_Pack_Skeleton_AnimBlueprint_C::backpack_translation' has a wrong offset!");

}

