#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Ice_Cream_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function M_MED_Ice_Cream_AnimBP.M_MED_Ice_Cream_AnimBP_C.ExecuteUbergraph_M_MED_Ice_Cream_AnimBP
// 0x0010 (0x0010 - 0x0000)
struct M_MED_Ice_Cream_AnimBP_C_ExecuteUbergraph_M_MED_Ice_Cream_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckForBackbling_bIsWearingBackbling;    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckForBackbling_bIsBackblingACape;      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckForBackbling_bIsBackblingLong;       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Ice_Cream_AnimBP_C_ExecuteUbergraph_M_MED_Ice_Cream_AnimBP) == 0x000004, "Wrong alignment on M_MED_Ice_Cream_AnimBP_C_ExecuteUbergraph_M_MED_Ice_Cream_AnimBP");
static_assert(sizeof(M_MED_Ice_Cream_AnimBP_C_ExecuteUbergraph_M_MED_Ice_Cream_AnimBP) == 0x000010, "Wrong size on M_MED_Ice_Cream_AnimBP_C_ExecuteUbergraph_M_MED_Ice_Cream_AnimBP");
static_assert(offsetof(M_MED_Ice_Cream_AnimBP_C_ExecuteUbergraph_M_MED_Ice_Cream_AnimBP, EntryPoint) == 0x000000, "Member 'M_MED_Ice_Cream_AnimBP_C_ExecuteUbergraph_M_MED_Ice_Cream_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(M_MED_Ice_Cream_AnimBP_C_ExecuteUbergraph_M_MED_Ice_Cream_AnimBP, CallFunc_CheckForBackbling_bIsWearingBackbling) == 0x000004, "Member 'M_MED_Ice_Cream_AnimBP_C_ExecuteUbergraph_M_MED_Ice_Cream_AnimBP::CallFunc_CheckForBackbling_bIsWearingBackbling' has a wrong offset!");
static_assert(offsetof(M_MED_Ice_Cream_AnimBP_C_ExecuteUbergraph_M_MED_Ice_Cream_AnimBP, CallFunc_CheckForBackbling_bIsBackblingACape) == 0x000005, "Member 'M_MED_Ice_Cream_AnimBP_C_ExecuteUbergraph_M_MED_Ice_Cream_AnimBP::CallFunc_CheckForBackbling_bIsBackblingACape' has a wrong offset!");
static_assert(offsetof(M_MED_Ice_Cream_AnimBP_C_ExecuteUbergraph_M_MED_Ice_Cream_AnimBP, CallFunc_CheckForBackbling_bIsBackblingLong) == 0x000006, "Member 'M_MED_Ice_Cream_AnimBP_C_ExecuteUbergraph_M_MED_Ice_Cream_AnimBP::CallFunc_CheckForBackbling_bIsBackblingLong' has a wrong offset!");
static_assert(offsetof(M_MED_Ice_Cream_AnimBP_C_ExecuteUbergraph_M_MED_Ice_Cream_AnimBP, CallFunc_BooleanOR_ReturnValue) == 0x000007, "Member 'M_MED_Ice_Cream_AnimBP_C_ExecuteUbergraph_M_MED_Ice_Cream_AnimBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Ice_Cream_AnimBP_C_ExecuteUbergraph_M_MED_Ice_Cream_AnimBP, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000008, "Member 'M_MED_Ice_Cream_AnimBP_C_ExecuteUbergraph_M_MED_Ice_Cream_AnimBP::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Ice_Cream_AnimBP_C_ExecuteUbergraph_M_MED_Ice_Cream_AnimBP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00000C, "Member 'M_MED_Ice_Cream_AnimBP_C_ExecuteUbergraph_M_MED_Ice_Cream_AnimBP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

// Function M_MED_Ice_Cream_AnimBP.M_MED_Ice_Cream_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct M_MED_Ice_Cream_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(M_MED_Ice_Cream_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on M_MED_Ice_Cream_AnimBP_C_AnimGraph");
static_assert(sizeof(M_MED_Ice_Cream_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on M_MED_Ice_Cream_AnimBP_C_AnimGraph");
static_assert(offsetof(M_MED_Ice_Cream_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'M_MED_Ice_Cream_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

