#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Dumpling_Man_Pork_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function M_MED_Dumpling_Man_Pork_AnimBP.M_MED_Dumpling_Man_Pork_AnimBP_C.ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP
// 0x01A0 (0x01A0 - 0x0000)
struct M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetDeltaTransformFromRefPose_ReturnValue; // 0x0020(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetDeltaTransformFromRefPose_ReturnValue_1; // 0x00D0(0x0060)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP) == 0x000010, "Wrong alignment on M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP");
static_assert(sizeof(M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP) == 0x0001A0, "Wrong size on M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP");
static_assert(offsetof(M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP, EntryPoint) == 0x000000, "Member 'M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP, CallFunc_SelectFloat_ReturnValue) == 0x000004, "Member 'M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x000010, "Member 'M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP, CallFunc_GetDeltaTransformFromRefPose_ReturnValue) == 0x000020, "Member 'M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP::CallFunc_GetDeltaTransformFromRefPose_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP, CallFunc_BreakTransform_Location) == 0x000080, "Member 'M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP, CallFunc_BreakTransform_Rotation) == 0x000098, "Member 'M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP, CallFunc_BreakTransform_Scale) == 0x0000B0, "Member 'M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP, CallFunc_GetDeltaTransformFromRefPose_ReturnValue_1) == 0x0000D0, "Member 'M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP::CallFunc_GetDeltaTransformFromRefPose_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP, CallFunc_BreakRotator_Roll) == 0x000130, "Member 'M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP, CallFunc_BreakRotator_Pitch) == 0x000134, "Member 'M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP, CallFunc_BreakRotator_Yaw) == 0x000138, "Member 'M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP, CallFunc_BreakTransform_Location_1) == 0x000140, "Member 'M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP, CallFunc_BreakTransform_Rotation_1) == 0x000158, "Member 'M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP, CallFunc_BreakTransform_Scale_1) == 0x000170, "Member 'M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP, CallFunc_BreakRotator_Roll_1) == 0x000188, "Member 'M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP, CallFunc_BreakRotator_Pitch_1) == 0x00018C, "Member 'M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP, CallFunc_BreakRotator_Yaw_1) == 0x000190, "Member 'M_MED_Dumpling_Man_Pork_AnimBP_C_ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");

// Function M_MED_Dumpling_Man_Pork_AnimBP.M_MED_Dumpling_Man_Pork_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct M_MED_Dumpling_Man_Pork_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Dumpling_Man_Pork_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on M_MED_Dumpling_Man_Pork_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(M_MED_Dumpling_Man_Pork_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on M_MED_Dumpling_Man_Pork_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(M_MED_Dumpling_Man_Pork_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'M_MED_Dumpling_Man_Pork_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function M_MED_Dumpling_Man_Pork_AnimBP.M_MED_Dumpling_Man_Pork_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct M_MED_Dumpling_Man_Pork_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(M_MED_Dumpling_Man_Pork_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on M_MED_Dumpling_Man_Pork_AnimBP_C_AnimGraph");
static_assert(sizeof(M_MED_Dumpling_Man_Pork_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on M_MED_Dumpling_Man_Pork_AnimBP_C_AnimGraph");
static_assert(offsetof(M_MED_Dumpling_Man_Pork_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'M_MED_Dumpling_Man_Pork_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

