#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Dumpling_Man_Pork_AnimBP

#include "Basic.hpp"

#include "M_MED_Dumpling_Man_Pork_AnimBP_structs.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ControlRig_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Dumpling_Man_Pork_AnimBP.M_MED_Dumpling_Man_Pork_AnimBP_C
// 0x2220 (0x28B0 - 0x0690)
class UM_MED_Dumpling_Man_Pork_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct M_MED_Dumpling_Man_Pork_AnimBP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                           // 0x0698(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_69A[0x6];                                      // 0x069A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x06A0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A8(0x0008)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x06B0(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x07B8(0x0020)()
	uint8                                         Pad_7D8[0x8];                                      // 0x07D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x07E0(0x0510)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0CF0(0x0100)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0DF0(0x0980)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1770(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x1798(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x17B8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1800(0x0100)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1900(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1928(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1950(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1970(0x0020)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x1990(0x0108)()
	uint8                                         Pad_1A98[0x8];                                     // 0x1A98(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x1AA0(0x0240)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x1CE0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1E08(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1F30(0x0128)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x2058(0x0180)(ContainsInstancedReference)
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x21D8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x2300(0x0128)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x2428(0x0458)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2880(0x0020)()
	float                                         legUp_L;                                           // 0x28A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         legUp_R;                                           // 0x28A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         legSide_R;                                         // 0x28A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Iscrouchinganim;                                   // 0x28AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnParachuteOpened();
	void OnEndSkydiving();
	void OnEndCrouching();
	void OnBeginTargeting();
	void OnBeginSkydiving();
	void ExecuteUbergraph_M_MED_Dumpling_Man_Pork_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Dumpling_Man_Pork_AnimBP_C">();
	}
	static class UM_MED_Dumpling_Man_Pork_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Dumpling_Man_Pork_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_Dumpling_Man_Pork_AnimBP_C) == 0x000010, "Wrong alignment on UM_MED_Dumpling_Man_Pork_AnimBP_C");
static_assert(sizeof(UM_MED_Dumpling_Man_Pork_AnimBP_C) == 0x0028B0, "Wrong size on UM_MED_Dumpling_Man_Pork_AnimBP_C");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, UberGraphFrame) == 0x000690, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, __AnimBlueprintMutables) == 0x000698, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::__AnimBlueprintMutables' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x0006A0, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimBlueprintExtension_Base) == 0x0006A8, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_Constraint_1) == 0x0006B0, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x0007B8, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x0007E0, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_SaveCachedPose_1) == 0x000CF0, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_RigidBody) == 0x000DF0, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x001770, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x001798, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x0017B8, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x001800, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x001900, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x001928, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x001950, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x001970, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_Constraint) == 0x001990, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_LookAt) == 0x001AA0, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_LookAt' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_ModifyBone_4) == 0x001CE0, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x001E08, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x001F30, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x002058, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x0021D8, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_ModifyBone) == 0x002300, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_ControlRig) == 0x002428, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, AnimGraphNode_Root) == 0x002880, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, legUp_L) == 0x0028A0, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::legUp_L' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, legUp_R) == 0x0028A4, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::legUp_R' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, legSide_R) == 0x0028A8, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::legSide_R' has a wrong offset!");
static_assert(offsetof(UM_MED_Dumpling_Man_Pork_AnimBP_C, Iscrouchinganim) == 0x0028AC, "Member 'UM_MED_Dumpling_Man_Pork_AnimBP_C::Iscrouchinganim' has a wrong offset!");

}

