#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Graffiti_Body_02_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function M_MED_Graffiti_Body_02_AnimBlueprint.M_MED_Graffiti_Body_02_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct M_MED_Graffiti_Body_02_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(M_MED_Graffiti_Body_02_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on M_MED_Graffiti_Body_02_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(M_MED_Graffiti_Body_02_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on M_MED_Graffiti_Body_02_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function M_MED_Graffiti_Body_02_AnimBlueprint.M_MED_Graffiti_Body_02_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct M_MED_Graffiti_Body_02_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Graffiti_Body_02_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on M_MED_Graffiti_Body_02_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(M_MED_Graffiti_Body_02_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on M_MED_Graffiti_Body_02_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function M_MED_Graffiti_Body_02_AnimBlueprint.M_MED_Graffiti_Body_02_AnimBlueprint_C.ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint
// 0x0100 (0x0100 - 0x0000)
struct M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlaylistUsesCustomCharacterParts_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0xF];                                       // 0x0021(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetDeltaTransformFromRefPose_ReturnValue; // 0x0030(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_2;            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_3;            // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint) == 0x000010, "Wrong alignment on M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint");
static_assert(sizeof(M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint) == 0x000100, "Wrong size on M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint, EntryPoint) == 0x000000, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x000008, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000010, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1) == 0x000018, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint, CallFunc_GetPlaylistUsesCustomCharacterParts_ReturnValue) == 0x000020, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint::CallFunc_GetPlaylistUsesCustomCharacterParts_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint, CallFunc_GetDeltaTransformFromRefPose_ReturnValue) == 0x000030, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint::CallFunc_GetDeltaTransformFromRefPose_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint, CallFunc_BreakTransform_Location) == 0x000090, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint, CallFunc_BreakTransform_Rotation) == 0x0000A8, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint, CallFunc_BreakTransform_Scale) == 0x0000C0, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint, CallFunc_BreakRotator_Roll) == 0x0000D8, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint, CallFunc_BreakRotator_Pitch) == 0x0000DC, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint, CallFunc_BreakRotator_Yaw) == 0x0000E0, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint, CallFunc_MapRangeClamped_ReturnValue) == 0x0000E4, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint, CallFunc_MapRangeClamped_ReturnValue_1) == 0x0000E8, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint, CallFunc_MapRangeClamped_ReturnValue_2) == 0x0000EC, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint, CallFunc_MapRangeClamped_ReturnValue_3) == 0x0000F0, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint_C_ExecuteUbergraph_M_MED_Graffiti_Body_02_AnimBlueprint::CallFunc_MapRangeClamped_ReturnValue_3' has a wrong offset!");

}

