#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Graffiti_Body_02_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct M_MED_Graffiti_Body_02_AnimBlueprint.M_MED_Graffiti_Body_02_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// 0x00F7 (0x00F8 - 0x0001)
struct M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_96;                                // 0x0008(0x0010)(BlueprintVisible, EditFixedSize)
	class UBlendProfile*                          __BlendProfile_97;                                 // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_98;                                   // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_99;                                 // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_100;                                // 0x0029(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_101;                                // 0x002A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_102;                               // 0x0030(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_103;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_104;                                // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeFunctionRef                   __StructProperty_105;                              // 0x0048(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0060(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00E0(0x0018)()
};
static_assert(alignof(M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x0000F8, "Wrong size on M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_96) == 0x000008, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_96' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BlendProfile_97) == 0x000018, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BlendProfile_97' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __CurveFloat_98) == 0x000020, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__CurveFloat_98' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __BoolProperty_99) == 0x000028, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__BoolProperty_99' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_100) == 0x000029, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_100' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __EnumProperty_101) == 0x00002A, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__EnumProperty_101' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ArrayProperty_102) == 0x000030, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ArrayProperty_102' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_103) == 0x000040, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_103' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_104) == 0x000044, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_104' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_105) == 0x000048, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_105' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000060, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000E0, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct M_MED_Graffiti_Body_02_AnimBlueprint.M_MED_Graffiti_Body_02_AnimBlueprint_C.AnimBlueprintGeneratedMutableData
// 0x0002 (0x0003 - 0x0001)
struct M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_0;                                  // 0x0002(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedMutableData) == 0x000003, "Wrong size on M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");
static_assert(offsetof(M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedMutableData, __BoolProperty_0) == 0x000002, "Member 'M_MED_Graffiti_Body_02_AnimBlueprint::FAnimBlueprintGeneratedMutableData::__BoolProperty_0' has a wrong offset!");

}

