#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint.M_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C
// 0x1E90 (0x2520 - 0x0690)
class UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0698(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x06C8(0x0180)(ContainsInstancedReference)
	uint8                                         Pad_848[0x8];                                      // 0x0848(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x0850(0x0510)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0D60(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0D80(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x0DA0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x12B0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x17C0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x1CD0(0x0510)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x21E0(0x0128)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x2308(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x2410(0x0108)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_M_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C">();
	}
	static class UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C");
static_assert(sizeof(UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C) == 0x002520, "Wrong size on UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C");
static_assert(offsetof(UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x000690, "Member 'UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x000698, "Member 'UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C, AnimBlueprintExtension_Base) == 0x0006A0, "Member 'UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C, AnimGraphNode_CopyPoseFromMesh) == 0x0006C8, "Member 'UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics_4) == 0x000850, "Member 'UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x000D60, "Member 'UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x000D80, "Member 'UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics_3) == 0x000DA0, "Member 'UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics_2) == 0x0012B0, "Member 'UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics_1) == 0x0017C0, "Member 'UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C, AnimGraphNode_AnimDynamics) == 0x001CD0, "Member 'UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C, AnimGraphNode_ModifyBone) == 0x0021E0, "Member 'UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C, AnimGraphNode_Constraint_1) == 0x002308, "Member 'UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C, AnimGraphNode_Constraint) == 0x002410, "Member 'UM_MED_Teriyaki_Fish_Hat_MESH_Skeleton_AnimBlueprint_C::AnimGraphNode_Constraint' has a wrong offset!");

}

