#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_The_Origin_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function M_MED_The_Origin_AnimBP.M_MED_The_Origin_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct M_MED_The_Origin_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(M_MED_The_Origin_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on M_MED_The_Origin_AnimBP_C_AnimGraph");
static_assert(sizeof(M_MED_The_Origin_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on M_MED_The_Origin_AnimBP_C_AnimGraph");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'M_MED_The_Origin_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function M_MED_The_Origin_AnimBP.M_MED_The_Origin_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct M_MED_The_Origin_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_The_Origin_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on M_MED_The_Origin_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(M_MED_The_Origin_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on M_MED_The_Origin_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'M_MED_The_Origin_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function M_MED_The_Origin_AnimBP.M_MED_The_Origin_AnimBP_C.ExecuteUbergraph_M_MED_The_Origin_AnimBP
// 0x0068 (0x0068 - 0x0000)
struct M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput; // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlayerAnimInstance*                K2Node_DynamicCast_AsFort_Player_Anim_Instance;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_1; // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_1; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_2; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_2; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_3; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_3; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP) == 0x000008, "Wrong alignment on M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP");
static_assert(sizeof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP) == 0x000068, "Wrong size on M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, EntryPoint) == 0x000000, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, CallFunc_BooleanOR_ReturnValue_1) == 0x000005, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x000010, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1) == 0x000018, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput) == 0x000020, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput) == 0x000024, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, CallFunc_GetAnimInstance_ReturnValue) == 0x000028, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, CallFunc_Abs_ReturnValue) == 0x000030, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, K2Node_DynamicCast_AsFort_Player_Anim_Instance) == 0x000038, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::K2Node_DynamicCast_AsFort_Player_Anim_Instance' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, CallFunc_MapRangeClamped_ReturnValue) == 0x000044, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, K2Node_SwitchEnum_CmpSuccess) == 0x000048, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_1) == 0x00004C, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_1' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_1) == 0x000050, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_1' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, CallFunc_BooleanOR_ReturnValue_2) == 0x000054, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, CallFunc_Not_PreBool_ReturnValue) == 0x000055, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_2) == 0x000058, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_2' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_2) == 0x00005C, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_2' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_3) == 0x000060, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_AlphaOutput_3' has a wrong offset!");
static_assert(offsetof(M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP, CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_3) == 0x000064, "Member 'M_MED_The_Origin_AnimBP_C_ExecuteUbergraph_M_MED_The_Origin_AnimBP::CallFunc_GetAlphaFromReferenceTransformDelta_RawOutput_3' has a wrong offset!");

}

