#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP.M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C.ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP
// 0x0280 (0x0280 - 0x0000)
struct M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetPartSkeletalMeshComponent_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_GetPosition_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Montage_IsActive_ReturnValue;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetDeltaTransformFromRefPose_ReturnValue; // 0x0080(0x0060)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetDeltaTransformFromRefPose_ReturnValue_1; // 0x00E0(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetDeltaTransformFromRefPose_ReturnValue_2; // 0x01D0(0x0060)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP) == 0x000010, "Wrong alignment on M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP");
static_assert(sizeof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP) == 0x000280, "Wrong size on M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, EntryPoint) == 0x000000, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_GetPartSkeletalMeshComponent_ReturnValue) == 0x000010, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_GetPartSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_Montage_GetPosition_ReturnValue) == 0x000018, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_Montage_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_GetSocketLocation_ReturnValue) == 0x000020, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_Montage_IsActive_ReturnValue) == 0x000038, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_Montage_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_SelectFloat_ReturnValue) == 0x00003C, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, K2Node_Event_DeltaTimeX) == 0x000040, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_BreakRotator_Roll) == 0x000044, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_BreakRotator_Pitch) == 0x000048, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_BreakRotator_Yaw) == 0x00004C, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x000050, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000058, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_MakeRotator_ReturnValue) == 0x000060, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_GetDeltaTransformFromRefPose_ReturnValue) == 0x000080, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_GetDeltaTransformFromRefPose_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_GetDeltaTransformFromRefPose_ReturnValue_1) == 0x0000E0, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_GetDeltaTransformFromRefPose_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_BreakTransform_Location) == 0x000140, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_BreakTransform_Rotation) == 0x000158, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_BreakTransform_Scale) == 0x000170, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_BreakTransform_Location_1) == 0x000188, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_BreakTransform_Rotation_1) == 0x0001A0, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_BreakTransform_Scale_1) == 0x0001B8, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_GetDeltaTransformFromRefPose_ReturnValue_2) == 0x0001D0, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_GetDeltaTransformFromRefPose_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_BreakTransform_Location_2) == 0x000230, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_BreakTransform_Location_2' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_BreakTransform_Rotation_2) == 0x000248, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_BreakTransform_Rotation_2' has a wrong offset!");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP, CallFunc_BreakTransform_Scale_2) == 0x000260, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_ExecuteUbergraph_M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP::CallFunc_BreakTransform_Scale_2' has a wrong offset!");

// Function M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP.M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP.M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_AnimGraph");
static_assert(sizeof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_AnimGraph");
static_assert(offsetof(M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'M_MED_Flapjack_Wrangler_Dark_Updates_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

