#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_Med_Commando_80sExercise_Glasses_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_Med_Commando_80sExercise_Glasses_AnimBP.M_Med_Commando_80sExercise_Glasses_AnimBP_C
// 0x4F00 (0x5590 - 0x0690)
class UM_Med_Commando_80sExercise_Glasses_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0698(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x06C8(0x0180)(ContainsInstancedReference)
	uint8                                         Pad_848[0x8];                                      // 0x0848(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_14;                     // 0x0850(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_13;                     // 0x0D60(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_12;                     // 0x1270(0x0510)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1780(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x17A0(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_11;                     // 0x17C0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_10;                     // 0x1CD0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_9;                      // 0x21E0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8;                      // 0x26F0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x2C00(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x3110(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x3620(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x3B30(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x4040(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x4550(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x4A60(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x4F70(0x0510)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x5480(0x0108)()

public:
	void ExecuteUbergraph_M_Med_Commando_80sExercise_Glasses_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_Med_Commando_80sExercise_Glasses_AnimBP_C">();
	}
	static class UM_Med_Commando_80sExercise_Glasses_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_Med_Commando_80sExercise_Glasses_AnimBP_C>();
	}
};
static_assert(alignof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C) == 0x000010, "Wrong alignment on UM_Med_Commando_80sExercise_Glasses_AnimBP_C");
static_assert(sizeof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C) == 0x005590, "Wrong size on UM_Med_Commando_80sExercise_Glasses_AnimBP_C");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, UberGraphFrame) == 0x000690, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000698, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimBlueprintExtension_Base) == 0x0006A0, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0006C8, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimGraphNode_AnimDynamics_14) == 0x000850, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimGraphNode_AnimDynamics_14' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimGraphNode_AnimDynamics_13) == 0x000D60, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimGraphNode_AnimDynamics_13' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimGraphNode_AnimDynamics_12) == 0x001270, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimGraphNode_AnimDynamics_12' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x001780, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0017A0, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimGraphNode_AnimDynamics_11) == 0x0017C0, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimGraphNode_AnimDynamics_11' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimGraphNode_AnimDynamics_10) == 0x001CD0, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimGraphNode_AnimDynamics_10' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimGraphNode_AnimDynamics_9) == 0x0021E0, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimGraphNode_AnimDynamics_9' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimGraphNode_AnimDynamics_8) == 0x0026F0, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimGraphNode_AnimDynamics_8' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimGraphNode_AnimDynamics_7) == 0x002C00, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimGraphNode_AnimDynamics_6) == 0x003110, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimGraphNode_AnimDynamics_5) == 0x003620, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x003B30, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x004040, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x004550, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x004A60, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x004F70, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UM_Med_Commando_80sExercise_Glasses_AnimBP_C, AnimGraphNode_Constraint) == 0x005480, "Member 'UM_Med_Commando_80sExercise_Glasses_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");

}

