#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Sharp_Dresser_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct M_MED_Sharp_Dresser_AnimBP.M_MED_Sharp_Dresser_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00E7 (0x00E8 - 0x0001)
struct M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_43;                                 // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_44;                                   // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_45;                                 // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_46;                                 // 0x0019(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_47;                                 // 0x001A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_48;                                // 0x0020(0x0010)(BlueprintVisible, EditFixedSize)
	struct FAnimNodeFunctionRef                   __StructProperty_49;                               // 0x0030(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_50;                                 // 0x0048(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_51;                                 // 0x004C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0050(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00D0(0x0018)()
};
static_assert(alignof(M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0000E8, "Wrong size on M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_43) == 0x000008, "Member 'M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_43' has a wrong offset!");
static_assert(offsetof(M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_44) == 0x000010, "Member 'M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_44' has a wrong offset!");
static_assert(offsetof(M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_45) == 0x000018, "Member 'M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_45' has a wrong offset!");
static_assert(offsetof(M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_46) == 0x000019, "Member 'M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_46' has a wrong offset!");
static_assert(offsetof(M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_47) == 0x00001A, "Member 'M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_47' has a wrong offset!");
static_assert(offsetof(M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_48) == 0x000020, "Member 'M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_48' has a wrong offset!");
static_assert(offsetof(M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_49) == 0x000030, "Member 'M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_49' has a wrong offset!");
static_assert(offsetof(M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_50) == 0x000048, "Member 'M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_50' has a wrong offset!");
static_assert(offsetof(M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_51) == 0x00004C, "Member 'M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_51' has a wrong offset!");
static_assert(offsetof(M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000050, "Member 'M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000D0, "Member 'M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct M_MED_Sharp_Dresser_AnimBP.M_MED_Sharp_Dresser_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0001 (0x0002 - 0x0001)
struct M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	bool                                          __BoolProperty;                                    // 0x0001(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000002, "Wrong size on M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedMutableData, __BoolProperty) == 0x000001, "Member 'M_MED_Sharp_Dresser_AnimBP::FAnimBlueprintGeneratedMutableData::__BoolProperty' has a wrong offset!");

}

