#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Base_Commando_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Base_Commando_AnimBlueprint.M_MED_Base_Commando_AnimBlueprint_C
// 0x2AF0 (0x31A0 - 0x06B0)
class UM_MED_Base_Commando_AnimBlueprint_C final : public UCustomCharacterPartAnimInstance_Soldier
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x06B8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06C0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06C8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x06E8(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0708(0x0180)(ContainsInstancedReference)
	uint8                                         Pad_888[0x8];                                      // 0x0888(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x0890(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x0DA0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x12B0(0x0510)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x17C0(0x0128)()
	uint8                                         Pad_18E8[0x8];                                     // 0x18E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x18F0(0x0980)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x2270(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x2378(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x2480(0x0108)()
	uint8                                         Pad_2588[0x8];                                     // 0x2588(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x2590(0x0980)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x2F10(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x3038(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x3160(0x0020)()
	float                                         NewVar_0;                                          // 0x3180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewVar_1;                                          // 0x3184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewVar_2;                                          // 0x3188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewVar_3;                                          // 0x318C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewVar_4;                                          // 0x3190(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         jump_alpha;                                        // 0x3194(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         crouching_alpha;                                   // 0x3198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewVar_5;                                          // 0x319C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_M_MED_Base_Commando_AnimBlueprint(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Base_Commando_AnimBlueprint_C">();
	}
	static class UM_MED_Base_Commando_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Base_Commando_AnimBlueprint_C>();
	}
};
static_assert(alignof(UM_MED_Base_Commando_AnimBlueprint_C) == 0x000010, "Wrong alignment on UM_MED_Base_Commando_AnimBlueprint_C");
static_assert(sizeof(UM_MED_Base_Commando_AnimBlueprint_C) == 0x0031A0, "Wrong size on UM_MED_Base_Commando_AnimBlueprint_C");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, UberGraphFrame) == 0x0006B0, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x0006B8, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, AnimBlueprintExtension_Base) == 0x0006C0, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, AnimGraphNode_Root) == 0x0006C8, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x0006E8, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, AnimGraphNode_CopyPoseFromMesh) == 0x000708, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, AnimGraphNode_AnimDynamics_2) == 0x000890, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, AnimGraphNode_AnimDynamics_1) == 0x000DA0, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, AnimGraphNode_AnimDynamics) == 0x0012B0, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, AnimGraphNode_ModifyBone_2) == 0x0017C0, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, AnimGraphNode_RigidBody_1) == 0x0018F0, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, AnimGraphNode_Constraint_2) == 0x002270, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, AnimGraphNode_Constraint_1) == 0x002378, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, AnimGraphNode_Constraint) == 0x002480, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, AnimGraphNode_RigidBody) == 0x002590, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, AnimGraphNode_ModifyBone_1) == 0x002F10, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, AnimGraphNode_ModifyBone) == 0x003038, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x003160, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, NewVar_0) == 0x003180, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, NewVar_1) == 0x003184, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::NewVar_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, NewVar_2) == 0x003188, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::NewVar_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, NewVar_3) == 0x00318C, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::NewVar_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, NewVar_4) == 0x003190, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::NewVar_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, jump_alpha) == 0x003194, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::jump_alpha' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, crouching_alpha) == 0x003198, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::crouching_alpha' has a wrong offset!");
static_assert(offsetof(UM_MED_Base_Commando_AnimBlueprint_C, NewVar_5) == 0x00319C, "Member 'UM_MED_Base_Commando_AnimBlueprint_C::NewVar_5' has a wrong offset!");

}

