#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Male_Commando_Pizza_Pit_Dyn_AnimBp

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Male_Commando_Pizza_Pit_Dyn_AnimBp.Male_Commando_Pizza_Pit_Dyn_AnimBp_C.AnimBlueprintGeneratedConstantData
// 0x00BF (0x00C0 - 0x0001)
struct Male_Commando_Pizza_Pit_Dyn_AnimBp::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_10;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_11;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_12;                               // 0x0010(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0028(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00A8(0x0018)()
};
static_assert(alignof(Male_Commando_Pizza_Pit_Dyn_AnimBp::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Male_Commando_Pizza_Pit_Dyn_AnimBp::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Male_Commando_Pizza_Pit_Dyn_AnimBp::FAnimBlueprintGeneratedConstantData) == 0x0000C0, "Wrong size on Male_Commando_Pizza_Pit_Dyn_AnimBp::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Male_Commando_Pizza_Pit_Dyn_AnimBp::FAnimBlueprintGeneratedConstantData, __NameProperty_10) == 0x000004, "Member 'Male_Commando_Pizza_Pit_Dyn_AnimBp::FAnimBlueprintGeneratedConstantData::__NameProperty_10' has a wrong offset!");
static_assert(offsetof(Male_Commando_Pizza_Pit_Dyn_AnimBp::FAnimBlueprintGeneratedConstantData, __NameProperty_11) == 0x000008, "Member 'Male_Commando_Pizza_Pit_Dyn_AnimBp::FAnimBlueprintGeneratedConstantData::__NameProperty_11' has a wrong offset!");
static_assert(offsetof(Male_Commando_Pizza_Pit_Dyn_AnimBp::FAnimBlueprintGeneratedConstantData, __StructProperty_12) == 0x000010, "Member 'Male_Commando_Pizza_Pit_Dyn_AnimBp::FAnimBlueprintGeneratedConstantData::__StructProperty_12' has a wrong offset!");
static_assert(offsetof(Male_Commando_Pizza_Pit_Dyn_AnimBp::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000028, "Member 'Male_Commando_Pizza_Pit_Dyn_AnimBp::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Male_Commando_Pizza_Pit_Dyn_AnimBp::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000A8, "Member 'Male_Commando_Pizza_Pit_Dyn_AnimBp::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Male_Commando_Pizza_Pit_Dyn_AnimBp.Male_Commando_Pizza_Pit_Dyn_AnimBp_C.AnimBlueprintGeneratedMutableData
// 0x0000 (0x0001 - 0x0001)
struct Male_Commando_Pizza_Pit_Dyn_AnimBp::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
};
static_assert(alignof(Male_Commando_Pizza_Pit_Dyn_AnimBp::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on Male_Commando_Pizza_Pit_Dyn_AnimBp::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Male_Commando_Pizza_Pit_Dyn_AnimBp::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong size on Male_Commando_Pizza_Pit_Dyn_AnimBp::FAnimBlueprintGeneratedMutableData");

}

