#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Male_Commando_Pizza_Pit_Dyn_AnimBp

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Male_Commando_Pizza_Pit_Dyn_AnimBp.Male_Commando_Pizza_Pit_Dyn_AnimBp_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct Male_Commando_Pizza_Pit_Dyn_AnimBp_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Male_Commando_Pizza_Pit_Dyn_AnimBp_C_AnimGraph) == 0x000008, "Wrong alignment on Male_Commando_Pizza_Pit_Dyn_AnimBp_C_AnimGraph");
static_assert(sizeof(Male_Commando_Pizza_Pit_Dyn_AnimBp_C_AnimGraph) == 0x000020, "Wrong size on Male_Commando_Pizza_Pit_Dyn_AnimBp_C_AnimGraph");
static_assert(offsetof(Male_Commando_Pizza_Pit_Dyn_AnimBp_C_AnimGraph, InPose) == 0x000000, "Member 'Male_Commando_Pizza_Pit_Dyn_AnimBp_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(Male_Commando_Pizza_Pit_Dyn_AnimBp_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'Male_Commando_Pizza_Pit_Dyn_AnimBp_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function Male_Commando_Pizza_Pit_Dyn_AnimBp.Male_Commando_Pizza_Pit_Dyn_AnimBp_C.ExecuteUbergraph_Male_Commando_Pizza_Pit_Dyn_AnimBp
// 0x0010 (0x0010 - 0x0000)
struct Male_Commando_Pizza_Pit_Dyn_AnimBp_C_ExecuteUbergraph_Male_Commando_Pizza_Pit_Dyn_AnimBp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Male_Commando_Pizza_Pit_Dyn_AnimBp_C_ExecuteUbergraph_Male_Commando_Pizza_Pit_Dyn_AnimBp) == 0x000008, "Wrong alignment on Male_Commando_Pizza_Pit_Dyn_AnimBp_C_ExecuteUbergraph_Male_Commando_Pizza_Pit_Dyn_AnimBp");
static_assert(sizeof(Male_Commando_Pizza_Pit_Dyn_AnimBp_C_ExecuteUbergraph_Male_Commando_Pizza_Pit_Dyn_AnimBp) == 0x000010, "Wrong size on Male_Commando_Pizza_Pit_Dyn_AnimBp_C_ExecuteUbergraph_Male_Commando_Pizza_Pit_Dyn_AnimBp");
static_assert(offsetof(Male_Commando_Pizza_Pit_Dyn_AnimBp_C_ExecuteUbergraph_Male_Commando_Pizza_Pit_Dyn_AnimBp, EntryPoint) == 0x000000, "Member 'Male_Commando_Pizza_Pit_Dyn_AnimBp_C_ExecuteUbergraph_Male_Commando_Pizza_Pit_Dyn_AnimBp::EntryPoint' has a wrong offset!");
static_assert(offsetof(Male_Commando_Pizza_Pit_Dyn_AnimBp_C_ExecuteUbergraph_Male_Commando_Pizza_Pit_Dyn_AnimBp, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x000008, "Member 'Male_Commando_Pizza_Pit_Dyn_AnimBp_C_ExecuteUbergraph_Male_Commando_Pizza_Pit_Dyn_AnimBp::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");

}

