#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MountedTurret_Gunner_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MountedTurret_Gunner_AnimBP.MountedTurret_Gunner_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct MountedTurret_Gunner_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(MountedTurret_Gunner_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on MountedTurret_Gunner_AnimBP_C_AnimGraph");
static_assert(sizeof(MountedTurret_Gunner_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on MountedTurret_Gunner_AnimBP_C_AnimGraph");
static_assert(offsetof(MountedTurret_Gunner_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'MountedTurret_Gunner_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function MountedTurret_Gunner_AnimBP.MountedTurret_Gunner_AnimBP_C.ExecuteUbergraph_MountedTurret_Gunner_AnimBP
// 0x000C (0x000C - 0x0000)
struct MountedTurret_Gunner_AnimBP_C_ExecuteUbergraph_MountedTurret_Gunner_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MountedTurret_Gunner_AnimBP_C_ExecuteUbergraph_MountedTurret_Gunner_AnimBP) == 0x000004, "Wrong alignment on MountedTurret_Gunner_AnimBP_C_ExecuteUbergraph_MountedTurret_Gunner_AnimBP");
static_assert(sizeof(MountedTurret_Gunner_AnimBP_C_ExecuteUbergraph_MountedTurret_Gunner_AnimBP) == 0x00000C, "Wrong size on MountedTurret_Gunner_AnimBP_C_ExecuteUbergraph_MountedTurret_Gunner_AnimBP");
static_assert(offsetof(MountedTurret_Gunner_AnimBP_C_ExecuteUbergraph_MountedTurret_Gunner_AnimBP, EntryPoint) == 0x000000, "Member 'MountedTurret_Gunner_AnimBP_C_ExecuteUbergraph_MountedTurret_Gunner_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(MountedTurret_Gunner_AnimBP_C_ExecuteUbergraph_MountedTurret_Gunner_AnimBP, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'MountedTurret_Gunner_AnimBP_C_ExecuteUbergraph_MountedTurret_Gunner_AnimBP::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MountedTurret_Gunner_AnimBP_C_ExecuteUbergraph_MountedTurret_Gunner_AnimBP, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000008, "Member 'MountedTurret_Gunner_AnimBP_C_ExecuteUbergraph_MountedTurret_Gunner_AnimBP::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");

}

