#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MountedCannon__v2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MountedTurret_classes.hpp"
#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MountedCannon__v2.MountedCannon__v2_C
// 0x0140 (0x1DF0 - 0x1CB0)
class AMountedCannon__v2_C final : public AMountedTurret_C
{
public:
	uint8                                         Pad_1CA1[0x7];                                     // 0x1CA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_MountedCannon__v2_C;                // 0x1CA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x1CB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortVehicleNavModifierComponent*       FortVehicleNavModifier;                            // 0x1CB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      OverHeat_Muzzle;                                   // 0x1CC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_OverheatingVents;                               // 0x1CC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   MapMarkerColors;                                   // 0x1CD0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        MapMarkerLocations;                                // 0x1CE0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                        ComputedAimVectors;                                // 0x1CF0(0x0010)(Edit, BlueprintVisible)
	struct FScalableFloat                         DefaultPlayerLaunchSpeed;                          // 0x1D00(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         LaunchedPlayerGravityMultiplier;                   // 0x1D28(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 SpawnableTargetRingClass;                          // 0x1D50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             PlayerMountSFX;                                    // 0x1D58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             PlayerDismountSFX;                                 // 0x1D60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         DestructionFX;                                     // 0x1D68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Resolve_MountedCannonAthena_C*       CannonWeapon;                                      // 0x1D70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           PlayerEnterSecondaryFire;                          // 0x1D78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CannonEnterSecondaryFire;                          // 0x1D80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CannonSecondaryFire;                               // 0x1D88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         FirePlayerMuzzleVFX;                               // 0x1D90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           PlayerExitSecondaryFire;                           // 0x1D98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CannonExitSecondaryFire;                           // 0x1DA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Damaged;                                        // 0x1DA8(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CurrentlyTargeting;                                // 0x1DAC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DAD[0x3];                                     // 0x1DAD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           OverheatPostExitTimer;                             // 0x1DB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         CannonDeathCameraShakeRadius;                      // 0x1DB8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           CannonDeathCamShakeCue;                            // 0x1DE0(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyDeathCameraShake();
	void CheckEndOverheatVFX();
	void ClearPingTargetData();
	void EventOnCannonFired(class AFortWeapon* Weapon);
	void ExecuteUbergraph_MountedCannon__v2(int32 EntryPoint);
	void Get_Turret_Weapon();
	void OnBlendOut_5944C4BB4ED8F786896504B21F802424(class FName NotifyName);
	void OnBlendOut_5DAE499B40B725099BE740A84C575457(class FName NotifyName);
	void OnBlendOut_62396D4C464212C294D70A8931A3D1C3(class FName NotifyName);
	void OnBlendOut_67D5C315415B8BEF7B842DAE6EEF4DF7(class FName NotifyName);
	void OnBlendOut_734966964A5FBF0E3A3676B014A59517(class FName NotifyName);
	void OnBlendOut_81E6EFB74060B719A52277B436B552C1(class FName NotifyName);
	void OnBlendOut_98B953C64C4BF015432287A051AA883C(class FName NotifyName);
	void OnBlendOut_AE2B0042415D33E96D661EA976B3488C(class FName NotifyName);
	void OnCompleted_5944C4BB4ED8F786896504B21F802424(class FName NotifyName);
	void OnCompleted_5DAE499B40B725099BE740A84C575457(class FName NotifyName);
	void OnCompleted_62396D4C464212C294D70A8931A3D1C3(class FName NotifyName);
	void OnCompleted_67D5C315415B8BEF7B842DAE6EEF4DF7(class FName NotifyName);
	void OnCompleted_734966964A5FBF0E3A3676B014A59517(class FName NotifyName);
	void OnCompleted_81E6EFB74060B719A52277B436B552C1(class FName NotifyName);
	void OnCompleted_98B953C64C4BF015432287A051AA883C(class FName NotifyName);
	void OnCompleted_AE2B0042415D33E96D661EA976B3488C(class FName NotifyName);
	void OnDamagePlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnDeathPlayEffects(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AFortPawn* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void OnGetExitSocketTransform(const class FName ExitSocket, const int32 SocketIndex, const struct FTransform& InTransform, bool* bOutOverriderExitSocket, struct FTransform* OutOverrideTransform);
	void OnInterrupted_5944C4BB4ED8F786896504B21F802424(class FName NotifyName);
	void OnInterrupted_5DAE499B40B725099BE740A84C575457(class FName NotifyName);
	void OnInterrupted_62396D4C464212C294D70A8931A3D1C3(class FName NotifyName);
	void OnInterrupted_67D5C315415B8BEF7B842DAE6EEF4DF7(class FName NotifyName);
	void OnInterrupted_734966964A5FBF0E3A3676B014A59517(class FName NotifyName);
	void OnInterrupted_81E6EFB74060B719A52277B436B552C1(class FName NotifyName);
	void OnInterrupted_98B953C64C4BF015432287A051AA883C(class FName NotifyName);
	void OnInterrupted_AE2B0042415D33E96D661EA976B3488C(class FName NotifyName);
	void OnMapMarkersChanged();
	void OnNotifyBegin_5944C4BB4ED8F786896504B21F802424(class FName NotifyName);
	void OnNotifyBegin_5DAE499B40B725099BE740A84C575457(class FName NotifyName);
	void OnNotifyBegin_62396D4C464212C294D70A8931A3D1C3(class FName NotifyName);
	void OnNotifyBegin_67D5C315415B8BEF7B842DAE6EEF4DF7(class FName NotifyName);
	void OnNotifyBegin_734966964A5FBF0E3A3676B014A59517(class FName NotifyName);
	void OnNotifyBegin_81E6EFB74060B719A52277B436B552C1(class FName NotifyName);
	void OnNotifyBegin_98B953C64C4BF015432287A051AA883C(class FName NotifyName);
	void OnNotifyBegin_AE2B0042415D33E96D661EA976B3488C(class FName NotifyName);
	void OnNotifyEnd_5944C4BB4ED8F786896504B21F802424(class FName NotifyName);
	void OnNotifyEnd_5DAE499B40B725099BE740A84C575457(class FName NotifyName);
	void OnNotifyEnd_62396D4C464212C294D70A8931A3D1C3(class FName NotifyName);
	void OnNotifyEnd_67D5C315415B8BEF7B842DAE6EEF4DF7(class FName NotifyName);
	void OnNotifyEnd_734966964A5FBF0E3A3676B014A59517(class FName NotifyName);
	void OnNotifyEnd_81E6EFB74060B719A52277B436B552C1(class FName NotifyName);
	void OnNotifyEnd_98B953C64C4BF015432287A051AA883C(class FName NotifyName);
	void OnNotifyEnd_AE2B0042415D33E96D661EA976B3488C(class FName NotifyName);
	void OnPawnEnterVehicle(class AFortPlayerPawn* PlayerPawn, const int32 SeatIdx);
	void OnPawnExitVehicle(class AFortPlayerPawn* PlayerPawn, class FName ExitSocketName);
	void OnTargetingChange(bool bIsTargeting);
	void OnTargetOutOfRange(int32 Index_0);
	void OverheatValueUpdated(float CurrentValue, float MaxValue, EFortWeaponOverheatState State, bool bIsInCooldown);
	void PlayDeathEffects();
	void PlayLaunchPawnCosmetics();
	void ReceiveBeginPlay();
	void ReleaseBalloons(class AFortPlayerPawn* FortPlayerPawn);
	void UpdateMapMarkerTargets();

	bool ShouldShowActionLabelAtIndex(const int32 Index_0, TArray<class FName>& SeatActionNames, TArray<class FText>& SeatActionLabels) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MountedCannon__v2_C">();
	}
	static class AMountedCannon__v2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMountedCannon__v2_C>();
	}
};
static_assert(alignof(AMountedCannon__v2_C) == 0x000010, "Wrong alignment on AMountedCannon__v2_C");
static_assert(sizeof(AMountedCannon__v2_C) == 0x001DF0, "Wrong size on AMountedCannon__v2_C");
static_assert(offsetof(AMountedCannon__v2_C, UberGraphFrame_MountedCannon__v2_C) == 0x001CA8, "Member 'AMountedCannon__v2_C::UberGraphFrame_MountedCannon__v2_C' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, Box) == 0x001CB0, "Member 'AMountedCannon__v2_C::Box' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, FortVehicleNavModifier) == 0x001CB8, "Member 'AMountedCannon__v2_C::FortVehicleNavModifier' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, OverHeat_Muzzle) == 0x001CC0, "Member 'AMountedCannon__v2_C::OverHeat_Muzzle' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, NS_OverheatingVents) == 0x001CC8, "Member 'AMountedCannon__v2_C::NS_OverheatingVents' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, MapMarkerColors) == 0x001CD0, "Member 'AMountedCannon__v2_C::MapMarkerColors' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, MapMarkerLocations) == 0x001CE0, "Member 'AMountedCannon__v2_C::MapMarkerLocations' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, ComputedAimVectors) == 0x001CF0, "Member 'AMountedCannon__v2_C::ComputedAimVectors' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, DefaultPlayerLaunchSpeed) == 0x001D00, "Member 'AMountedCannon__v2_C::DefaultPlayerLaunchSpeed' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, LaunchedPlayerGravityMultiplier) == 0x001D28, "Member 'AMountedCannon__v2_C::LaunchedPlayerGravityMultiplier' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, SpawnableTargetRingClass) == 0x001D50, "Member 'AMountedCannon__v2_C::SpawnableTargetRingClass' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, PlayerMountSFX) == 0x001D58, "Member 'AMountedCannon__v2_C::PlayerMountSFX' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, PlayerDismountSFX) == 0x001D60, "Member 'AMountedCannon__v2_C::PlayerDismountSFX' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, DestructionFX) == 0x001D68, "Member 'AMountedCannon__v2_C::DestructionFX' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, CannonWeapon) == 0x001D70, "Member 'AMountedCannon__v2_C::CannonWeapon' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, PlayerEnterSecondaryFire) == 0x001D78, "Member 'AMountedCannon__v2_C::PlayerEnterSecondaryFire' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, CannonEnterSecondaryFire) == 0x001D80, "Member 'AMountedCannon__v2_C::CannonEnterSecondaryFire' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, CannonSecondaryFire) == 0x001D88, "Member 'AMountedCannon__v2_C::CannonSecondaryFire' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, FirePlayerMuzzleVFX) == 0x001D90, "Member 'AMountedCannon__v2_C::FirePlayerMuzzleVFX' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, PlayerExitSecondaryFire) == 0x001D98, "Member 'AMountedCannon__v2_C::PlayerExitSecondaryFire' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, CannonExitSecondaryFire) == 0x001DA0, "Member 'AMountedCannon__v2_C::CannonExitSecondaryFire' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, GC_Damaged) == 0x001DA8, "Member 'AMountedCannon__v2_C::GC_Damaged' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, CurrentlyTargeting) == 0x001DAC, "Member 'AMountedCannon__v2_C::CurrentlyTargeting' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, OverheatPostExitTimer) == 0x001DB0, "Member 'AMountedCannon__v2_C::OverheatPostExitTimer' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, CannonDeathCameraShakeRadius) == 0x001DB8, "Member 'AMountedCannon__v2_C::CannonDeathCameraShakeRadius' has a wrong offset!");
static_assert(offsetof(AMountedCannon__v2_C, CannonDeathCamShakeCue) == 0x001DE0, "Member 'AMountedCannon__v2_C::CannonDeathCamShakeCue' has a wrong offset!");

}

