#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_LayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function NPC_LayerAnimBP.NPC_LayerAnimBP_C.FullBodyOverride
// 0x0020 (0x0020 - 0x0000)
struct NPC_LayerAnimBP_C_FullBodyOverride final
{
public:
	struct FPoseLink                              PassThroughFullBodyPose;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FullBodyOverride_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NPC_LayerAnimBP_C_FullBodyOverride) == 0x000008, "Wrong alignment on NPC_LayerAnimBP_C_FullBodyOverride");
static_assert(sizeof(NPC_LayerAnimBP_C_FullBodyOverride) == 0x000020, "Wrong size on NPC_LayerAnimBP_C_FullBodyOverride");
static_assert(offsetof(NPC_LayerAnimBP_C_FullBodyOverride, PassThroughFullBodyPose) == 0x000000, "Member 'NPC_LayerAnimBP_C_FullBodyOverride::PassThroughFullBodyPose' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP_C_FullBodyOverride, FullBodyOverride_0) == 0x000010, "Member 'NPC_LayerAnimBP_C_FullBodyOverride::FullBodyOverride_0' has a wrong offset!");

// Function NPC_LayerAnimBP.NPC_LayerAnimBP_C.ExecuteUbergraph_NPC_LayerAnimBP
// 0x0018 (0x0018 - 0x0000)
struct NPC_LayerAnimBP_C_ExecuteUbergraph_NPC_LayerAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UFortAnimInputEvent*              K2Node_Event_AnimInputEvent;                       // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNamed_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNamed_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNamed_ReturnValue_2;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNamed_ReturnValue_3;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_LayerAnimBP_C_ExecuteUbergraph_NPC_LayerAnimBP) == 0x000008, "Wrong alignment on NPC_LayerAnimBP_C_ExecuteUbergraph_NPC_LayerAnimBP");
static_assert(sizeof(NPC_LayerAnimBP_C_ExecuteUbergraph_NPC_LayerAnimBP) == 0x000018, "Wrong size on NPC_LayerAnimBP_C_ExecuteUbergraph_NPC_LayerAnimBP");
static_assert(offsetof(NPC_LayerAnimBP_C_ExecuteUbergraph_NPC_LayerAnimBP, EntryPoint) == 0x000000, "Member 'NPC_LayerAnimBP_C_ExecuteUbergraph_NPC_LayerAnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP_C_ExecuteUbergraph_NPC_LayerAnimBP, K2Node_Event_AnimInputEvent) == 0x000008, "Member 'NPC_LayerAnimBP_C_ExecuteUbergraph_NPC_LayerAnimBP::K2Node_Event_AnimInputEvent' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP_C_ExecuteUbergraph_NPC_LayerAnimBP, CallFunc_IsNamed_ReturnValue) == 0x000010, "Member 'NPC_LayerAnimBP_C_ExecuteUbergraph_NPC_LayerAnimBP::CallFunc_IsNamed_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP_C_ExecuteUbergraph_NPC_LayerAnimBP, CallFunc_IsNamed_ReturnValue_1) == 0x000011, "Member 'NPC_LayerAnimBP_C_ExecuteUbergraph_NPC_LayerAnimBP::CallFunc_IsNamed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP_C_ExecuteUbergraph_NPC_LayerAnimBP, CallFunc_IsNamed_ReturnValue_2) == 0x000012, "Member 'NPC_LayerAnimBP_C_ExecuteUbergraph_NPC_LayerAnimBP::CallFunc_IsNamed_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP_C_ExecuteUbergraph_NPC_LayerAnimBP, CallFunc_IsNamed_ReturnValue_3) == 0x000013, "Member 'NPC_LayerAnimBP_C_ExecuteUbergraph_NPC_LayerAnimBP::CallFunc_IsNamed_ReturnValue_3' has a wrong offset!");

// Function NPC_LayerAnimBP.NPC_LayerAnimBP_C.CharacterSkeletalControlPostLegIK
// 0x0020 (0x0020 - 0x0000)
struct NPC_LayerAnimBP_C_CharacterSkeletalControlPostLegIK final
{
public:
	struct FPoseLink                              InPosePostLegIK;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              CharacterSkeletalControlPostLegIK_0;               // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NPC_LayerAnimBP_C_CharacterSkeletalControlPostLegIK) == 0x000008, "Wrong alignment on NPC_LayerAnimBP_C_CharacterSkeletalControlPostLegIK");
static_assert(sizeof(NPC_LayerAnimBP_C_CharacterSkeletalControlPostLegIK) == 0x000020, "Wrong size on NPC_LayerAnimBP_C_CharacterSkeletalControlPostLegIK");
static_assert(offsetof(NPC_LayerAnimBP_C_CharacterSkeletalControlPostLegIK, InPosePostLegIK) == 0x000000, "Member 'NPC_LayerAnimBP_C_CharacterSkeletalControlPostLegIK::InPosePostLegIK' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP_C_CharacterSkeletalControlPostLegIK, CharacterSkeletalControlPostLegIK_0) == 0x000010, "Member 'NPC_LayerAnimBP_C_CharacterSkeletalControlPostLegIK::CharacterSkeletalControlPostLegIK_0' has a wrong offset!");

// Function NPC_LayerAnimBP.NPC_LayerAnimBP_C.BlueprintProcessAnimInputEvent
// 0x0008 (0x0008 - 0x0000)
struct NPC_LayerAnimBP_C_BlueprintProcessAnimInputEvent final
{
public:
	const class UFortAnimInputEvent*              AnimInputEvent;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPC_LayerAnimBP_C_BlueprintProcessAnimInputEvent) == 0x000008, "Wrong alignment on NPC_LayerAnimBP_C_BlueprintProcessAnimInputEvent");
static_assert(sizeof(NPC_LayerAnimBP_C_BlueprintProcessAnimInputEvent) == 0x000008, "Wrong size on NPC_LayerAnimBP_C_BlueprintProcessAnimInputEvent");
static_assert(offsetof(NPC_LayerAnimBP_C_BlueprintProcessAnimInputEvent, AnimInputEvent) == 0x000000, "Member 'NPC_LayerAnimBP_C_BlueprintProcessAnimInputEvent::AnimInputEvent' has a wrong offset!");

// Function NPC_LayerAnimBP.NPC_LayerAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct NPC_LayerAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(NPC_LayerAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on NPC_LayerAnimBP_C_AnimGraph");
static_assert(sizeof(NPC_LayerAnimBP_C_AnimGraph) == 0x000010, "Wrong size on NPC_LayerAnimBP_C_AnimGraph");
static_assert(offsetof(NPC_LayerAnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'NPC_LayerAnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

