#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_LayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct NPC_LayerAnimBP.NPC_LayerAnimBP_C.AnimBlueprintGeneratedMutableData
// 0x0000 (0x0001 - 0x0001)
struct NPC_LayerAnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
};
static_assert(alignof(NPC_LayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on NPC_LayerAnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(NPC_LayerAnimBP::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong size on NPC_LayerAnimBP::FAnimBlueprintGeneratedMutableData");

// ScriptStruct NPC_LayerAnimBP.NPC_LayerAnimBP_C.AnimBlueprintGeneratedConstantData
// 0x016F (0x0170 - 0x0001)
struct NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_167;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_168;                            // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_169;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_170;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_171;                            // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_172;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_173;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_174;                            // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_175;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_176;                                 // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_177;                            // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_178;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_179;                                 // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_180;                            // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_181;                                // 0x0050(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_182;                                 // 0x0054(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_183;                            // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_184;                                // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_185;                               // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_186;                              // 0x0068(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_187;                               // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_188;                            // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_189;                                // 0x00A0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_190;                                // 0x00A1(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_191;                                // 0x00A2(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_192;                                // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_193;                                 // 0x00A8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_194;                                // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_195;                                // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_196;                              // 0x00B8(0x0018)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_197;                                // 0x00D0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_198;                                // 0x00D4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x00D8(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x0158(0x0018)()
};
static_assert(alignof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData) == 0x000170, "Wrong size on NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_167) == 0x000004, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_167' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_168) == 0x000008, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_168' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_169) == 0x000010, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_169' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_170) == 0x000014, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_170' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_171) == 0x000018, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_171' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_172) == 0x000020, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_172' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_173) == 0x000024, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_173' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_174) == 0x000028, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_174' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_175) == 0x000030, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_175' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_176) == 0x000034, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_176' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_177) == 0x000038, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_177' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_178) == 0x000040, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_178' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_179) == 0x000044, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_179' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_180) == 0x000048, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_180' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_181) == 0x000050, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_181' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_182) == 0x000054, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_182' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_183) == 0x000058, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_183' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_184) == 0x000060, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_184' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_185) == 0x000064, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_185' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_186) == 0x000068, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_186' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_187) == 0x000094, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_187' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_188) == 0x000098, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_188' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_189) == 0x0000A0, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_189' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_190) == 0x0000A1, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_190' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_191) == 0x0000A2, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_191' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_192) == 0x0000A4, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_192' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_193) == 0x0000A8, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_193' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_194) == 0x0000AC, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_194' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_195) == 0x0000B0, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_195' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_196) == 0x0000B8, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_196' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_197) == 0x0000D0, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_197' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_198) == 0x0000D4, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_198' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x0000D8, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x000158, "Member 'NPC_LayerAnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

