#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_LayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass NPC_LayerAnimBP.NPC_LayerAnimBP_C
// 0x0AD0 (0x0EC0 - 0x03F0)
class UNPC_LayerAnimBP_C final : public UFortBaseLayerAnimInstance
{
public:
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03F8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0400(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0408(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0428(0x00C0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x04E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0510(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0538(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0560(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0588(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x05B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x05D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0600(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0628(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0668(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0688(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x06C8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x06E8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0728(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0748(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0788(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x07A8(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x07E8(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0808(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x08D0(0x0040)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0910(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0950(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0970(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0A28(0x0100)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0B28(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0C50(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0D78(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0D98(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0DB8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0DD8(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0E98(0x0020)()
	bool                                          IsConversationStarting;                            // 0x0EB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsConversationEnding;                              // 0x0EB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGivingItem;                                      // 0x0EBA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsReceivingItem;                                   // 0x0EBB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void FullBodyOverride(const struct FPoseLink& PassThroughFullBodyPose, struct FPoseLink* FullBodyOverride_0);
	void ExecuteUbergraph_NPC_LayerAnimBP(int32 EntryPoint);
	void CharacterSkeletalControlPostLegIK(const struct FPoseLink& InPosePostLegIK, struct FPoseLink* CharacterSkeletalControlPostLegIK_0);
	void BlueprintProcessAnimInputEvent(const class UFortAnimInputEvent* AnimInputEvent);
	void BlueprintPostEvaluateAnimation();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_LayerAnimBP_C">();
	}
	static class UNPC_LayerAnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPC_LayerAnimBP_C>();
	}
};
static_assert(alignof(UNPC_LayerAnimBP_C) == 0x000010, "Wrong alignment on UNPC_LayerAnimBP_C");
static_assert(sizeof(UNPC_LayerAnimBP_C) == 0x000EC0, "Wrong size on UNPC_LayerAnimBP_C");
static_assert(offsetof(UNPC_LayerAnimBP_C, UberGraphFrame) == 0x0003F0, "Member 'UNPC_LayerAnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x0003F8, "Member 'UNPC_LayerAnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimBlueprintExtension_Base) == 0x000400, "Member 'UNPC_LayerAnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_Root_2) == 0x000408, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_Root_2' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_LinkedInputPose_1) == 0x000428, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_LinkedInputPose_1' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_TransitionResult_7) == 0x0004E8, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_TransitionResult_6) == 0x000510, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_TransitionResult_5) == 0x000538, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_TransitionResult_4) == 0x000560, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_TransitionResult_3) == 0x000588, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_TransitionResult_2) == 0x0005B0, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_TransitionResult_1) == 0x0005D8, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_TransitionResult) == 0x000600, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_SequencePlayer_6) == 0x000628, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_StateResult_5) == 0x000668, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_SequencePlayer_5) == 0x000688, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_StateResult_4) == 0x0006C8, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_SequencePlayer_4) == 0x0006E8, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_StateResult_3) == 0x000728, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_SequencePlayer_3) == 0x000748, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_StateResult_2) == 0x000788, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_SequencePlayer_2) == 0x0007A8, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_StateResult_1) == 0x0007E8, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_ApplyAdditive) == 0x000808, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_ApplyAdditive' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_SequencePlayer_1) == 0x0008D0, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_SequencePlayer) == 0x000910, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_StateResult) == 0x000950, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_StateMachine) == 0x000970, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_SaveCachedPose) == 0x000A28, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_ModifyBone_1) == 0x000B28, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_ModifyBone) == 0x000C50, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000D78, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000D98, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_Root_1) == 0x000DB8, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_LinkedInputPose) == 0x000DD8, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, AnimGraphNode_Root) == 0x000E98, "Member 'UNPC_LayerAnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, IsConversationStarting) == 0x000EB8, "Member 'UNPC_LayerAnimBP_C::IsConversationStarting' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, IsConversationEnding) == 0x000EB9, "Member 'UNPC_LayerAnimBP_C::IsConversationEnding' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, IsGivingItem) == 0x000EBA, "Member 'UNPC_LayerAnimBP_C::IsGivingItem' has a wrong offset!");
static_assert(offsetof(UNPC_LayerAnimBP_C, IsReceivingItem) == 0x000EBB, "Member 'UNPC_LayerAnimBP_C::IsReceivingItem' has a wrong offset!");

}

