#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCLoopStateComponent

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function NPCLoopStateComponent.NPCLoopStateComponent_C.InitLoopState
// 0x0008 (0x0008 - 0x0000)
struct NPCLoopStateComponent_C_InitLoopState final
{
public:
	class AFortPawn*                              PawnOwner;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPCLoopStateComponent_C_InitLoopState) == 0x000008, "Wrong alignment on NPCLoopStateComponent_C_InitLoopState");
static_assert(sizeof(NPCLoopStateComponent_C_InitLoopState) == 0x000008, "Wrong size on NPCLoopStateComponent_C_InitLoopState");
static_assert(offsetof(NPCLoopStateComponent_C_InitLoopState, PawnOwner) == 0x000000, "Member 'NPCLoopStateComponent_C_InitLoopState::PawnOwner' has a wrong offset!");

// Function NPCLoopStateComponent.NPCLoopStateComponent_C.ExecuteUbergraph_NPCLoopStateComponent
// 0x0058 (0x0058 - 0x0000)
struct NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_Event_PawnOwner;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerState*                       K2Node_DynamicCast_AsFort_Player_State;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0034(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerState*                       K2Node_DynamicCast_AsFort_Player_State_1;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x004C(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent) == 0x000008, "Wrong alignment on NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent");
static_assert(sizeof(NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent) == 0x000058, "Wrong size on NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent");
static_assert(offsetof(NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent, EntryPoint) == 0x000000, "Member 'NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000010, "Member 'NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent, CallFunc_HasAuthority_ReturnValue) == 0x00001A, "Member 'NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent, CallFunc_HasAuthority_ReturnValue_1) == 0x00001B, "Member 'NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent, K2Node_Event_PawnOwner) == 0x000020, "Member 'NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent::K2Node_Event_PawnOwner' has a wrong offset!");
static_assert(offsetof(NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent, K2Node_DynamicCast_AsFort_Player_State) == 0x000028, "Member 'NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent::K2Node_DynamicCast_AsFort_Player_State' has a wrong offset!");
static_assert(offsetof(NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000034, "Member 'NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent, K2Node_DynamicCast_AsFort_Player_State_1) == 0x000040, "Member 'NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent::K2Node_DynamicCast_AsFort_Player_State_1' has a wrong offset!");
static_assert(offsetof(NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1) == 0x00004C, "Member 'NPCLoopStateComponent_C_ExecuteUbergraph_NPCLoopStateComponent::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1' has a wrong offset!");

}

