#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCService_Player_PropDisguise

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "FNBR_Player_Prop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPCService_Player_PropDisguise.NPCService_Player_PropDisguise_C
// 0x0080 (0x0C80 - 0x0C00)
class ANPCService_Player_PropDisguise_C final : public AFNBR_Player_Prop_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_NPCService_Player_PropDisguise_C;   // 0x0C00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortDataDrivenPossessedPropInputComponent* FortDataDrivenPossessedPropInput;                  // 0x0C08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  PossessedPropMakeNoiseTag;                         // 0x0C10(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  PossessedPropTag;                                  // 0x0C30(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  PossessedPropPlacedTag;                            // 0x0C50(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          AllowPropPlacementAbility;                         // 0x0C70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C71[0x3];                                      // 0x0C71(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinPropPossessionTime;                             // 0x0C74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateHealth();
	void SetMaxHealth(float NewMaxHealth);
	void ExecuteUbergraph_NPCService_Player_PropDisguise(int32 EntryPoint);
	void End_Prop_Possession();
	void DoPawnRelatedInitialization();
	void BndEvt__FortDataDrivenPossessedPropInput_K2Node_ComponentBoundEvent_5_OnCreativeInput__DelegateSignature();
	void BndEvt__FortDataDrivenPossessedPropInput_K2Node_ComponentBoundEvent_2_OnCreativeInput__DelegateSignature();
	void BndEvt__FortDataDrivenPossessedPropInput_K2Node_ComponentBoundEvent_0_OnCreativeInput__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPCService_Player_PropDisguise_C">();
	}
	static class ANPCService_Player_PropDisguise_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANPCService_Player_PropDisguise_C>();
	}
};
static_assert(alignof(ANPCService_Player_PropDisguise_C) == 0x000010, "Wrong alignment on ANPCService_Player_PropDisguise_C");
static_assert(sizeof(ANPCService_Player_PropDisguise_C) == 0x000C80, "Wrong size on ANPCService_Player_PropDisguise_C");
static_assert(offsetof(ANPCService_Player_PropDisguise_C, UberGraphFrame_NPCService_Player_PropDisguise_C) == 0x000C00, "Member 'ANPCService_Player_PropDisguise_C::UberGraphFrame_NPCService_Player_PropDisguise_C' has a wrong offset!");
static_assert(offsetof(ANPCService_Player_PropDisguise_C, FortDataDrivenPossessedPropInput) == 0x000C08, "Member 'ANPCService_Player_PropDisguise_C::FortDataDrivenPossessedPropInput' has a wrong offset!");
static_assert(offsetof(ANPCService_Player_PropDisguise_C, PossessedPropMakeNoiseTag) == 0x000C10, "Member 'ANPCService_Player_PropDisguise_C::PossessedPropMakeNoiseTag' has a wrong offset!");
static_assert(offsetof(ANPCService_Player_PropDisguise_C, PossessedPropTag) == 0x000C30, "Member 'ANPCService_Player_PropDisguise_C::PossessedPropTag' has a wrong offset!");
static_assert(offsetof(ANPCService_Player_PropDisguise_C, PossessedPropPlacedTag) == 0x000C50, "Member 'ANPCService_Player_PropDisguise_C::PossessedPropPlacedTag' has a wrong offset!");
static_assert(offsetof(ANPCService_Player_PropDisguise_C, AllowPropPlacementAbility) == 0x000C70, "Member 'ANPCService_Player_PropDisguise_C::AllowPropPlacementAbility' has a wrong offset!");
static_assert(offsetof(ANPCService_Player_PropDisguise_C, MinPropPossessionTime) == 0x000C74, "Member 'ANPCService_Player_PropDisguise_C::MinPropPossessionTime' has a wrong offset!");

}

