#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPCService_Player_PropDisguise

#include "Basic.hpp"


namespace SDK::Params
{

// Function NPCService_Player_PropDisguise.NPCService_Player_PropDisguise_C.SetMaxHealth
// 0x0004 (0x0004 - 0x0000)
struct NPCService_Player_PropDisguise_C_SetMaxHealth final
{
public:
	float                                         NewMaxHealth;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPCService_Player_PropDisguise_C_SetMaxHealth) == 0x000004, "Wrong alignment on NPCService_Player_PropDisguise_C_SetMaxHealth");
static_assert(sizeof(NPCService_Player_PropDisguise_C_SetMaxHealth) == 0x000004, "Wrong size on NPCService_Player_PropDisguise_C_SetMaxHealth");
static_assert(offsetof(NPCService_Player_PropDisguise_C_SetMaxHealth, NewMaxHealth) == 0x000000, "Member 'NPCService_Player_PropDisguise_C_SetMaxHealth::NewMaxHealth' has a wrong offset!");

// Function NPCService_Player_PropDisguise.NPCService_Player_PropDisguise_C.ExecuteUbergraph_NPCService_Player_PropDisguise
// 0x0078 (0x0078 - 0x0000)
struct NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryActivateAbilitiesByTag_ReturnValue;    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilitySystemComponent*            K2Node_DynamicCast_AsFort_Ability_System_Component; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewMaxHealth;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            K2Node_DynamicCast_AsFort_Ability_System_Component_1; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_3;  // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryActivateAbilitiesByTag_ReturnValue_1;  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeSinceCreation_ReturnValue;     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise) == 0x000008, "Wrong alignment on NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise");
static_assert(sizeof(NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise) == 0x000078, "Wrong size on NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise");
static_assert(offsetof(NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise, EntryPoint) == 0x000000, "Member 'NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise::EntryPoint' has a wrong offset!");
static_assert(offsetof(NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise, CallFunc_IsLocallyControlled_ReturnValue) == 0x000004, "Member 'NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000008, "Member 'NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000010, "Member 'NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000018, "Member 'NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise, CallFunc_TryActivateAbilitiesByTag_ReturnValue) == 0x000020, "Member 'NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise::CallFunc_TryActivateAbilitiesByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise, K2Node_DynamicCast_AsFort_Ability_System_Component) == 0x000028, "Member 'NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise::K2Node_DynamicCast_AsFort_Ability_System_Component' has a wrong offset!");
static_assert(offsetof(NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000031, "Member 'NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x000038, "Member 'NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise, K2Node_Event_NewMaxHealth) == 0x000040, "Member 'NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise::K2Node_Event_NewMaxHealth' has a wrong offset!");
static_assert(offsetof(NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise, CallFunc_GetAbilitySystemComponent_ReturnValue_2) == 0x000048, "Member 'NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise::CallFunc_GetAbilitySystemComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise, K2Node_DynamicCast_AsFort_Ability_System_Component_1) == 0x000050, "Member 'NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise::K2Node_DynamicCast_AsFort_Ability_System_Component_1' has a wrong offset!");
static_assert(offsetof(NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise, CallFunc_GetAbilitySystemComponent_ReturnValue_3) == 0x000060, "Member 'NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise::CallFunc_GetAbilitySystemComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise, CallFunc_TryActivateAbilitiesByTag_ReturnValue_1) == 0x000068, "Member 'NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise::CallFunc_TryActivateAbilitiesByTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise, CallFunc_GetGameTimeSinceCreation_ReturnValue) == 0x00006C, "Member 'NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise::CallFunc_GetGameTimeSinceCreation_ReturnValue' has a wrong offset!");
static_assert(offsetof(NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000070, "Member 'NPCService_Player_PropDisguise_C_ExecuteUbergraph_NPCService_Player_PropDisguise::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

