#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pickaxe_Aztec_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct Pickaxe_Aztec_AnimBlueprint.Pickaxe_Aztec_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// 0x00C7 (0x00C8 - 0x0001)
struct Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_4;                                  // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_5;                                  // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_6;                                // 0x0010(0x0018)(BlueprintVisible, NoDestructor)
	ERefPoseType                                  __ByteProperty_7;                                  // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0030(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00B0(0x0018)()
};
static_assert(alignof(Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x0000C8, "Wrong size on Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_4) == 0x000004, "Member 'Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_4' has a wrong offset!");
static_assert(offsetof(Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_5) == 0x000008, "Member 'Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_5' has a wrong offset!");
static_assert(offsetof(Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_6) == 0x000010, "Member 'Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_6' has a wrong offset!");
static_assert(offsetof(Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ByteProperty_7) == 0x000028, "Member 'Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ByteProperty_7' has a wrong offset!");
static_assert(offsetof(Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000030, "Member 'Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000B0, "Member 'Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct Pickaxe_Aztec_AnimBlueprint.Pickaxe_Aztec_AnimBlueprint_C.AnimBlueprintGeneratedMutableData
// 0x0000 (0x0001 - 0x0001)
struct Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
};
static_assert(alignof(Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong size on Pickaxe_Aztec_AnimBlueprint::FAnimBlueprintGeneratedMutableData");

}

