#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pickup_Truck_Veh_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct Pickup_Truck_Veh_AnimBP.Pickup_Truck_Veh_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x00BF (0x00C0 - 0x0001)
struct Pickup_Truck_Veh_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_61;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_62;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_63;                                 // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_64;                               // 0x0010(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0028(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00A8(0x0018)()
};
static_assert(alignof(Pickup_Truck_Veh_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on Pickup_Truck_Veh_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(Pickup_Truck_Veh_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0000C0, "Wrong size on Pickup_Truck_Veh_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(Pickup_Truck_Veh_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_61) == 0x000004, "Member 'Pickup_Truck_Veh_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_61' has a wrong offset!");
static_assert(offsetof(Pickup_Truck_Veh_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_62) == 0x000008, "Member 'Pickup_Truck_Veh_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_62' has a wrong offset!");
static_assert(offsetof(Pickup_Truck_Veh_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_63) == 0x00000C, "Member 'Pickup_Truck_Veh_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_63' has a wrong offset!");
static_assert(offsetof(Pickup_Truck_Veh_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_64) == 0x000010, "Member 'Pickup_Truck_Veh_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_64' has a wrong offset!");
static_assert(offsetof(Pickup_Truck_Veh_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000028, "Member 'Pickup_Truck_Veh_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(Pickup_Truck_Veh_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000A8, "Member 'Pickup_Truck_Veh_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

}

