#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pickaxe_Aztec_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Pickaxe_Aztec_AnimBlueprint.Pickaxe_Aztec_AnimBlueprint_C
// 0x0050 (0x06E0 - 0x0690)
class UPickaxe_Aztec_AnimBlueprint_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0698(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x06C8(0x0010)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Pickaxe_Aztec_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Pickaxe_Aztec_AnimBlueprint_C">();
	}
	static class UPickaxe_Aztec_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickaxe_Aztec_AnimBlueprint_C>();
	}
};
static_assert(alignof(UPickaxe_Aztec_AnimBlueprint_C) == 0x000010, "Wrong alignment on UPickaxe_Aztec_AnimBlueprint_C");
static_assert(sizeof(UPickaxe_Aztec_AnimBlueprint_C) == 0x0006E0, "Wrong size on UPickaxe_Aztec_AnimBlueprint_C");
static_assert(offsetof(UPickaxe_Aztec_AnimBlueprint_C, UberGraphFrame) == 0x000690, "Member 'UPickaxe_Aztec_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPickaxe_Aztec_AnimBlueprint_C, AnimBlueprintExtension_PropertyAccess) == 0x000698, "Member 'UPickaxe_Aztec_AnimBlueprint_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(UPickaxe_Aztec_AnimBlueprint_C, AnimBlueprintExtension_Base) == 0x0006A0, "Member 'UPickaxe_Aztec_AnimBlueprint_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(UPickaxe_Aztec_AnimBlueprint_C, AnimGraphNode_Root) == 0x0006A8, "Member 'UPickaxe_Aztec_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPickaxe_Aztec_AnimBlueprint_C, AnimGraphNode_LocalRefPose) == 0x0006C8, "Member 'UPickaxe_Aztec_AnimBlueprint_C::AnimGraphNode_LocalRefPose' has a wrong offset!");

}

