#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PinkOatmeal_Base_Volume

#include "Basic.hpp"

#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PinkOatmeal_Base_Volume.PinkOatmeal_Base_Volume_C
// 0x0088 (0x09F8 - 0x0970)
class APinkOatmeal_Base_Volume_C : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0970(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   BoundsComponent;                                   // 0x0978(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   OriginSphere;                                      // 0x0980(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0988(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BoundsMeshRadius;                                  // 0x0990(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_994[0x4];                                      // 0x0994(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  AdditionalQuestSourceTags;                         // 0x0998(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  QuestSpecificTargetTag;                            // 0x09B8(0x0020)(Edit, BlueprintVisible)
	class FName                                   QuestSpecificBackendName;                          // 0x09D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9DC[0x4];                                      // 0x09DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                BoundsVisualBubbleScale;                           // 0x09E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void OnActorExitPinkOatmeal(class AActor* Actor, class UActorComponent* ActorComponent, class APawn* InstigatorPawn, class AFortVolume* Volume);
	void OnActorEnterPinkOatmeal(class AActor* Actor, class UActorComponent* ActorComponent, class APawn* InstigatorPawn, class AFortVolume* Volume);
	void GetBubbleRadius(float* Radius);
	void ExecuteUbergraph_PinkOatmeal_Base_Volume(int32 EntryPoint);
	void BndEvt__BoundsComponent_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BoundsComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PinkOatmeal_Base_Volume_C">();
	}
	static class APinkOatmeal_Base_Volume_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APinkOatmeal_Base_Volume_C>();
	}
};
static_assert(alignof(APinkOatmeal_Base_Volume_C) == 0x000008, "Wrong alignment on APinkOatmeal_Base_Volume_C");
static_assert(sizeof(APinkOatmeal_Base_Volume_C) == 0x0009F8, "Wrong size on APinkOatmeal_Base_Volume_C");
static_assert(offsetof(APinkOatmeal_Base_Volume_C, UberGraphFrame) == 0x000970, "Member 'APinkOatmeal_Base_Volume_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APinkOatmeal_Base_Volume_C, BoundsComponent) == 0x000978, "Member 'APinkOatmeal_Base_Volume_C::BoundsComponent' has a wrong offset!");
static_assert(offsetof(APinkOatmeal_Base_Volume_C, OriginSphere) == 0x000980, "Member 'APinkOatmeal_Base_Volume_C::OriginSphere' has a wrong offset!");
static_assert(offsetof(APinkOatmeal_Base_Volume_C, DefaultSceneRoot) == 0x000988, "Member 'APinkOatmeal_Base_Volume_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(APinkOatmeal_Base_Volume_C, BoundsMeshRadius) == 0x000990, "Member 'APinkOatmeal_Base_Volume_C::BoundsMeshRadius' has a wrong offset!");
static_assert(offsetof(APinkOatmeal_Base_Volume_C, AdditionalQuestSourceTags) == 0x000998, "Member 'APinkOatmeal_Base_Volume_C::AdditionalQuestSourceTags' has a wrong offset!");
static_assert(offsetof(APinkOatmeal_Base_Volume_C, QuestSpecificTargetTag) == 0x0009B8, "Member 'APinkOatmeal_Base_Volume_C::QuestSpecificTargetTag' has a wrong offset!");
static_assert(offsetof(APinkOatmeal_Base_Volume_C, QuestSpecificBackendName) == 0x0009D8, "Member 'APinkOatmeal_Base_Volume_C::QuestSpecificBackendName' has a wrong offset!");
static_assert(offsetof(APinkOatmeal_Base_Volume_C, BoundsVisualBubbleScale) == 0x0009E0, "Member 'APinkOatmeal_Base_Volume_C::BoundsVisualBubbleScale' has a wrong offset!");

}

