#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sedan_Veh_Skeleton_AnimBP_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Sedan_Veh_Skeleton_AnimBP_Base.Sedan_Veh_Skeleton_AnimBP_Base_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Sedan_Veh_Skeleton_AnimBP_Base_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Sedan_Veh_Skeleton_AnimBP_Base_C_AnimGraph) == 0x000008, "Wrong alignment on Sedan_Veh_Skeleton_AnimBP_Base_C_AnimGraph");
static_assert(sizeof(Sedan_Veh_Skeleton_AnimBP_Base_C_AnimGraph) == 0x000010, "Wrong size on Sedan_Veh_Skeleton_AnimBP_Base_C_AnimGraph");
static_assert(offsetof(Sedan_Veh_Skeleton_AnimBP_Base_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'Sedan_Veh_Skeleton_AnimBP_Base_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function Sedan_Veh_Skeleton_AnimBP_Base.Sedan_Veh_Skeleton_AnimBP_Base_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Sedan_Veh_Skeleton_AnimBP_Base_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sedan_Veh_Skeleton_AnimBP_Base_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Sedan_Veh_Skeleton_AnimBP_Base_C_BlueprintUpdateAnimation");
static_assert(sizeof(Sedan_Veh_Skeleton_AnimBP_Base_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Sedan_Veh_Skeleton_AnimBP_Base_C_BlueprintUpdateAnimation");
static_assert(offsetof(Sedan_Veh_Skeleton_AnimBP_Base_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Sedan_Veh_Skeleton_AnimBP_Base_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Sedan_Veh_Skeleton_AnimBP_Base.Sedan_Veh_Skeleton_AnimBP_Base_C.ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base
// 0x0070 (0x0070 - 0x0000)
struct Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortDagwoodVehicle*                    K2Node_DynamicCast_AsFort_Dagwood_Vehicle;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_HasTireMod_self_CastInput;                // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTireMod_ReturnValue;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetMaxHealth_self_CastInput;              // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetHealth_self_CastInput;                 // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SafeDivide_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base) == 0x000008, "Wrong alignment on Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base");
static_assert(sizeof(Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base) == 0x000070, "Wrong size on Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base");
static_assert(offsetof(Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base, EntryPoint) == 0x000000, "Member 'Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base, K2Node_DynamicCast_AsFort_Dagwood_Vehicle) == 0x000010, "Member 'Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base::K2Node_DynamicCast_AsFort_Dagwood_Vehicle' has a wrong offset!");
static_assert(offsetof(Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base, CallFunc_HasTireMod_self_CastInput) == 0x000020, "Member 'Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base::CallFunc_HasTireMod_self_CastInput' has a wrong offset!");
static_assert(offsetof(Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base, CallFunc_HasTireMod_ReturnValue) == 0x000030, "Member 'Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base::CallFunc_HasTireMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base, CallFunc_GetMaxHealth_self_CastInput) == 0x000038, "Member 'Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base::CallFunc_GetMaxHealth_self_CastInput' has a wrong offset!");
static_assert(offsetof(Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base, CallFunc_GetMaxHealth_ReturnValue) == 0x000048, "Member 'Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base, CallFunc_GetHealth_self_CastInput) == 0x000050, "Member 'Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base::CallFunc_GetHealth_self_CastInput' has a wrong offset!");
static_assert(offsetof(Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base, CallFunc_GetHealth_ReturnValue) == 0x000060, "Member 'Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base, CallFunc_SafeDivide_ReturnValue) == 0x000064, "Member 'Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000068, "Member 'Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000069, "Member 'Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base, CallFunc_LessEqual_FloatFloat_ReturnValue_2) == 0x00006A, "Member 'Sedan_Veh_Skeleton_AnimBP_Base_C_ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base::CallFunc_LessEqual_FloatFloat_ReturnValue_2' has a wrong offset!");

}

