#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sedan_Veh_Skeleton_AnimBP_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Sedan_Veh_Skeleton_AnimBP_Base.Sedan_Veh_Skeleton_AnimBP_Base_C
// 0x3320 (0x38E0 - 0x05C0)
class USedan_Veh_Skeleton_AnimBP_Base_C final : public UFortGoatVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x05C8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x05D0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x05D8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x05F8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_18;                       // 0x0618(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_17;                       // 0x0740(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_16;                       // 0x0868(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_15;                       // 0x0990(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_14;                       // 0x0AB8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_13;                       // 0x0BE0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x0D08(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x0E30(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x0F58(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x1080(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x11A8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x12D0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x13F8(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1520(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x1540(0x0010)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_2;                         // 0x1550(0x0980)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x1ED0(0x0128)()
	uint8                                         Pad_1FF8[0x8];                                     // 0x1FF8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x2000(0x0980)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x2980(0x0980)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x3300(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x3428(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x3550(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x3678(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x37A0(0x0128)()
	float                                         triggerTrunk;                                      // 0x38C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggerMirrorL;                                    // 0x38CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggerMirrorR;                                    // 0x38D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasTireMod;                                        // 0x38D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_Sedan_Veh_Skeleton_AnimBP_Base(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Sedan_Veh_Skeleton_AnimBP_Base_C">();
	}
	static class USedan_Veh_Skeleton_AnimBP_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USedan_Veh_Skeleton_AnimBP_Base_C>();
	}
};
static_assert(alignof(USedan_Veh_Skeleton_AnimBP_Base_C) == 0x000010, "Wrong alignment on USedan_Veh_Skeleton_AnimBP_Base_C");
static_assert(sizeof(USedan_Veh_Skeleton_AnimBP_Base_C) == 0x0038E0, "Wrong size on USedan_Veh_Skeleton_AnimBP_Base_C");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, UberGraphFrame) == 0x0005C0, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimBlueprintExtension_PropertyAccess) == 0x0005C8, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimBlueprintExtension_Base) == 0x0005D0, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_Root) == 0x0005D8, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_ComponentToLocalSpace) == 0x0005F8, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_ModifyBone_18) == 0x000618, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_ModifyBone_18' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_ModifyBone_17) == 0x000740, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_ModifyBone_17' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_ModifyBone_16) == 0x000868, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_ModifyBone_16' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_ModifyBone_15) == 0x000990, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_ModifyBone_15' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_ModifyBone_14) == 0x000AB8, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_ModifyBone_14' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_ModifyBone_13) == 0x000BE0, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_ModifyBone_13' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_ModifyBone_12) == 0x000D08, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_ModifyBone_12' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_ModifyBone_11) == 0x000E30, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_ModifyBone_11' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_ModifyBone_10) == 0x000F58, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_ModifyBone_10' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_ModifyBone_9) == 0x001080, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_ModifyBone_8) == 0x0011A8, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_ModifyBone_7) == 0x0012D0, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_ModifyBone_6) == 0x0013F8, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_LocalToComponentSpace) == 0x001520, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_LocalRefPose) == 0x001540, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_RigidBody_2) == 0x001550, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_RigidBody_2' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_ModifyBone_5) == 0x001ED0, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_RigidBody_1) == 0x002000, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_RigidBody) == 0x002980, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_ModifyBone_4) == 0x003300, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_ModifyBone_3) == 0x003428, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_ModifyBone_2) == 0x003550, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_ModifyBone_1) == 0x003678, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, AnimGraphNode_ModifyBone) == 0x0037A0, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, triggerTrunk) == 0x0038C8, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::triggerTrunk' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, TriggerMirrorL) == 0x0038CC, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::TriggerMirrorL' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, TriggerMirrorR) == 0x0038D0, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::TriggerMirrorR' has a wrong offset!");
static_assert(offsetof(USedan_Veh_Skeleton_AnimBP_Base_C, HasTireMod) == 0x0038D4, "Member 'USedan_Veh_Skeleton_AnimBP_Base_C::HasTireMod' has a wrong offset!");

}

