#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Semi_Truck_Veh_AnimBP_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Semi_Truck_Veh_AnimBP_Base.Semi_Truck_Veh_AnimBP_Base_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Semi_Truck_Veh_AnimBP_Base_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Semi_Truck_Veh_AnimBP_Base_C_AnimGraph) == 0x000008, "Wrong alignment on Semi_Truck_Veh_AnimBP_Base_C_AnimGraph");
static_assert(sizeof(Semi_Truck_Veh_AnimBP_Base_C_AnimGraph) == 0x000010, "Wrong size on Semi_Truck_Veh_AnimBP_Base_C_AnimGraph");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'Semi_Truck_Veh_AnimBP_Base_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function Semi_Truck_Veh_AnimBP_Base.Semi_Truck_Veh_AnimBP_Base_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Semi_Truck_Veh_AnimBP_Base_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Semi_Truck_Veh_AnimBP_Base_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Semi_Truck_Veh_AnimBP_Base_C_BlueprintUpdateAnimation");
static_assert(sizeof(Semi_Truck_Veh_AnimBP_Base_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Semi_Truck_Veh_AnimBP_Base_C_BlueprintUpdateAnimation");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Semi_Truck_Veh_AnimBP_Base_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Semi_Truck_Veh_AnimBP_Base.Semi_Truck_Veh_AnimBP_Base_C.ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base
// 0x00A8 (0x00A8 - 0x0000)
struct Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetHealth_self_CastInput;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetMaxHealth_self_CastInput;              // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SafeDivide_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortDagwoodVehicle*                    K2Node_DynamicCast_AsFort_Dagwood_Vehicle;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B[0x1];                                       // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMiddleAxleForwardAdjust_ReturnValue;   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_2;           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_HasTireMod_self_CastInput;                // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTireMod_ReturnValue;                   // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base) == 0x000008, "Wrong alignment on Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base");
static_assert(sizeof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base) == 0x0000A8, "Wrong size on Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, EntryPoint) == 0x000000, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_GetHealth_self_CastInput) == 0x000008, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_GetHealth_self_CastInput' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_GetHealth_ReturnValue) == 0x000018, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_GetMaxHealth_self_CastInput) == 0x000020, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_GetMaxHealth_self_CastInput' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_GetMaxHealth_ReturnValue) == 0x000030, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_SafeDivide_ReturnValue) == 0x000038, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, K2Node_DynamicCast_AsFort_Dagwood_Vehicle) == 0x000040, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::K2Node_DynamicCast_AsFort_Dagwood_Vehicle' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000049, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x00004A, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00004C, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x000050, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_LessEqual_FloatFloat_ReturnValue_2) == 0x000054, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_LessEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_GetMiddleAxleForwardAdjust_ReturnValue) == 0x000058, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_GetMiddleAxleForwardAdjust_ReturnValue' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_Conv_BoolToFloat_ReturnValue_2) == 0x00005C, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_Conv_BoolToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_HasTireMod_self_CastInput) == 0x000078, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_HasTireMod_self_CastInput' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_HasTireMod_ReturnValue) == 0x000088, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_HasTireMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base, CallFunc_Add_VectorVector_ReturnValue) == 0x000090, "Member 'Semi_Truck_Veh_AnimBP_Base_C_ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

}

