#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Semi_Truck_Veh_AnimBP_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Semi_Truck_Veh_AnimBP_Base.Semi_Truck_Veh_AnimBP_Base_C
// 0x3B90 (0x4150 - 0x05C0)
class USemi_Truck_Veh_AnimBP_Base_C final : public UFortGoatVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x05C8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x05D0(0x0008)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x05D8(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_17;                       // 0x05F8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_16;                       // 0x0720(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_15;                       // 0x0848(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_14;                       // 0x0970(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_13;                       // 0x0A98(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x0BC0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x0CE8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x0E10(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x0F38(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x1060(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1188(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x11A8(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x11C8(0x0010)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x11D8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x1300(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x1428(0x0128)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_3;                         // 0x1550(0x0980)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_2;                         // 0x1ED0(0x0980)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x2850(0x0980)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x31D0(0x0980)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x3B50(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x3C78(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x3DA0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x3EC8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x3FF0(0x0128)()
	float                                         triggerLadder;                                     // 0x4118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggerMirrorL;                                    // 0x411C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggerMirrorR;                                    // 0x4120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasTireMod;                                        // 0x4124(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4125[0x3];                                     // 0x4125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Health_Percent;                                    // 0x4128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_412C[0x4];                                     // 0x412C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Mid_Differential_Position;                         // 0x4130(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_Semi_Truck_Veh_AnimBP_Base(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Semi_Truck_Veh_AnimBP_Base_C">();
	}
	static class USemi_Truck_Veh_AnimBP_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USemi_Truck_Veh_AnimBP_Base_C>();
	}
};
static_assert(alignof(USemi_Truck_Veh_AnimBP_Base_C) == 0x000010, "Wrong alignment on USemi_Truck_Veh_AnimBP_Base_C");
static_assert(sizeof(USemi_Truck_Veh_AnimBP_Base_C) == 0x004150, "Wrong size on USemi_Truck_Veh_AnimBP_Base_C");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, UberGraphFrame) == 0x0005C0, "Member 'USemi_Truck_Veh_AnimBP_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimBlueprintExtension_PropertyAccess) == 0x0005C8, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimBlueprintExtension_Base) == 0x0005D0, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ComponentToLocalSpace) == 0x0005D8, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_17) == 0x0005F8, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_17' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_16) == 0x000720, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_16' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_15) == 0x000848, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_15' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_14) == 0x000970, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_14' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_13) == 0x000A98, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_13' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_12) == 0x000BC0, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_12' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_11) == 0x000CE8, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_11' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_10) == 0x000E10, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_10' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_9) == 0x000F38, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_8) == 0x001060, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_Root) == 0x001188, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_LocalToComponentSpace) == 0x0011A8, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_LocalRefPose) == 0x0011C8, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_7) == 0x0011D8, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_6) == 0x001300, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_5) == 0x001428, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_RigidBody_3) == 0x001550, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_RigidBody_3' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_RigidBody_2) == 0x001ED0, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_RigidBody_2' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_RigidBody_1) == 0x002850, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_RigidBody) == 0x0031D0, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_4) == 0x003B50, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_3) == 0x003C78, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_2) == 0x003DA0, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone_1) == 0x003EC8, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, AnimGraphNode_ModifyBone) == 0x003FF0, "Member 'USemi_Truck_Veh_AnimBP_Base_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, triggerLadder) == 0x004118, "Member 'USemi_Truck_Veh_AnimBP_Base_C::triggerLadder' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, TriggerMirrorL) == 0x00411C, "Member 'USemi_Truck_Veh_AnimBP_Base_C::TriggerMirrorL' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, TriggerMirrorR) == 0x004120, "Member 'USemi_Truck_Veh_AnimBP_Base_C::TriggerMirrorR' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, HasTireMod) == 0x004124, "Member 'USemi_Truck_Veh_AnimBP_Base_C::HasTireMod' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, Health_Percent) == 0x004128, "Member 'USemi_Truck_Veh_AnimBP_Base_C::Health_Percent' has a wrong offset!");
static_assert(offsetof(USemi_Truck_Veh_AnimBP_Base_C, Mid_Differential_Position) == 0x004130, "Member 'USemi_Truck_Veh_AnimBP_Base_C::Mid_Differential_Position' has a wrong offset!");

}

