#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SideEffect_Client_PlayVOEvent

#include "Basic.hpp"

#include "CommonConversationRuntime_structs.hpp"


namespace SDK::Params
{

// Function SideEffect_Client_PlayVOEvent.SideEffect_Client_PlayVOEvent_C.ClientCauseSideEffect
// 0x0058 (0x0058 - 0x0000)
struct SideEffect_Client_PlayVOEvent_C_ClientCauseSideEffect final
{
public:
	struct FConversationContext                   Context;                                           // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	class AActor*                                 CallFunc_GetParticipantActorNPC_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerPawn_NonParticipant_C*        K2Node_DynamicCast_AsBP_Player_Pawn_Non_Participant; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameplayTagValid_ReturnValue;           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_PlayVoiceComponentSoundByTag_AudioComponent; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SideEffect_Client_PlayVOEvent_C_ClientCauseSideEffect) == 0x000008, "Wrong alignment on SideEffect_Client_PlayVOEvent_C_ClientCauseSideEffect");
static_assert(sizeof(SideEffect_Client_PlayVOEvent_C_ClientCauseSideEffect) == 0x000058, "Wrong size on SideEffect_Client_PlayVOEvent_C_ClientCauseSideEffect");
static_assert(offsetof(SideEffect_Client_PlayVOEvent_C_ClientCauseSideEffect, Context) == 0x000000, "Member 'SideEffect_Client_PlayVOEvent_C_ClientCauseSideEffect::Context' has a wrong offset!");
static_assert(offsetof(SideEffect_Client_PlayVOEvent_C_ClientCauseSideEffect, CallFunc_GetParticipantActorNPC_ReturnValue) == 0x000038, "Member 'SideEffect_Client_PlayVOEvent_C_ClientCauseSideEffect::CallFunc_GetParticipantActorNPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(SideEffect_Client_PlayVOEvent_C_ClientCauseSideEffect, K2Node_DynamicCast_AsBP_Player_Pawn_Non_Participant) == 0x000040, "Member 'SideEffect_Client_PlayVOEvent_C_ClientCauseSideEffect::K2Node_DynamicCast_AsBP_Player_Pawn_Non_Participant' has a wrong offset!");
static_assert(offsetof(SideEffect_Client_PlayVOEvent_C_ClientCauseSideEffect, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'SideEffect_Client_PlayVOEvent_C_ClientCauseSideEffect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SideEffect_Client_PlayVOEvent_C_ClientCauseSideEffect, CallFunc_IsGameplayTagValid_ReturnValue) == 0x000049, "Member 'SideEffect_Client_PlayVOEvent_C_ClientCauseSideEffect::CallFunc_IsGameplayTagValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SideEffect_Client_PlayVOEvent_C_ClientCauseSideEffect, CallFunc_PlayVoiceComponentSoundByTag_AudioComponent) == 0x000050, "Member 'SideEffect_Client_PlayVOEvent_C_ClientCauseSideEffect::CallFunc_PlayVoiceComponentSoundByTag_AudioComponent' has a wrong offset!");

}

