#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_M_Med_Soldier_04_Skeleton_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_M_Med_Soldier_04_Skeleton_AnimBP.SK_M_Med_Soldier_04_Skeleton_AnimBP_C
// 0x2AD0 (0x3180 - 0x06B0)
class USK_M_Med_Soldier_04_Skeleton_AnimBP_C final : public UCustomCharacterPartAnimInstance_Soldier
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x06B8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06C0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06C8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x06E8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0708(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0728(0x0180)(ContainsInstancedReference)
	uint8                                         Pad_8A8[0x8];                                      // 0x08A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x08B0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x0DC0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x12D0(0x0510)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x17E0(0x0980)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x2160(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x2268(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x2370(0x0108)()
	uint8                                         Pad_2478[0x8];                                     // 0x2478(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x2480(0x0980)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x2E00(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x2F28(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x3050(0x0128)()

public:
	void ExecuteUbergraph_SK_M_Med_Soldier_04_Skeleton_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_M_Med_Soldier_04_Skeleton_AnimBP_C">();
	}
	static class USK_M_Med_Soldier_04_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_M_Med_Soldier_04_Skeleton_AnimBP_C>();
	}
};
static_assert(alignof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C) == 0x000010, "Wrong alignment on USK_M_Med_Soldier_04_Skeleton_AnimBP_C");
static_assert(sizeof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C) == 0x003180, "Wrong size on USK_M_Med_Soldier_04_Skeleton_AnimBP_C");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, UberGraphFrame) == 0x0006B0, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x0006B8, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimBlueprintExtension_Base) == 0x0006C0, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_Root) == 0x0006C8, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0006E8, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000708, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x000728, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x0008B0, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x000DC0, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x0012D0, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_RigidBody_1) == 0x0017E0, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_Constraint_2) == 0x002160, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_Constraint_1) == 0x002268, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_Constraint) == 0x002370, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_RigidBody) == 0x002480, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x002E00, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x002F28, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_ModifyBone) == 0x003050, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");

}

