#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint.SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000008, "Wrong alignment on SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(sizeof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_AnimGraph) == 0x000010, "Wrong size on SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_AnimGraph");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint.SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(sizeof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint.SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C.ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint
// 0x0078 (0x0078 - 0x0000)
struct SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlayerAnimInstance*                K2Node_DynamicCast_AsFort_Player_Anim_Instance;    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint) == 0x000008, "Wrong alignment on SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint");
static_assert(sizeof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint) == 0x000078, "Wrong size on SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint, EntryPoint) == 0x000000, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000004, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint, CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue) == 0x000010, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::CallFunc_GetOwnerSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint, CallFunc_GetAnimInstance_ReturnValue) == 0x000018, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint, K2Node_DynamicCast_AsFort_Player_Anim_Instance) == 0x000020, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::K2Node_DynamicCast_AsFort_Player_Anim_Instance' has a wrong offset!");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00002C, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000030, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint, CallFunc_FMin_ReturnValue) == 0x000034, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint, CallFunc_Add_FloatFloat_ReturnValue) == 0x000038, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint, CallFunc_MakeVector_ReturnValue) == 0x000040, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint, CallFunc_MakeRotator_ReturnValue) == 0x000058, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000070, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C_ExecuteUbergraph_SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

