#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_M_LRG_Constructor_01_Skeleton_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_M_LRG_Constructor_01_Skeleton_AnimBP.SK_M_LRG_Constructor_01_Skeleton_AnimBP_C
// 0x2FA0 (0x3630 - 0x0690)
class USK_M_LRG_Constructor_01_Skeleton_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0690(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0698(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06A0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06A8(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x06C8(0x0180)(ContainsInstancedReference)
	uint8                                         Pad_848[0x8];                                      // 0x0848(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_8;                      // 0x0850(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x0D60(0x0510)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1270(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1290(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x12B0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x17C0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x1CD0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x21E0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x26F0(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x2C00(0x0510)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x3110(0x0510)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x3620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void ExecuteUbergraph_SK_M_LRG_Constructor_01_Skeleton_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_M_LRG_Constructor_01_Skeleton_AnimBP_C">();
	}
	static class USK_M_LRG_Constructor_01_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_M_LRG_Constructor_01_Skeleton_AnimBP_C>();
	}
};
static_assert(alignof(USK_M_LRG_Constructor_01_Skeleton_AnimBP_C) == 0x000010, "Wrong alignment on USK_M_LRG_Constructor_01_Skeleton_AnimBP_C");
static_assert(sizeof(USK_M_LRG_Constructor_01_Skeleton_AnimBP_C) == 0x003630, "Wrong size on USK_M_LRG_Constructor_01_Skeleton_AnimBP_C");
static_assert(offsetof(USK_M_LRG_Constructor_01_Skeleton_AnimBP_C, UberGraphFrame) == 0x000690, "Member 'USK_M_LRG_Constructor_01_Skeleton_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USK_M_LRG_Constructor_01_Skeleton_AnimBP_C, AnimBlueprintExtension_PropertyAccess) == 0x000698, "Member 'USK_M_LRG_Constructor_01_Skeleton_AnimBP_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(USK_M_LRG_Constructor_01_Skeleton_AnimBP_C, AnimBlueprintExtension_Base) == 0x0006A0, "Member 'USK_M_LRG_Constructor_01_Skeleton_AnimBP_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(USK_M_LRG_Constructor_01_Skeleton_AnimBP_C, AnimGraphNode_Root) == 0x0006A8, "Member 'USK_M_LRG_Constructor_01_Skeleton_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(USK_M_LRG_Constructor_01_Skeleton_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0006C8, "Member 'USK_M_LRG_Constructor_01_Skeleton_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(USK_M_LRG_Constructor_01_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_8) == 0x000850, "Member 'USK_M_LRG_Constructor_01_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_8' has a wrong offset!");
static_assert(offsetof(USK_M_LRG_Constructor_01_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_7) == 0x000D60, "Member 'USK_M_LRG_Constructor_01_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(USK_M_LRG_Constructor_01_Skeleton_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x001270, "Member 'USK_M_LRG_Constructor_01_Skeleton_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(USK_M_LRG_Constructor_01_Skeleton_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x001290, "Member 'USK_M_LRG_Constructor_01_Skeleton_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(USK_M_LRG_Constructor_01_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_6) == 0x0012B0, "Member 'USK_M_LRG_Constructor_01_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(USK_M_LRG_Constructor_01_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_5) == 0x0017C0, "Member 'USK_M_LRG_Constructor_01_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(USK_M_LRG_Constructor_01_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x001CD0, "Member 'USK_M_LRG_Constructor_01_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(USK_M_LRG_Constructor_01_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x0021E0, "Member 'USK_M_LRG_Constructor_01_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(USK_M_LRG_Constructor_01_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x0026F0, "Member 'USK_M_LRG_Constructor_01_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(USK_M_LRG_Constructor_01_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x002C00, "Member 'USK_M_LRG_Constructor_01_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(USK_M_LRG_Constructor_01_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x003110, "Member 'USK_M_LRG_Constructor_01_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(USK_M_LRG_Constructor_01_Skeleton_AnimBP_C, MeshToCopy) == 0x003620, "Member 'USK_M_LRG_Constructor_01_Skeleton_AnimBP_C::MeshToCopy' has a wrong offset!");

}

