#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint.SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// 0x00BF (0x00C0 - 0x0001)
struct SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_28;                                 // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_29;                                 // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_30;                                 // 0x000C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_31;                               // 0x0010(0x0018)(BlueprintVisible, NoDestructor)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0028(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00A8(0x0018)()
};
static_assert(alignof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData) == 0x0000C0, "Wrong size on SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_28) == 0x000004, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_28' has a wrong offset!");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __NameProperty_29) == 0x000008, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__NameProperty_29' has a wrong offset!");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __ByteProperty_30) == 0x00000C, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__ByteProperty_30' has a wrong offset!");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, __StructProperty_31) == 0x000010, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::__StructProperty_31' has a wrong offset!");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000028, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0000A8, "Member 'SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint.SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint_C.AnimBlueprintGeneratedMutableData
// 0x0000 (0x0001 - 0x0001)
struct SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
};
static_assert(alignof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong alignment on SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData) == 0x000001, "Wrong size on SK_M_MED_Meteorman_Backpack_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData");

}

