#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sports_Car_Veh_AnimBP_Dyn

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Sports_Car_Veh_AnimBP_Dyn.Sports_Car_Veh_AnimBP_Dyn_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Sports_Car_Veh_AnimBP_Dyn_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Sports_Car_Veh_AnimBP_Dyn_C_AnimGraph) == 0x000008, "Wrong alignment on Sports_Car_Veh_AnimBP_Dyn_C_AnimGraph");
static_assert(sizeof(Sports_Car_Veh_AnimBP_Dyn_C_AnimGraph) == 0x000010, "Wrong size on Sports_Car_Veh_AnimBP_Dyn_C_AnimGraph");
static_assert(offsetof(Sports_Car_Veh_AnimBP_Dyn_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'Sports_Car_Veh_AnimBP_Dyn_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function Sports_Car_Veh_AnimBP_Dyn.Sports_Car_Veh_AnimBP_Dyn_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Sports_Car_Veh_AnimBP_Dyn_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sports_Car_Veh_AnimBP_Dyn_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Sports_Car_Veh_AnimBP_Dyn_C_BlueprintUpdateAnimation");
static_assert(sizeof(Sports_Car_Veh_AnimBP_Dyn_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Sports_Car_Veh_AnimBP_Dyn_C_BlueprintUpdateAnimation");
static_assert(offsetof(Sports_Car_Veh_AnimBP_Dyn_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Sports_Car_Veh_AnimBP_Dyn_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Sports_Car_Veh_AnimBP_Dyn.Sports_Car_Veh_AnimBP_Dyn_C.ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn
// 0x0068 (0x0068 - 0x0000)
struct Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortDagwoodVehicle*                    K2Node_DynamicCast_AsFort_Dagwood_Vehicle;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetMaxHealth_self_CastInput;              // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_HasTireMod_self_CastInput;                // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTireMod_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetHealth_self_CastInput;                 // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_2;       // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn) == 0x000008, "Wrong alignment on Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn");
static_assert(sizeof(Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn) == 0x000068, "Wrong size on Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn");
static_assert(offsetof(Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn, EntryPoint) == 0x000000, "Member 'Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn::EntryPoint' has a wrong offset!");
static_assert(offsetof(Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn, K2Node_DynamicCast_AsFort_Dagwood_Vehicle) == 0x000008, "Member 'Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn::K2Node_DynamicCast_AsFort_Dagwood_Vehicle' has a wrong offset!");
static_assert(offsetof(Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn, CallFunc_GetMaxHealth_self_CastInput) == 0x000018, "Member 'Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn::CallFunc_GetMaxHealth_self_CastInput' has a wrong offset!");
static_assert(offsetof(Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn, CallFunc_GetMaxHealth_ReturnValue) == 0x000028, "Member 'Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn, CallFunc_HasTireMod_self_CastInput) == 0x000030, "Member 'Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn::CallFunc_HasTireMod_self_CastInput' has a wrong offset!");
static_assert(offsetof(Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn, CallFunc_HasTireMod_ReturnValue) == 0x000040, "Member 'Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn::CallFunc_HasTireMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn, CallFunc_GetHealth_self_CastInput) == 0x000048, "Member 'Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn::CallFunc_GetHealth_self_CastInput' has a wrong offset!");
static_assert(offsetof(Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn, CallFunc_GetHealth_ReturnValue) == 0x000058, "Member 'Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00005C, "Member 'Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn, K2Node_Event_DeltaTimeX) == 0x000060, "Member 'Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000064, "Member 'Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000065, "Member 'Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn, CallFunc_LessEqual_FloatFloat_ReturnValue_2) == 0x000066, "Member 'Sports_Car_Veh_AnimBP_Dyn_C_ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn::CallFunc_LessEqual_FloatFloat_ReturnValue_2' has a wrong offset!");

}

