#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sports_Car_Veh_AnimBP_Dyn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ValetRuntime_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Sports_Car_Veh_AnimBP_Dyn.Sports_Car_Veh_AnimBP_Dyn_C
// 0x3B70 (0x4180 - 0x0610)
class USports_Car_Veh_AnimBP_Dyn_C final : public UFortDagwoodVehicleAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0618(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0620(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0628(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0648(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_17;                       // 0x0668(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_16;                       // 0x0790(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_15;                       // 0x08B8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_14;                       // 0x09E0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_13;                       // 0x0B08(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x0C30(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x0D58(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x0E80(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x0FA8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x10D0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x11F8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x1320(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x1448(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1570(0x0020)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0x1590(0x0010)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_3;                         // 0x15A0(0x0980)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_2;                         // 0x1F20(0x0980)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x28A0(0x0980)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x3220(0x0980)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x3BA0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x3CC8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x3DF0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x3F18(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x4040(0x0128)()
	float                                         triggerSpoiler;                                    // 0x4168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggerMirrorL;                                    // 0x416C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggerMirrorR;                                    // 0x4170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasTireMod;                                        // 0x4174(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_Sports_Car_Veh_AnimBP_Dyn(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Sports_Car_Veh_AnimBP_Dyn_C">();
	}
	static class USports_Car_Veh_AnimBP_Dyn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USports_Car_Veh_AnimBP_Dyn_C>();
	}
};
static_assert(alignof(USports_Car_Veh_AnimBP_Dyn_C) == 0x000010, "Wrong alignment on USports_Car_Veh_AnimBP_Dyn_C");
static_assert(sizeof(USports_Car_Veh_AnimBP_Dyn_C) == 0x004180, "Wrong size on USports_Car_Veh_AnimBP_Dyn_C");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, UberGraphFrame) == 0x000610, "Member 'USports_Car_Veh_AnimBP_Dyn_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimBlueprintExtension_PropertyAccess) == 0x000618, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimBlueprintExtension_Base) == 0x000620, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimBlueprintExtension_Base' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_Root) == 0x000628, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_ComponentToLocalSpace) == 0x000648, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_ModifyBone_17) == 0x000668, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_ModifyBone_17' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_ModifyBone_16) == 0x000790, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_ModifyBone_16' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_ModifyBone_15) == 0x0008B8, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_ModifyBone_15' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_ModifyBone_14) == 0x0009E0, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_ModifyBone_14' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_ModifyBone_13) == 0x000B08, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_ModifyBone_13' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_ModifyBone_12) == 0x000C30, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_ModifyBone_12' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_ModifyBone_11) == 0x000D58, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_ModifyBone_11' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_ModifyBone_10) == 0x000E80, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_ModifyBone_10' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_ModifyBone_9) == 0x000FA8, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_ModifyBone_8) == 0x0010D0, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_ModifyBone_7) == 0x0011F8, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_ModifyBone_6) == 0x001320, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_ModifyBone_5) == 0x001448, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_LocalToComponentSpace) == 0x001570, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_LocalRefPose) == 0x001590, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_LocalRefPose' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_RigidBody_3) == 0x0015A0, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_RigidBody_3' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_RigidBody_2) == 0x001F20, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_RigidBody_2' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_RigidBody_1) == 0x0028A0, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_RigidBody) == 0x003220, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_ModifyBone_4) == 0x003BA0, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_ModifyBone_3) == 0x003CC8, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_ModifyBone_2) == 0x003DF0, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_ModifyBone_1) == 0x003F18, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, AnimGraphNode_ModifyBone) == 0x004040, "Member 'USports_Car_Veh_AnimBP_Dyn_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, triggerSpoiler) == 0x004168, "Member 'USports_Car_Veh_AnimBP_Dyn_C::triggerSpoiler' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, TriggerMirrorL) == 0x00416C, "Member 'USports_Car_Veh_AnimBP_Dyn_C::TriggerMirrorL' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, TriggerMirrorR) == 0x004170, "Member 'USports_Car_Veh_AnimBP_Dyn_C::TriggerMirrorR' has a wrong offset!");
static_assert(offsetof(USports_Car_Veh_AnimBP_Dyn_C, HasTireMod) == 0x004174, "Member 'USports_Car_Veh_AnimBP_Dyn_C::HasTireMod' has a wrong offset!");

}

