#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Valet_BasicTruck_Vehicle

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Valet_BasicCar_Vehicle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Valet_BasicTruck_Vehicle.Valet_BasicTruck_Vehicle_C
// 0x0080 (0x2C00 - 0x2B80)
#pragma pack(push, 0x1)
class alignas(0x10) AValet_BasicTruck_Vehicle_C : public AValet_BasicCar_Vehicle_C
{
public:
	struct FScalableFloat                         HotfixScalePontoonTickRateFront_0;                 // 0x2B80(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         HotfixScalePontoonTickRateRear_0;                  // 0x2BA8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInterface*>             SK_Mat2_Array_0;                                   // 0x2BD0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInterface*>             SK_Mat0_Array_0_0;                                 // 0x2BE0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MatIndex;                                          // 0x2BF0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Valet_BasicTruck_Vehicle_C">();
	}
	static class AValet_BasicTruck_Vehicle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AValet_BasicTruck_Vehicle_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(AValet_BasicTruck_Vehicle_C) == 0x000010, "Wrong alignment on AValet_BasicTruck_Vehicle_C");
static_assert(sizeof(AValet_BasicTruck_Vehicle_C) == 0x002C00, "Wrong size on AValet_BasicTruck_Vehicle_C");
static_assert(offsetof(AValet_BasicTruck_Vehicle_C, HotfixScalePontoonTickRateFront_0) == 0x002B80, "Member 'AValet_BasicTruck_Vehicle_C::HotfixScalePontoonTickRateFront_0' has a wrong offset!");
static_assert(offsetof(AValet_BasicTruck_Vehicle_C, HotfixScalePontoonTickRateRear_0) == 0x002BA8, "Member 'AValet_BasicTruck_Vehicle_C::HotfixScalePontoonTickRateRear_0' has a wrong offset!");
static_assert(offsetof(AValet_BasicTruck_Vehicle_C, SK_Mat2_Array_0) == 0x002BD0, "Member 'AValet_BasicTruck_Vehicle_C::SK_Mat2_Array_0' has a wrong offset!");
static_assert(offsetof(AValet_BasicTruck_Vehicle_C, SK_Mat0_Array_0_0) == 0x002BE0, "Member 'AValet_BasicTruck_Vehicle_C::SK_Mat0_Array_0_0' has a wrong offset!");
static_assert(offsetof(AValet_BasicTruck_Vehicle_C, MatIndex) == 0x002BF0, "Member 'AValet_BasicTruck_Vehicle_C::MatIndex' has a wrong offset!");

}

