#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Valet_BasicCar_Vehicle

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Curie_structs.hpp"
#include "GameplayCameras_structs.hpp"


namespace SDK::Params
{

// Function Valet_BasicCar_Vehicle.Valet_BasicCar_Vehicle_C.ApplyBuildingExplosionDamage
// 0x0270 (0x0270 - 0x0000)
struct Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FHitResult>                     CallFunc_SphereTraceMultiForObjects_OutHits;       // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceMultiForObjects_ReturnValue;   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_Array_Get_Item;                           // 0x0080(0x00E0)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16A[0x2];                                      // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0208(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0220(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingSpec_ReturnValue;             // 0x0238(0x0010)()
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_1; // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x0250(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_FortApplyGameplayEffectSpecToTarget_ReturnValue; // 0x0264(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage) == 0x000008, "Wrong alignment on Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage");
static_assert(sizeof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage) == 0x000270, "Wrong size on Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, Temp_int_Array_Index_Variable) == 0x000000, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, Temp_object_Variable) == 0x000010, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_GetUpVector_ReturnValue) == 0x000020, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_Add_VectorVector_ReturnValue) == 0x000050, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_SphereTraceMultiForObjects_OutHits) == 0x000068, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_SphereTraceMultiForObjects_OutHits' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_SphereTraceMultiForObjects_ReturnValue) == 0x000078, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_SphereTraceMultiForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_Array_Get_Item) == 0x000080, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000160, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_BreakHitResult_bBlockingHit) == 0x000168, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_BreakHitResult_bInitialOverlap) == 0x000169, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_BreakHitResult_Time) == 0x00016C, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_BreakHitResult_Distance) == 0x000170, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_BreakHitResult_Location) == 0x000178, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_BreakHitResult_ImpactPoint) == 0x000190, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_BreakHitResult_Normal) == 0x0001A8, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_BreakHitResult_ImpactNormal) == 0x0001C0, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_BreakHitResult_PhysMat) == 0x0001D8, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_BreakHitResult_HitActor) == 0x0001E0, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_BreakHitResult_HitComponent) == 0x0001E8, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_BreakHitResult_HitBoneName) == 0x0001F0, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_BreakHitResult_BoneName) == 0x0001F4, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_BreakHitResult_HitItem) == 0x0001F8, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_BreakHitResult_ElementIndex) == 0x0001FC, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_BreakHitResult_FaceIndex) == 0x000200, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_BreakHitResult_TraceStart) == 0x000208, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_BreakHitResult_TraceEnd) == 0x000220, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_MakeOutgoingSpec_ReturnValue) == 0x000238, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_MakeOutgoingSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_GetFortAbilitySystemComponent_ReturnValue_1) == 0x000248, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_GetFortAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x000250, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_Array_Length_ReturnValue) == 0x000260, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_BP_FortApplyGameplayEffectSpecToTarget_ReturnValue) == 0x000264, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_BP_FortApplyGameplayEffectSpecToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage, CallFunc_Less_IntInt_ReturnValue) == 0x00026C, "Member 'Valet_BasicCar_Vehicle_C_ApplyBuildingExplosionDamage::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function Valet_BasicCar_Vehicle.Valet_BasicCar_Vehicle_C.BrakingSkid
// 0x0001 (0x0001 - 0x0000)
struct Valet_BasicCar_Vehicle_C_BrakingSkid final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_BasicCar_Vehicle_C_BrakingSkid) == 0x000001, "Wrong alignment on Valet_BasicCar_Vehicle_C_BrakingSkid");
static_assert(sizeof(Valet_BasicCar_Vehicle_C_BrakingSkid) == 0x000001, "Wrong size on Valet_BasicCar_Vehicle_C_BrakingSkid");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_BrakingSkid, Condition) == 0x000000, "Member 'Valet_BasicCar_Vehicle_C_BrakingSkid::Condition' has a wrong offset!");

// Function Valet_BasicCar_Vehicle.Valet_BasicCar_Vehicle_C.CacheExplosionDamageValues
// 0x000C (0x000C - 0x0000)
struct Valet_BasicCar_Vehicle_C_CacheExplosionDamageValues final
{
public:
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_BasicCar_Vehicle_C_CacheExplosionDamageValues) == 0x000004, "Wrong alignment on Valet_BasicCar_Vehicle_C_CacheExplosionDamageValues");
static_assert(sizeof(Valet_BasicCar_Vehicle_C_CacheExplosionDamageValues) == 0x00000C, "Wrong size on Valet_BasicCar_Vehicle_C_CacheExplosionDamageValues");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CacheExplosionDamageValues, CallFunc_GetValueAtLevel_ReturnValue) == 0x000000, "Member 'Valet_BasicCar_Vehicle_C_CacheExplosionDamageValues::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CacheExplosionDamageValues, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000004, "Member 'Valet_BasicCar_Vehicle_C_CacheExplosionDamageValues::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CacheExplosionDamageValues, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x000008, "Member 'Valet_BasicCar_Vehicle_C_CacheExplosionDamageValues::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");

// Function Valet_BasicCar_Vehicle.Valet_BasicCar_Vehicle_C.CalcAccelRumbleIntensity
// 0x0020 (0x0020 - 0x0000)
struct Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity final
{
public:
	float                                         MaxIntensity;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetForwardSpeedKmh_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity) == 0x000004, "Wrong alignment on Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity");
static_assert(sizeof(Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity) == 0x000020, "Wrong size on Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity, MaxIntensity) == 0x000000, "Member 'Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity::MaxIntensity' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity, ReturnValue) == 0x000004, "Member 'Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity::ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity, CallFunc_GetForwardSpeedKmh_ReturnValue) == 0x000008, "Member 'Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity::CallFunc_GetForwardSpeedKmh_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity, CallFunc_Abs_ReturnValue) == 0x00000C, "Member 'Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000014, "Member 'Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000018, "Member 'Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity, CallFunc_FClamp_ReturnValue) == 0x00001C, "Member 'Valet_BasicCar_Vehicle_C_CalcAccelRumbleIntensity::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function Valet_BasicCar_Vehicle.Valet_BasicCar_Vehicle_C.CalcImpulseDirection
// 0x00D0 (0x00D0 - 0x0000)
struct Valet_BasicCar_Vehicle_C_CalcImpulseDirection final
{
public:
	class AActor*                                 Vehicle;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Magnitude;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_BasicCar_Vehicle_C_CalcImpulseDirection) == 0x000008, "Wrong alignment on Valet_BasicCar_Vehicle_C_CalcImpulseDirection");
static_assert(sizeof(Valet_BasicCar_Vehicle_C_CalcImpulseDirection) == 0x0000D0, "Wrong size on Valet_BasicCar_Vehicle_C_CalcImpulseDirection");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcImpulseDirection, Vehicle) == 0x000000, "Member 'Valet_BasicCar_Vehicle_C_CalcImpulseDirection::Vehicle' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcImpulseDirection, Magnitude) == 0x000008, "Member 'Valet_BasicCar_Vehicle_C_CalcImpulseDirection::Magnitude' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcImpulseDirection, ReturnValue) == 0x000010, "Member 'Valet_BasicCar_Vehicle_C_CalcImpulseDirection::ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcImpulseDirection, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'Valet_BasicCar_Vehicle_C_CalcImpulseDirection::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcImpulseDirection, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000040, "Member 'Valet_BasicCar_Vehicle_C_CalcImpulseDirection::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcImpulseDirection, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000058, "Member 'Valet_BasicCar_Vehicle_C_CalcImpulseDirection::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcImpulseDirection, CallFunc_Normal_ReturnValue) == 0x000070, "Member 'Valet_BasicCar_Vehicle_C_CalcImpulseDirection::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcImpulseDirection, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000088, "Member 'Valet_BasicCar_Vehicle_C_CalcImpulseDirection::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcImpulseDirection, CallFunc_BreakVector_X) == 0x0000A0, "Member 'Valet_BasicCar_Vehicle_C_CalcImpulseDirection::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcImpulseDirection, CallFunc_BreakVector_Y) == 0x0000A4, "Member 'Valet_BasicCar_Vehicle_C_CalcImpulseDirection::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcImpulseDirection, CallFunc_BreakVector_Z) == 0x0000A8, "Member 'Valet_BasicCar_Vehicle_C_CalcImpulseDirection::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcImpulseDirection, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000AC, "Member 'Valet_BasicCar_Vehicle_C_CalcImpulseDirection::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcImpulseDirection, CallFunc_FMax_ReturnValue) == 0x0000B0, "Member 'Valet_BasicCar_Vehicle_C_CalcImpulseDirection::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CalcImpulseDirection, CallFunc_MakeVector_ReturnValue) == 0x0000B8, "Member 'Valet_BasicCar_Vehicle_C_CalcImpulseDirection::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function Valet_BasicCar_Vehicle.Valet_BasicCar_Vehicle_C.CreateBaseMID
// 0x0040 (0x0040 - 0x0000)
struct Valet_BasicCar_Vehicle_C_CreateBaseMID final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_K2_GetVectorParameterValue_ReturnValue;   // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue_1; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue_2; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue_3; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               CallFunc_K2_GetTextureParameterValue_ReturnValue_4; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_BasicCar_Vehicle_C_CreateBaseMID) == 0x000008, "Wrong alignment on Valet_BasicCar_Vehicle_C_CreateBaseMID");
static_assert(sizeof(Valet_BasicCar_Vehicle_C_CreateBaseMID) == 0x000040, "Wrong size on Valet_BasicCar_Vehicle_C_CreateBaseMID");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CreateBaseMID, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'Valet_BasicCar_Vehicle_C_CreateBaseMID::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CreateBaseMID, CallFunc_K2_GetVectorParameterValue_ReturnValue) == 0x000008, "Member 'Valet_BasicCar_Vehicle_C_CreateBaseMID::CallFunc_K2_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CreateBaseMID, CallFunc_K2_GetTextureParameterValue_ReturnValue) == 0x000018, "Member 'Valet_BasicCar_Vehicle_C_CreateBaseMID::CallFunc_K2_GetTextureParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CreateBaseMID, CallFunc_K2_GetTextureParameterValue_ReturnValue_1) == 0x000020, "Member 'Valet_BasicCar_Vehicle_C_CreateBaseMID::CallFunc_K2_GetTextureParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CreateBaseMID, CallFunc_K2_GetTextureParameterValue_ReturnValue_2) == 0x000028, "Member 'Valet_BasicCar_Vehicle_C_CreateBaseMID::CallFunc_K2_GetTextureParameterValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CreateBaseMID, CallFunc_K2_GetTextureParameterValue_ReturnValue_3) == 0x000030, "Member 'Valet_BasicCar_Vehicle_C_CreateBaseMID::CallFunc_K2_GetTextureParameterValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CreateBaseMID, CallFunc_K2_GetTextureParameterValue_ReturnValue_4) == 0x000038, "Member 'Valet_BasicCar_Vehicle_C_CreateBaseMID::CallFunc_K2_GetTextureParameterValue_ReturnValue_4' has a wrong offset!");

// Function Valet_BasicCar_Vehicle.Valet_BasicCar_Vehicle_C.CreateDestroyedMIDApply
// 0x0008 (0x0008 - 0x0000)
struct Valet_BasicCar_Vehicle_C_CreateDestroyedMIDApply final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_BasicCar_Vehicle_C_CreateDestroyedMIDApply) == 0x000008, "Wrong alignment on Valet_BasicCar_Vehicle_C_CreateDestroyedMIDApply");
static_assert(sizeof(Valet_BasicCar_Vehicle_C_CreateDestroyedMIDApply) == 0x000008, "Wrong size on Valet_BasicCar_Vehicle_C_CreateDestroyedMIDApply");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_CreateDestroyedMIDApply, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'Valet_BasicCar_Vehicle_C_CreateDestroyedMIDApply::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function Valet_BasicCar_Vehicle.Valet_BasicCar_Vehicle_C.Damageable Part Changed
// 0x0170 (0x0170 - 0x0000)
struct Valet_BasicCar_Vehicle_C_Damageable_Part_Changed final
{
public:
	struct FVehicleDamageablePartConfig           PartConfig;                                        // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVehicleDamageablePart                 Part;                                              // 0x0040(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          NewlyDisabled;                                     // 0x0054(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BoneNameLocal;                                     // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Valet_AudioController_Parent_C*     K2Node_DynamicCast_AsBP_Valet_Audio_Controller_Parent; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IValet_AudioController_Interface_C> K2Node_DynamicCast_AsValet_Audio_Controller_Interface; // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_1;        // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_2;          // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_3;          // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_2;        // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_3;        // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_4;          // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Valet_AudioController_Parent_C*     K2Node_DynamicCast_AsBP_Valet_Audio_Controller_Parent_1; // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_4;        // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IValet_AudioController_Interface_C> K2Node_DynamicCast_AsValet_Audio_Controller_Interface_1; // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_5;          // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_5;        // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed) == 0x000008, "Wrong alignment on Valet_BasicCar_Vehicle_C_Damageable_Part_Changed");
static_assert(sizeof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed) == 0x000170, "Wrong size on Valet_BasicCar_Vehicle_C_Damageable_Part_Changed");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, PartConfig) == 0x000000, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::PartConfig' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, Part) == 0x000040, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::Part' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, NewlyDisabled) == 0x000054, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::NewlyDisabled' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, BoneNameLocal) == 0x000058, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::BoneNameLocal' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, K2Node_SwitchName_CmpSuccess) == 0x00005C, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, CallFunc_GetSocketLocation_ReturnValue) == 0x000060, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, CallFunc_SpawnSystemAttached_ReturnValue) == 0x000078, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, K2Node_DynamicCast_AsBP_Valet_Audio_Controller_Parent) == 0x000080, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::K2Node_DynamicCast_AsBP_Valet_Audio_Controller_Parent' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, K2Node_DynamicCast_AsValet_Audio_Controller_Interface) == 0x000090, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::K2Node_DynamicCast_AsValet_Audio_Controller_Interface' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, CallFunc_GetSocketLocation_ReturnValue_1) == 0x0000A8, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, CallFunc_SpawnSystemAttached_ReturnValue_1) == 0x0000C0, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::CallFunc_SpawnSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, CallFunc_GetSocketLocation_ReturnValue_2) == 0x0000C8, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::CallFunc_GetSocketLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, CallFunc_GetSocketLocation_ReturnValue_3) == 0x0000E0, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::CallFunc_GetSocketLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, CallFunc_SpawnSystemAttached_ReturnValue_2) == 0x0000F8, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::CallFunc_SpawnSystemAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, CallFunc_SpawnSystemAttached_ReturnValue_3) == 0x000100, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::CallFunc_SpawnSystemAttached_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, CallFunc_GetSocketLocation_ReturnValue_4) == 0x000108, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::CallFunc_GetSocketLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, K2Node_DynamicCast_AsBP_Valet_Audio_Controller_Parent_1) == 0x000120, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::K2Node_DynamicCast_AsBP_Valet_Audio_Controller_Parent_1' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, K2Node_DynamicCast_bSuccess_2) == 0x000128, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, CallFunc_SpawnSystemAttached_ReturnValue_4) == 0x000130, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::CallFunc_SpawnSystemAttached_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, K2Node_DynamicCast_AsValet_Audio_Controller_Interface_1) == 0x000138, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::K2Node_DynamicCast_AsValet_Audio_Controller_Interface_1' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, K2Node_DynamicCast_bSuccess_3) == 0x000148, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, CallFunc_GetSocketLocation_ReturnValue_5) == 0x000150, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::CallFunc_GetSocketLocation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_Damageable_Part_Changed, CallFunc_SpawnSystemAttached_ReturnValue_5) == 0x000168, "Member 'Valet_BasicCar_Vehicle_C_Damageable_Part_Changed::CallFunc_SpawnSystemAttached_ReturnValue_5' has a wrong offset!");

// Function Valet_BasicCar_Vehicle.Valet_BasicCar_Vehicle_C.DisolveVehicle
// 0x0004 (0x0004 - 0x0000)
struct Valet_BasicCar_Vehicle_C_DisolveVehicle final
{
public:
	float                                         Fade;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_BasicCar_Vehicle_C_DisolveVehicle) == 0x000004, "Wrong alignment on Valet_BasicCar_Vehicle_C_DisolveVehicle");
static_assert(sizeof(Valet_BasicCar_Vehicle_C_DisolveVehicle) == 0x000004, "Wrong size on Valet_BasicCar_Vehicle_C_DisolveVehicle");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_DisolveVehicle, Fade) == 0x000000, "Member 'Valet_BasicCar_Vehicle_C_DisolveVehicle::Fade' has a wrong offset!");

// Function Valet_BasicCar_Vehicle.Valet_BasicCar_Vehicle_C.DropLootOnDamage
// 0x00E8 (0x00E8 - 0x0000)
struct Valet_BasicCar_Vehicle_C_DropLootOnDamage final
{
public:
	class AActor*                                 DamagingActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0008(0x00E0)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Valet_BasicCar_Vehicle_C_DropLootOnDamage) == 0x000008, "Wrong alignment on Valet_BasicCar_Vehicle_C_DropLootOnDamage");
static_assert(sizeof(Valet_BasicCar_Vehicle_C_DropLootOnDamage) == 0x0000E8, "Wrong size on Valet_BasicCar_Vehicle_C_DropLootOnDamage");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_DropLootOnDamage, DamagingActor) == 0x000000, "Member 'Valet_BasicCar_Vehicle_C_DropLootOnDamage::DamagingActor' has a wrong offset!");
static_assert(offsetof(Valet_BasicCar_Vehicle_C_DropLootOnDamage, HitResult) == 0x000008, "Member 'Valet_BasicCar_Vehicle_C_DropLootOnDamage::HitResult' has a wrong offset!");

// Function Valet_BasicCar_Vehicle.Valet_BasicCar_Vehicle_C.ExecuteUbergraph_Valet_BasicCar_Vehicle
// 0x1960 (0x1960 - 0x0000)
struct Valet_BasicCar_Vehicle_C_ExecuteUbergraph_Valet_BasicCar_Vehicle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVehicleAccelerating__Return;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_NewPercent;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyViewed_ReturnValue;              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0010(0x00D0)(ContainsInstancedReference)
	bool                                          CallFunc_IsVehicleAccelerating__Return_1;          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalcAccelRumbleIntensity_ReturnValue;     // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Condition_1;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue_1;  // 0x00F8(0x00D0)(ContainsInstancedReference)
	bool                                          CallFunc_IsLocallyViewed_ReturnValue_1;            // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CB[0x1];                                      // 0x01CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalcAccelRumbleIntensity_ReturnValue_1;   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x01D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D7[0x1];                                      // 0x01D7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetForwardSpeedKmh_ReturnValue;           // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFOscillator                           K2Node_MakeStruct_FOscillator;                     // 0x01EC(0x000C)(NoDestructor)
	struct FFOscillator                           K2Node_MakeStruct_FOscillator_1;                   // 0x01F8(0x000C)(NoDestructor)
	struct FFOscillator                           K2Node_MakeStruct_FOscillator_2;                   // 0x0204(0x000C)(NoDestructor)
	struct FROscillator                           K2Node_MakeStruct_ROscillator;                     // 0x0210(0x0024)(NoDestructor)
	struct FFOscillator                           K2Node_MakeStruct_FOscillator_3;                   // 0x0234(0x000C)(NoDestructor)
	struct FVOscillator                           K2Node_MakeStruct_VOscillator;                     // 0x0240(0x0024)(NoDestructor)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraShakeBase*                       CallFunc_StartCameraShake_ReturnValue;             // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMatineeCameraShake*                    CallFunc_Conv_MatineeCameraShake_ReturnValue;      // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_282[0x2];                                      // 0x0282(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_TireIndex;                            // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetVehicleAbilitySystemComponent_ReturnValue; // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0294(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Valet_AudioController_Parent_C*     K2Node_DynamicCast_AsBP_Valet_Audio_Controller_Parent; // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetConsoleVariableIntValue_ReturnValue;   // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
