#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Valet_BigRig_Vehicle

#include "Basic.hpp"


namespace SDK::Params
{

// Function Valet_BigRig_Vehicle.Valet_BigRig_Vehicle_C.ExecuteUbergraph_Valet_BigRig_Vehicle
// 0x0070 (0x0070 - 0x0000)
struct Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWaterBodyActor*                    K2Node_Event_WaterBody;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(TScriptInterface<class IFortVehicleInterface>& Vehicle, class AFortPawn* PlayerPawn, int32 SeatIndex)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x000C)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_CustomEvent_Vehicle_1;                      // 0x0030(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_CustomEvent_PlayerPawn_1;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SeatIndex_1;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> K2Node_CustomEvent_Vehicle;                        // 0x0050(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_CustomEvent_PlayerPawn;                     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SeatIndex;                      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle) == 0x000008, "Wrong alignment on Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle");
static_assert(sizeof(Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle) == 0x000070, "Wrong size on Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle");
static_assert(offsetof(Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle, EntryPoint) == 0x000000, "Member 'Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle::EntryPoint' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle, K2Node_Event_WaterBody) == 0x000008, "Member 'Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle::K2Node_Event_WaterBody' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle, K2Node_CustomEvent_Vehicle_1) == 0x000030, "Member 'Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle::K2Node_CustomEvent_Vehicle_1' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle, K2Node_CustomEvent_PlayerPawn_1) == 0x000040, "Member 'Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle::K2Node_CustomEvent_PlayerPawn_1' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle, K2Node_CustomEvent_SeatIndex_1) == 0x000048, "Member 'Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle::K2Node_CustomEvent_SeatIndex_1' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle, K2Node_CustomEvent_Vehicle) == 0x000050, "Member 'Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle::K2Node_CustomEvent_Vehicle' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle, K2Node_CustomEvent_PlayerPawn) == 0x000060, "Member 'Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle::K2Node_CustomEvent_PlayerPawn' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle, K2Node_CustomEvent_SeatIndex) == 0x000068, "Member 'Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle::K2Node_CustomEvent_SeatIndex' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00006C, "Member 'Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle, CallFunc_IsValid_ReturnValue_1) == 0x00006D, "Member 'Valet_BigRig_Vehicle_C_ExecuteUbergraph_Valet_BigRig_Vehicle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function Valet_BigRig_Vehicle.Valet_BigRig_Vehicle_C.LocalPassengerMatSwap
// 0x0020 (0x0020 - 0x0000)
struct Valet_BigRig_Vehicle_C_LocalPassengerMatSwap final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_BigRig_Vehicle_C_LocalPassengerMatSwap) == 0x000008, "Wrong alignment on Valet_BigRig_Vehicle_C_LocalPassengerMatSwap");
static_assert(sizeof(Valet_BigRig_Vehicle_C_LocalPassengerMatSwap) == 0x000020, "Wrong size on Valet_BigRig_Vehicle_C_LocalPassengerMatSwap");
static_assert(offsetof(Valet_BigRig_Vehicle_C_LocalPassengerMatSwap, Temp_bool_Variable) == 0x000000, "Member 'Valet_BigRig_Vehicle_C_LocalPassengerMatSwap::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_LocalPassengerMatSwap, CallFunc_Array_Get_Item) == 0x000008, "Member 'Valet_BigRig_Vehicle_C_LocalPassengerMatSwap::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_LocalPassengerMatSwap, CallFunc_Array_Get_Item_1) == 0x000010, "Member 'Valet_BigRig_Vehicle_C_LocalPassengerMatSwap::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_LocalPassengerMatSwap, K2Node_Select_Default) == 0x000018, "Member 'Valet_BigRig_Vehicle_C_LocalPassengerMatSwap::K2Node_Select_Default' has a wrong offset!");

// Function Valet_BigRig_Vehicle.Valet_BigRig_Vehicle_C.OnEnteredWaterBody
// 0x0008 (0x0008 - 0x0000)
struct Valet_BigRig_Vehicle_C_OnEnteredWaterBody final
{
public:
	class AFortWaterBodyActor*                    WaterBody_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_BigRig_Vehicle_C_OnEnteredWaterBody) == 0x000008, "Wrong alignment on Valet_BigRig_Vehicle_C_OnEnteredWaterBody");
static_assert(sizeof(Valet_BigRig_Vehicle_C_OnEnteredWaterBody) == 0x000008, "Wrong size on Valet_BigRig_Vehicle_C_OnEnteredWaterBody");
static_assert(offsetof(Valet_BigRig_Vehicle_C_OnEnteredWaterBody, WaterBody_0) == 0x000000, "Member 'Valet_BigRig_Vehicle_C_OnEnteredWaterBody::WaterBody_0' has a wrong offset!");

// Function Valet_BigRig_Vehicle.Valet_BigRig_Vehicle_C.PassengerEnter
// 0x0010 (0x0010 - 0x0000)
struct Valet_BigRig_Vehicle_C_PassengerEnter final
{
public:
	class AFortPawn*                              PlayerPawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_BigRig_Vehicle_C_PassengerEnter) == 0x000008, "Wrong alignment on Valet_BigRig_Vehicle_C_PassengerEnter");
static_assert(sizeof(Valet_BigRig_Vehicle_C_PassengerEnter) == 0x000010, "Wrong size on Valet_BigRig_Vehicle_C_PassengerEnter");
static_assert(offsetof(Valet_BigRig_Vehicle_C_PassengerEnter, PlayerPawn) == 0x000000, "Member 'Valet_BigRig_Vehicle_C_PassengerEnter::PlayerPawn' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_PassengerEnter, CallFunc_IsLocallyControlled_ReturnValue) == 0x000008, "Member 'Valet_BigRig_Vehicle_C_PassengerEnter::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");

// Function Valet_BigRig_Vehicle.Valet_BigRig_Vehicle_C.PassengerExit
// 0x0010 (0x0010 - 0x0000)
struct Valet_BigRig_Vehicle_C_PassengerExit final
{
public:
	class AFortPawn*                              PlayerPawn;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_BigRig_Vehicle_C_PassengerExit) == 0x000008, "Wrong alignment on Valet_BigRig_Vehicle_C_PassengerExit");
static_assert(sizeof(Valet_BigRig_Vehicle_C_PassengerExit) == 0x000010, "Wrong size on Valet_BigRig_Vehicle_C_PassengerExit");
static_assert(offsetof(Valet_BigRig_Vehicle_C_PassengerExit, PlayerPawn) == 0x000000, "Member 'Valet_BigRig_Vehicle_C_PassengerExit::PlayerPawn' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_PassengerExit, CallFunc_IsLocallyControlled_ReturnValue) == 0x000008, "Member 'Valet_BigRig_Vehicle_C_PassengerExit::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");

// Function Valet_BigRig_Vehicle.Valet_BigRig_Vehicle_C.PawnEnterVehicleSeat
// 0x0020 (0x0020 - 0x0000)
struct Valet_BigRig_Vehicle_C_PawnEnterVehicleSeat final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AFortPawn*                              PlayerPawn;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SeatIndex;                                         // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_BigRig_Vehicle_C_PawnEnterVehicleSeat) == 0x000008, "Wrong alignment on Valet_BigRig_Vehicle_C_PawnEnterVehicleSeat");
static_assert(sizeof(Valet_BigRig_Vehicle_C_PawnEnterVehicleSeat) == 0x000020, "Wrong size on Valet_BigRig_Vehicle_C_PawnEnterVehicleSeat");
static_assert(offsetof(Valet_BigRig_Vehicle_C_PawnEnterVehicleSeat, Vehicle) == 0x000000, "Member 'Valet_BigRig_Vehicle_C_PawnEnterVehicleSeat::Vehicle' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_PawnEnterVehicleSeat, PlayerPawn) == 0x000010, "Member 'Valet_BigRig_Vehicle_C_PawnEnterVehicleSeat::PlayerPawn' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_PawnEnterVehicleSeat, SeatIndex) == 0x000018, "Member 'Valet_BigRig_Vehicle_C_PawnEnterVehicleSeat::SeatIndex' has a wrong offset!");

// Function Valet_BigRig_Vehicle.Valet_BigRig_Vehicle_C.PawnExitVehicleSeat
// 0x0020 (0x0020 - 0x0000)
struct Valet_BigRig_Vehicle_C_PawnExitVehicleSeat final
{
public:
	TScriptInterface<class IFortVehicleInterface> Vehicle;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class AFortPawn*                              PlayerPawn;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SeatIndex;                                         // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_BigRig_Vehicle_C_PawnExitVehicleSeat) == 0x000008, "Wrong alignment on Valet_BigRig_Vehicle_C_PawnExitVehicleSeat");
static_assert(sizeof(Valet_BigRig_Vehicle_C_PawnExitVehicleSeat) == 0x000020, "Wrong size on Valet_BigRig_Vehicle_C_PawnExitVehicleSeat");
static_assert(offsetof(Valet_BigRig_Vehicle_C_PawnExitVehicleSeat, Vehicle) == 0x000000, "Member 'Valet_BigRig_Vehicle_C_PawnExitVehicleSeat::Vehicle' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_PawnExitVehicleSeat, PlayerPawn) == 0x000010, "Member 'Valet_BigRig_Vehicle_C_PawnExitVehicleSeat::PlayerPawn' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_PawnExitVehicleSeat, SeatIndex) == 0x000018, "Member 'Valet_BigRig_Vehicle_C_PawnExitVehicleSeat::SeatIndex' has a wrong offset!");

// Function Valet_BigRig_Vehicle.Valet_BigRig_Vehicle_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct Valet_BigRig_Vehicle_C_UserConstructionScript final
{
public:
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Valet_BigRig_Vehicle_C_UserConstructionScript) == 0x000004, "Wrong alignment on Valet_BigRig_Vehicle_C_UserConstructionScript");
static_assert(sizeof(Valet_BigRig_Vehicle_C_UserConstructionScript) == 0x000008, "Wrong size on Valet_BigRig_Vehicle_C_UserConstructionScript");
static_assert(offsetof(Valet_BigRig_Vehicle_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue) == 0x000000, "Member 'Valet_BigRig_Vehicle_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(Valet_BigRig_Vehicle_C_UserConstructionScript, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000004, "Member 'Valet_BigRig_Vehicle_C_UserConstructionScript::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");

}

