#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValetVehicle_Driver_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// ScriptStruct ValetVehicle_Driver_AnimBP.ValetVehicle_Driver_AnimBP_C.AnimBlueprintGeneratedConstantData
// 0x01D7 (0x01D8 - 0x0001)
struct ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_527;                                // 0x0004(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_528;                                  // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_529;                                // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_530;                                 // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_531;                                // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_532;                                 // 0x001C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_533;                                // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_534;                                 // 0x0024(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_535;                                // 0x0028(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_536;                                 // 0x002C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_537;                                // 0x0030(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_538;                                 // 0x0034(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_539;                                // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_540;                                 // 0x003C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_541;                                // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_542;                                 // 0x0044(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_543;                               // 0x0048(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_544;                                // 0x0058(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_545;                                // 0x005C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_546;                                // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_547;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 __ArrayProperty_548;                               // 0x0068(0x0010)(BlueprintVisible, EditFixedSize)
	class FName                                   __NameProperty_549;                                // 0x0078(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_550;                            // 0x0080(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_551;                            // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_552;                                // 0x0090(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_553;                                 // 0x0094(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_554;                            // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class FName                                   __NameProperty_555;                                // 0x00A0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_556;                                 // 0x00A4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERefPoseType                                  __ByteProperty_557;                                // 0x00A8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_558;                                // 0x00AC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __IntProperty_559;                                 // 0x00B0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendProfile*                          __BlendProfile_560;                                // 0x00B8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCurveFloat*                            __CurveFloat_561;                                  // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EAlphaBlendOption                             __EnumProperty_562;                                // 0x00C8(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBlendListTransitionType                      __EnumProperty_563;                                // 0x00C9(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 __ArrayProperty_564;                               // 0x00D0(0x0010)(BlueprintVisible, EditFixedSize)
	ESequenceEvalReinit                           __ByteProperty_565;                                // 0x00E0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_566;                              // 0x00E8(0x0018)(BlueprintVisible, NoDestructor)
	bool                                          __BoolProperty_567;                                // 0x0100(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_568;                               // 0x0104(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputScaleBiasClampConstants          __StructProperty_569;                              // 0x0108(0x002C)(BlueprintVisible, NoDestructor)
	float                                         __FloatProperty_570;                               // 0x0134(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_571;                                // 0x0138(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimSyncMethod                               __EnumProperty_572;                                // 0x0139(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimGroupRole                                __ByteProperty_573;                                // 0x013A(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13B[0x1];                                      // 0x013B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_574;                                // 0x013C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0140(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x01C0(0x0018)()
};
static_assert(alignof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x000008, "Wrong alignment on ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(sizeof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData) == 0x0001D8, "Wrong size on ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_527) == 0x000004, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_527' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendSpace_528) == 0x000008, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendSpace_528' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_529) == 0x000010, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_529' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_530) == 0x000014, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_530' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_531) == 0x000018, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_531' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_532) == 0x00001C, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_532' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_533) == 0x000020, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_533' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_534) == 0x000024, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_534' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_535) == 0x000028, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_535' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_536) == 0x00002C, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_536' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_537) == 0x000030, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_537' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_538) == 0x000034, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_538' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_539) == 0x000038, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_539' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_540) == 0x00003C, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_540' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_541) == 0x000040, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_541' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_542) == 0x000044, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_542' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_543) == 0x000048, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_543' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_544) == 0x000058, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_544' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_545) == 0x00005C, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_545' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_546) == 0x000060, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_546' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_547) == 0x000064, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_547' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_548) == 0x000068, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_548' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_549) == 0x000078, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_549' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_550) == 0x000080, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_550' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_551) == 0x000088, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_551' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_552) == 0x000090, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_552' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_553) == 0x000094, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_553' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __AnimSequenceBase_554) == 0x000098, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__AnimSequenceBase_554' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_555) == 0x0000A0, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_555' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_556) == 0x0000A4, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_556' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_557) == 0x0000A8, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_557' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_558) == 0x0000AC, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_558' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __IntProperty_559) == 0x0000B0, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__IntProperty_559' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __BlendProfile_560) == 0x0000B8, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__BlendProfile_560' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __CurveFloat_561) == 0x0000C0, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__CurveFloat_561' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_562) == 0x0000C8, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_562' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_563) == 0x0000C9, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_563' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __ArrayProperty_564) == 0x0000D0, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__ArrayProperty_564' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_565) == 0x0000E0, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_565' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_566) == 0x0000E8, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_566' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_567) == 0x000100, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_567' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_568) == 0x000104, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_568' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __StructProperty_569) == 0x000108, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__StructProperty_569' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __FloatProperty_570) == 0x000134, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__FloatProperty_570' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __BoolProperty_571) == 0x000138, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__BoolProperty_571' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __EnumProperty_572) == 0x000139, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__EnumProperty_572' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __ByteProperty_573) == 0x00013A, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__ByteProperty_573' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, __NameProperty_574) == 0x00013C, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::__NameProperty_574' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_PropertyAccess) == 0x000140, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_PropertyAccess' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData, AnimBlueprintExtension_Base) == 0x0001C0, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedConstantData::AnimBlueprintExtension_Base' has a wrong offset!");

// ScriptStruct ValetVehicle_Driver_AnimBP.ValetVehicle_Driver_AnimBP_C.AnimBlueprintGeneratedMutableData
// 0x00C7 (0x00C8 - 0x0001)
struct ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedMutableData final : public FAnimBlueprintMutableData
{
public:
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase;                                // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_0;                                 // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_1;                              // 0x0018(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_2;                              // 0x0020(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_3;                              // 0x0028(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_4;                              // 0x0030(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_5;                                 // 0x0038(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_6;                              // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_7;                              // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_8;                              // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_9;                              // 0x0058(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_10;                                 // 0x0060(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __FloatProperty_11;                                // 0x0064(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_12;                             // 0x0068(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_13;                             // 0x0070(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_14;                             // 0x0078(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_15;                                 // 0x0080(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_16;                                 // 0x0081(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_17;                             // 0x0088(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          __BoolProperty_18;                                 // 0x0090(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __BoolProperty_19;                                 // 0x0091(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      __AnimSequenceBase_20;                             // 0x0098(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_21;                             // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_22;                             // 0x00A8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            __BlendSpace_23;                                   // 0x00B0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         __FloatProperty_24;                                // 0x00B8(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __FloatProperty_25;                                // 0x00BC(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __AnimSequenceBase_26;                             // 0x00C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x000008, "Wrong alignment on ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(sizeof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedMutableData) == 0x0000C8, "Wrong size on ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedMutableData");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedMutableData, __AnimSequenceBase) == 0x000008, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedMutableData::__AnimSequenceBase' has a wrong offset!");
static_assert(offsetof(ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedMutableData, __FloatProperty_0) == 0x000010, "Member 'ValetVehicle_Driver_AnimBP::FAnimBlueprintGeneratedMutableData::__FloatProperty_0' has a wrong offset!");
