#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ValetVehiclePassengerLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ValetVehiclePassengerLayerAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ValetVehiclePassengerLayerAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on ValetVehiclePassengerLayerAnimBP_C_AnimGraph");
static_assert(sizeof(ValetVehiclePassengerLayerAnimBP_C_AnimGraph) == 0x000010, "Wrong size on ValetVehiclePassengerLayerAnimBP_C_AnimGraph");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ValetVehiclePassengerLayerAnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP
// 0x0090 (0x0090 - 0x0000)
struct ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlayerAnimInstance*                K2Node_DynamicCast_AsFort_Player_Anim_Instance;    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetVehicleActor_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortDagwoodVehicle*                    K2Node_DynamicCast_AsFort_Dagwood_Vehicle;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AFortDagwoodVehicle>     CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0050(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortVehicleAnimInstance*               K2Node_DynamicCast_AsFort_Vehicle_Anim_Instance;   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP) == 0x000008, "Wrong alignment on ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP");
static_assert(sizeof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP) == 0x000090, "Wrong size on ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, EntryPoint) == 0x000000, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_GetAnimInstance_ReturnValue) == 0x000020, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, K2Node_DynamicCast_AsFort_Player_Anim_Instance) == 0x000028, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::K2Node_DynamicCast_AsFort_Player_Anim_Instance' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_GetVehicleActor_ReturnValue) == 0x000038, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_GetVehicleActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, K2Node_DynamicCast_AsFort_Dagwood_Vehicle) == 0x000040, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::K2Node_DynamicCast_AsFort_Dagwood_Vehicle' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_IsValid_ReturnValue_1) == 0x000049, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000050, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_GetAnimInstance_ReturnValue_1) == 0x000078, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, K2Node_DynamicCast_AsFort_Vehicle_Anim_Instance) == 0x000080, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::K2Node_DynamicCast_AsFort_Vehicle_Anim_Instance' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000089, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00008A, "Member 'ValetVehiclePassengerLayerAnimBP_C_ExecuteUbergraph_ValetVehiclePassengerLayerAnimBP::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.VehicleFullBodyOverride
// 0x0030 (0x0030 - 0x0000)
struct ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride final
{
public:
	struct FPoseLink                              InPoseFullBody;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              InPoseUpperAndLowerCachePose;                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              VehicleFullBodyOverride_0;                         // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride) == 0x000008, "Wrong alignment on ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride");
static_assert(sizeof(ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride) == 0x000030, "Wrong size on ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride, InPoseFullBody) == 0x000000, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride::InPoseFullBody' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride, InPoseUpperAndLowerCachePose) == 0x000010, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride::InPoseUpperAndLowerCachePose' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride, VehicleFullBodyOverride_0) == 0x000020, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleFullBodyOverride::VehicleFullBodyOverride_0' has a wrong offset!");

// Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.VehicleLowerBodyOverride
// 0x0030 (0x0030 - 0x0000)
struct ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride final
{
public:
	struct FPoseLink                              InPoseLowerBodyDefault;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              InPoseUpperBody;                                   // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              VehicleLowerBodyOverride_0;                        // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride) == 0x000008, "Wrong alignment on ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride");
static_assert(sizeof(ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride) == 0x000030, "Wrong size on ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride, InPoseLowerBodyDefault) == 0x000000, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride::InPoseLowerBodyDefault' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride, InPoseUpperBody) == 0x000010, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride::InPoseUpperBody' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride, VehicleLowerBodyOverride_0) == 0x000020, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleLowerBodyOverride::VehicleLowerBodyOverride_0' has a wrong offset!");

// Function ValetVehiclePassengerLayerAnimBP.ValetVehiclePassengerLayerAnimBP_C.VehicleSplitBodyOverride
// 0x00B8 (0x00B8 - 0x0000)
struct ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride final
{
public:
	struct FPoseLink                              InPoseSplitBody;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              InPoseUpperAndLowerBody;                           // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FFortAnimInput_TurnInPlace             TurnInPlace;                                       // 0x0020(0x0078)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FPoseLink                              InPoseUpperAndLowerBodyRemoveRoot;                 // 0x0098(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              VehicleSplitBodyOverride_0;                        // 0x00A8(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride) == 0x000008, "Wrong alignment on ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride");
static_assert(sizeof(ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride) == 0x0000B8, "Wrong size on ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride, InPoseSplitBody) == 0x000000, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride::InPoseSplitBody' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride, InPoseUpperAndLowerBody) == 0x000010, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride::InPoseUpperAndLowerBody' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride, TurnInPlace) == 0x000020, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride::TurnInPlace' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride, InPoseUpperAndLowerBodyRemoveRoot) == 0x000098, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride::InPoseUpperAndLowerBodyRemoveRoot' has a wrong offset!");
static_assert(offsetof(ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride, VehicleSplitBodyOverride_0) == 0x0000A8, "Member 'ValetVehiclePassengerLayerAnimBP_C_VehicleSplitBodyOverride::VehicleSplitBodyOverride_0' has a wrong offset!");

}

