#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VehicleGaugeWidget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_0_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VehicleGaugeWidget.VehicleGaugeWidget_C
// 0x0420 (0x07D0 - 0x03B0)
class UVehicleGaugeWidget_C final : public UFortAthenaVehicleDashboardWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NoFuelMessage;                                     // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BoostFull;                                         // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BoostEngage;                                       // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NameOutro;                                         // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NameIntro;                                         // 0x03D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       IsLowFuel;                                         // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Sparks;                                            // 0x03E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_BoostGlow;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BoostIcon;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BoostMeter;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_darken;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Glow;                                        // 0x0410(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LargeCone;                                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LowFuelIcon;                                 // 0x0420(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LowFuelPulse;                                // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_messageBG;                                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Meter;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MeterIcon;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_MeterIconGlow;                               // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Pulse;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RoundCard_Bolt;                              // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Sparks;                                      // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Sparks_1;                                    // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Speedometer;                                 // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_BoostSparks;                               // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_CarInfo;                                   // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_FuelContainer;                             // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_LowFuel;                                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NoFuelMessage;                             // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_NoFuelText;                                // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayBoostMeter;                                 // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_Boost;                                      // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcherLegacy*            Switcher_FuelWarning;                              // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_FuelInfinite;                                 // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_FuelMax;                                      // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_FuelMin;                                      // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGameplayTagContainer                  HiddenHUDElements;                                 // 0x04D8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          BoostEffectsVisible;                               // 0x04F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isLowFuelState;                                    // 0x04F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FA[0x2];                                      // 0x04FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LowFuelAmount;                                     // 0x04FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               ImageSecondaryMeterMaterial;                       // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ImageMeterColorParamName;                          // 0x0508(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ImageMeterBoostColor;                              // 0x050C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ImageMeterFuelColor;                               // 0x051C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            ImageSparksBoostColor;                             // 0x052C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            ImageSparks1BoostColor;                            // 0x0540(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            ImagePulseBoostColor;                              // 0x0554(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            ImageGlowBoostColor;                               // 0x0568(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            ImageSparksFuelColor;                              // 0x057C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            ImageSparks1FuelColor;                             // 0x0590(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            ImagePulseFuelColor;                               // 0x05A4(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            ImageGlowFuelColor;                                // 0x05B8(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         MeterIndicatorMinAngle;                            // 0x05CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MeterIndicatorMaxAngle;                            // 0x05D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ImageMeterFillParamName;                           // 0x05D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SparkMaterialsGoUp;                                // 0x05D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D9[0x7];                                      // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            MeterIconBoostBrush;                               // 0x05E0(0x00C0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            MeterIconGlowBoostColor;                           // 0x06A0(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_6B4[0xC];                                      // 0x06B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            MeterIconFuelBrush;                                // 0x06C0(0x00C0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            MeterIconGlowFuelColor;                            // 0x0780(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_794[0x4];                                      // 0x0794(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               ImageBoostMaterial;                                // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BoostGlowMaterial;                                 // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SecondarMeterFillLineColor_Default;                // 0x07A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SecondarMeterFillLineColor_LowFuel;                // 0x07B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SecondaryMeterFillLineColor_ParamName;             // 0x07C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_VehicleGaugeWidget(int32 EntryPoint);
	void OnBoostFinished();
	void OnBoostStarted();
	void OnFuelValueChanged(float FuelPercentage, bool bIsLowOnFuel);
	void OnLowFuel();
	void OnOutOfFuel();
	void OnPlayerFacingNameUpdated();
	void OnPopUpOnSwitchDone();
	void OnRechargableBoostFilled();
	void OnRPMChanged(float NormalizedRPM);
	void OnUpdateRechargeableBoostPercent(float BoostPercent);
	void OnWidgetVisibilityChanged(bool bNewVisibility);
	void PreConstruct(bool IsDesignTime);
	void SetVehicleHasInfiniteFuel(bool bInfiniteFuel);
	void SetVehicleUsesRechargableBoost(bool bUsesRechargeableBoost);
	void ShowNoFuelMessage();
	void StopBoostStuff();
	void UpdateFuelChanged(float FuelPercent, bool LowFuel);
	void UpdateSpeedometer(float NormalizedSpeed, float RawSpeed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VehicleGaugeWidget_C">();
	}
	static class UVehicleGaugeWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVehicleGaugeWidget_C>();
	}
};
static_assert(alignof(UVehicleGaugeWidget_C) == 0x000010, "Wrong alignment on UVehicleGaugeWidget_C");
static_assert(sizeof(UVehicleGaugeWidget_C) == 0x0007D0, "Wrong size on UVehicleGaugeWidget_C");
static_assert(offsetof(UVehicleGaugeWidget_C, UberGraphFrame) == 0x0003B0, "Member 'UVehicleGaugeWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, NoFuelMessage) == 0x0003B8, "Member 'UVehicleGaugeWidget_C::NoFuelMessage' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, BoostFull) == 0x0003C0, "Member 'UVehicleGaugeWidget_C::BoostFull' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, BoostEngage) == 0x0003C8, "Member 'UVehicleGaugeWidget_C::BoostEngage' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, NameOutro) == 0x0003D0, "Member 'UVehicleGaugeWidget_C::NameOutro' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, NameIntro) == 0x0003D8, "Member 'UVehicleGaugeWidget_C::NameIntro' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, IsLowFuel) == 0x0003E0, "Member 'UVehicleGaugeWidget_C::IsLowFuel' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Sparks) == 0x0003E8, "Member 'UVehicleGaugeWidget_C::Sparks' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Image_BoostGlow) == 0x0003F0, "Member 'UVehicleGaugeWidget_C::Image_BoostGlow' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Image_BoostIcon) == 0x0003F8, "Member 'UVehicleGaugeWidget_C::Image_BoostIcon' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Image_BoostMeter) == 0x000400, "Member 'UVehicleGaugeWidget_C::Image_BoostMeter' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Image_darken) == 0x000408, "Member 'UVehicleGaugeWidget_C::Image_darken' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Image_Glow) == 0x000410, "Member 'UVehicleGaugeWidget_C::Image_Glow' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Image_LargeCone) == 0x000418, "Member 'UVehicleGaugeWidget_C::Image_LargeCone' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Image_LowFuelIcon) == 0x000420, "Member 'UVehicleGaugeWidget_C::Image_LowFuelIcon' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Image_LowFuelPulse) == 0x000428, "Member 'UVehicleGaugeWidget_C::Image_LowFuelPulse' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Image_messageBG) == 0x000430, "Member 'UVehicleGaugeWidget_C::Image_messageBG' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Image_Meter) == 0x000438, "Member 'UVehicleGaugeWidget_C::Image_Meter' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Image_MeterIcon) == 0x000440, "Member 'UVehicleGaugeWidget_C::Image_MeterIcon' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Image_MeterIconGlow) == 0x000448, "Member 'UVehicleGaugeWidget_C::Image_MeterIconGlow' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Image_Pulse) == 0x000450, "Member 'UVehicleGaugeWidget_C::Image_Pulse' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Image_RoundCard_Bolt) == 0x000458, "Member 'UVehicleGaugeWidget_C::Image_RoundCard_Bolt' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Image_Sparks) == 0x000460, "Member 'UVehicleGaugeWidget_C::Image_Sparks' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Image_Sparks_1) == 0x000468, "Member 'UVehicleGaugeWidget_C::Image_Sparks_1' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Image_Speedometer) == 0x000470, "Member 'UVehicleGaugeWidget_C::Image_Speedometer' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Overlay_BoostSparks) == 0x000478, "Member 'UVehicleGaugeWidget_C::Overlay_BoostSparks' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Overlay_CarInfo) == 0x000480, "Member 'UVehicleGaugeWidget_C::Overlay_CarInfo' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Overlay_FuelContainer) == 0x000488, "Member 'UVehicleGaugeWidget_C::Overlay_FuelContainer' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Overlay_LowFuel) == 0x000490, "Member 'UVehicleGaugeWidget_C::Overlay_LowFuel' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Overlay_NoFuelMessage) == 0x000498, "Member 'UVehicleGaugeWidget_C::Overlay_NoFuelMessage' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Overlay_NoFuelText) == 0x0004A0, "Member 'UVehicleGaugeWidget_C::Overlay_NoFuelText' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, OverlayBoostMeter) == 0x0004A8, "Member 'UVehicleGaugeWidget_C::OverlayBoostMeter' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Spacer_Boost) == 0x0004B0, "Member 'UVehicleGaugeWidget_C::Spacer_Boost' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Switcher_FuelWarning) == 0x0004B8, "Member 'UVehicleGaugeWidget_C::Switcher_FuelWarning' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Text_FuelInfinite) == 0x0004C0, "Member 'UVehicleGaugeWidget_C::Text_FuelInfinite' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Text_FuelMax) == 0x0004C8, "Member 'UVehicleGaugeWidget_C::Text_FuelMax' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, Text_FuelMin) == 0x0004D0, "Member 'UVehicleGaugeWidget_C::Text_FuelMin' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, HiddenHUDElements) == 0x0004D8, "Member 'UVehicleGaugeWidget_C::HiddenHUDElements' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, BoostEffectsVisible) == 0x0004F8, "Member 'UVehicleGaugeWidget_C::BoostEffectsVisible' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, isLowFuelState) == 0x0004F9, "Member 'UVehicleGaugeWidget_C::isLowFuelState' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, LowFuelAmount) == 0x0004FC, "Member 'UVehicleGaugeWidget_C::LowFuelAmount' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, ImageSecondaryMeterMaterial) == 0x000500, "Member 'UVehicleGaugeWidget_C::ImageSecondaryMeterMaterial' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, ImageMeterColorParamName) == 0x000508, "Member 'UVehicleGaugeWidget_C::ImageMeterColorParamName' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, ImageMeterBoostColor) == 0x00050C, "Member 'UVehicleGaugeWidget_C::ImageMeterBoostColor' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, ImageMeterFuelColor) == 0x00051C, "Member 'UVehicleGaugeWidget_C::ImageMeterFuelColor' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, ImageSparksBoostColor) == 0x00052C, "Member 'UVehicleGaugeWidget_C::ImageSparksBoostColor' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, ImageSparks1BoostColor) == 0x000540, "Member 'UVehicleGaugeWidget_C::ImageSparks1BoostColor' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, ImagePulseBoostColor) == 0x000554, "Member 'UVehicleGaugeWidget_C::ImagePulseBoostColor' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, ImageGlowBoostColor) == 0x000568, "Member 'UVehicleGaugeWidget_C::ImageGlowBoostColor' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, ImageSparksFuelColor) == 0x00057C, "Member 'UVehicleGaugeWidget_C::ImageSparksFuelColor' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, ImageSparks1FuelColor) == 0x000590, "Member 'UVehicleGaugeWidget_C::ImageSparks1FuelColor' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, ImagePulseFuelColor) == 0x0005A4, "Member 'UVehicleGaugeWidget_C::ImagePulseFuelColor' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, ImageGlowFuelColor) == 0x0005B8, "Member 'UVehicleGaugeWidget_C::ImageGlowFuelColor' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, MeterIndicatorMinAngle) == 0x0005CC, "Member 'UVehicleGaugeWidget_C::MeterIndicatorMinAngle' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, MeterIndicatorMaxAngle) == 0x0005D0, "Member 'UVehicleGaugeWidget_C::MeterIndicatorMaxAngle' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, ImageMeterFillParamName) == 0x0005D4, "Member 'UVehicleGaugeWidget_C::ImageMeterFillParamName' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, SparkMaterialsGoUp) == 0x0005D8, "Member 'UVehicleGaugeWidget_C::SparkMaterialsGoUp' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, MeterIconBoostBrush) == 0x0005E0, "Member 'UVehicleGaugeWidget_C::MeterIconBoostBrush' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, MeterIconGlowBoostColor) == 0x0006A0, "Member 'UVehicleGaugeWidget_C::MeterIconGlowBoostColor' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, MeterIconFuelBrush) == 0x0006C0, "Member 'UVehicleGaugeWidget_C::MeterIconFuelBrush' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, MeterIconGlowFuelColor) == 0x000780, "Member 'UVehicleGaugeWidget_C::MeterIconGlowFuelColor' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, ImageBoostMaterial) == 0x000798, "Member 'UVehicleGaugeWidget_C::ImageBoostMaterial' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, BoostGlowMaterial) == 0x0007A0, "Member 'UVehicleGaugeWidget_C::BoostGlowMaterial' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, SecondarMeterFillLineColor_Default) == 0x0007A8, "Member 'UVehicleGaugeWidget_C::SecondarMeterFillLineColor_Default' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, SecondarMeterFillLineColor_LowFuel) == 0x0007B8, "Member 'UVehicleGaugeWidget_C::SecondarMeterFillLineColor_LowFuel' has a wrong offset!");
static_assert(offsetof(UVehicleGaugeWidget_C, SecondaryMeterFillLineColor_ParamName) == 0x0007C8, "Member 'UVehicleGaugeWidget_C::SecondaryMeterFillLineColor_ParamName' has a wrong offset!");

}

