#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MountedCannon_PingTarget_Ring

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function W_MountedCannon_PingTarget_Ring.W_MountedCannon_PingTarget_Ring_C.SetTargetColor
// 0x0024 (0x0024 - 0x0000)
struct W_MountedCannon_PingTarget_Ring_C_SetTargetColor final
{
public:
	struct FLinearColor                           Color_0;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0014)()
};
static_assert(alignof(W_MountedCannon_PingTarget_Ring_C_SetTargetColor) == 0x000004, "Wrong alignment on W_MountedCannon_PingTarget_Ring_C_SetTargetColor");
static_assert(sizeof(W_MountedCannon_PingTarget_Ring_C_SetTargetColor) == 0x000024, "Wrong size on W_MountedCannon_PingTarget_Ring_C_SetTargetColor");
static_assert(offsetof(W_MountedCannon_PingTarget_Ring_C_SetTargetColor, Color_0) == 0x000000, "Member 'W_MountedCannon_PingTarget_Ring_C_SetTargetColor::Color_0' has a wrong offset!");
static_assert(offsetof(W_MountedCannon_PingTarget_Ring_C_SetTargetColor, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'W_MountedCannon_PingTarget_Ring_C_SetTargetColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function W_MountedCannon_PingTarget_Ring.W_MountedCannon_PingTarget_Ring_C.SetTargetSize
// 0x0004 (0x0004 - 0x0000)
struct W_MountedCannon_PingTarget_Ring_C_SetTargetSize final
{
public:
	float                                         SizeOverride;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_MountedCannon_PingTarget_Ring_C_SetTargetSize) == 0x000004, "Wrong alignment on W_MountedCannon_PingTarget_Ring_C_SetTargetSize");
static_assert(sizeof(W_MountedCannon_PingTarget_Ring_C_SetTargetSize) == 0x000004, "Wrong size on W_MountedCannon_PingTarget_Ring_C_SetTargetSize");
static_assert(offsetof(W_MountedCannon_PingTarget_Ring_C_SetTargetSize, SizeOverride) == 0x000000, "Member 'W_MountedCannon_PingTarget_Ring_C_SetTargetSize::SizeOverride' has a wrong offset!");

}

